{"title":"Strayed v1.0.4","uid":15368478,"size":313946701,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:007b3b5d79252ad469c02c6952c5c7a437245e9f&amp;dn=Strayed+v1.0.4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1469116060,"description":"Joseph Toddy. Ex-marine, a wise man. Now retired, fishing was one of his greatest passions and he also used it as an extra income. And so followed by some years of his life, as usual, he woke up early, gave his wife a kiss and headed towards another day of fishing, but his partner, who was always with him, unfortunately could not accompany him this time. Even knowing the risks of sailing on the sea alone and its tricks as well, he decided to proceed. All quiet on the high seas, the day was productive, certainly he would make good money, until he noticed a small flaw in the engine of his boat. Joseph was startled, but he did not care so much. A fatal error. After a few hours, when the day began to fall and the fisherman was about to go home, he realized that the engine of his boat could not work more. He had experience with the sea, but he wasn't a good mechanic. The man found himself adrift, surrounded by the sea water, when suddenly spotted a desert island, he knew it wasn't a place inhabited, but that could be his unique chance to survive","torrent":{"xt":"urn:btih:007b3b5d79252ad469c02c6952c5c7a437245e9f","amp;dn":"Strayed+v1.0.4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"007b3b5d79252ad469c02c6952c5c7a437245e9f","infoHashBuffer":{"type":"Buffer","data":[0,123,59,93,121,37,42,212,105,192,44,105,82,197,199,164,55,36,94,159]},"announce":[],"urlList":[]}}