{"title":"Rush Limbaugh - May 23, 2016 Full Podcast.mp3","uid":14684786,"size":259811924,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:068a43fc3b452d57e6ea8a7e12a3fba55ff4655d&amp;dn=Rush+Limbaugh+-+May+23%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1464125512,"description":"Rush Limbaugh - May 23, 2016 Full Podcast\r\nmp3\r\n\r\nDo Martyrs Get Virgins or Raisins?\r\n\r\nHillary's $21-Million Speech Scandal\r\nRUSH: I don't think you're gonna see this story in the New York Times or the Washington Post. I don't think any of the nightly newscasts are gonna make a big deal of it.  It's gonna be the kind of thing that, if she loses, in their postmortems they're gonna go back to and say, &quot;You know what?  We missed this when this happened, but the exit polling will show it, that people thought she was inexorably tied to corporate America.&quot;  I'm telling you, folks: $21 million over two years for 20 or 25 minutes?  There's nothing that screeches &quot;out of touch&quot; more than that. That is just huge. \r\n\r\n\r\nIt Wasn't Supposed to Go This Way for Mrs. Clinton\r\n\r\nRUSH: This wasn't supposed to happen.  See, Hillary was supposed to be coronated by now, and over on the Republican side is where the knock down, drag out was supposed to be happening. They were supposed to be beating themselves up, and whoever won the nomination was supposed to have been destroyed in the primary process -- and it's the exact opposite.\r\n\r\nSports Drive-Bys Upset by Poll Showing 90% of Native Americans Aren't Offended by the Redskins Nickname\r\n\r\nRUSH: The Sports Drive-Bys are not happy, and the sports Drive-Bys (I won't mention any names) are out there lecturing Native Americans on how they should care, and they're lecturing everybody else on how they should care.\r\n\r\n\r\n\r\nWhat Really Went Down in Baltimore\r\n\r\nRUSH: Let's go back and listen to Marilyn Mosby.  She's the state attorney here, and this is the day -- it's May 1st of 2015, a little over a year ago. She's announcing all of these charges, and it took her 15 minutes to recite these charges if you recall.  You may not recall.  I do.  I was here.  Fifteen minutes to recite all the charges.  She overcharged this.  I actually think -- there's a part of me that thinks -- that Marilyn Mosby had to know she wasn't gonna get convictions on very many of these charges.  I think the point of making the charges was to satisfy the mob at the time.  Because, you know, many people think a charge is the equivalent of a guilty verdict.\r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:068a43fc3b452d57e6ea8a7e12a3fba55ff4655d","amp;dn":"Rush+Limbaugh+-+May+23%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"068a43fc3b452d57e6ea8a7e12a3fba55ff4655d","infoHashBuffer":{"type":"Buffer","data":[6,138,67,252,59,69,45,87,230,234,138,126,18,163,251,165,95,244,101,93]},"announce":[],"urlList":[]}}