{"title":"I'm In Love With A Stripper","uid":15142076,"size":3977256650,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0750f0aa838ea27a6140d8de8269292df64e1aed&amp;dn=I%27m+In+Love+With+A+Stripper&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":1,"time":1467205464,"description":"I'm In Love With A Stripper\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=8103000582\r\n \nhttp://imagedisco.net/?g=8370796404\r\n\r\n\r\nPlot:\r\n\r\nStripping porn! Have you ever fantasized about taking home your favorite stripper? Let ZT make your dreams cum true with the ultimate private lap dance in this titillating movie, the adult DVD I'm in Love with a Stripper that gives you more than just a front row experience! Stars Julia Ann, Romi Rain, and more! Cause none of the strippers you've seen look like this! Whether you like pussy that's inexperienced like Romi Rain or mature like Julia Ann, this one's got you covered!NO GERMS! Well, aside from your own, of course. All it takes for these guys to fall in love, or at least in heat, with a stripper is to lie back and watch her sensual and sultry moves. A fine assortment of mostly busty stripper-types who want to take a lap dance all the way includes some notable names, and undoubtedly a few former (or current) strippers. Courtney Taylor is one such dancer, and Mark Wood doesn’t have a chance once she leaves the pole in favor of mounting his lap. She gets right to business and grinds on his groin for quite a while prior to unzipping, sucking away, and riding Wood with plenty of dirty talk to add to his apparent enjoyment. Almost the same scenario follows with Logan Pierce and Romi Rain. The most believable, and desirable, has to be Julia Ann in the opening scene. She uses every bit of her seduction knowledge to give Jesse Jones his ultimate stripper experience. Well done, lady—and a fine twisting, two-handed blowjob to end the treat.\r\n\r\nProduction: Studio Zero Tolerance, 2013\r\nDirector: Mike Quasar\r\nStarring: Jessa Rhodes, Julia Ann, Romi Rain, Courtney Taylor, Nikita Von James, Mick Blue, Mark Wood, John Strong, Logan Pierce, Jessy Jones","torrent":{"xt":"urn:btih:0750f0aa838ea27a6140d8de8269292df64e1aed","amp;dn":"I%27m+In+Love+With+A+Stripper","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0750f0aa838ea27a6140d8de8269292df64e1aed","infoHashBuffer":{"type":"Buffer","data":[7,80,240,170,131,142,162,122,97,64,216,222,130,105,41,45,246,78,26,237]},"announce":[],"urlList":[]}}