{"title":"Coast to Coast June 7 16 Homeland Security Revelations","uid":14827700,"size":28048364,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0a582b3d3ea0fa206675bb87237f0af1993a99fe&amp;dn=Coast+to+Coast+June+7+16+Homeland+Security+Revelations&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1465315636,"description":"Homeland Security Revelations/ Bio-Communication\r\n\r\nDate: \tMonday - June 6, 2016\r\nHost: \tGeorge Noory\r\nGuests: \tPhilip Haney, Art Moore, Gerald Epling\r\n\r\nPhilip Haney studied Arabic culture and language while working as a scientist in the Middle East before becoming a founding member of the Department of Homeland Security (DHS) in 2002. He joined WND editor Art Moore to discuss how after Haney's sterling career at DHS, he was disciplined for investigating potential terrorists and terror-linked Muslims and mosques -- including information that might have prevented the Boston Marathon bombing, and later the San Bernadino massacre. Haney's first sign of conflict with the DHS occurred in 2006, when he wrote an article for the web called Green Tide Rising related to Palestinian voters endorsing Hamas. The DHS accused him of breaching protocol, and committing an ethical violation, though he was eventually exonerated.\r\n\r\nMoore detailed how Haney was ordered by the DHS to alter or modify information because it was not politically correct. The problem with Saudi Arabia in relation to terrorism, said Haney, is that the country supports Islamic schools called madrasas in Pakistan, India, and Bangladesh. They send Saudi males there to be educated in Koranic theology and other Islamic texts, and these schools often function as a breeding ground for terrorist organizations, he cited. Further, we need to look closer at the fact that Islam teaches Sharia law, which is incompatible with the US constitution, Haney emphasized\r\n \nhttp://www.coasttocoastam.com/show/2016/06/06","torrent":{"xt":"urn:btih:0a582b3d3ea0fa206675bb87237f0af1993a99fe","amp;dn":"Coast+to+Coast+June+7+16+Homeland+Security+Revelations","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a582b3d3ea0fa206675bb87237f0af1993a99fe","infoHashBuffer":{"type":"Buffer","data":[10,88,43,61,62,160,250,32,102,117,187,135,35,127,10,241,153,58,153,254]},"announce":[],"urlList":[]}}