{"title":"Rush Limbaugh - June 2, 2016 Full Podcast.mp3","uid":14774223,"size":95892234,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0b4acf0dd0f7611c494688295b246397d6122eb5&amp;dn=Rush+Limbaugh+-+June+2%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1464933845,"description":"Rush Limbaugh - June 2, 2016 Full Podcast\r\n\r\nRush Hudson Limbaugh III is an American entertainer, radio talk show host, writer, and conservative political commentator. Since he was 16, Limbaugh has worked a series of disc jockey jobs. Wikipedia\r\n\r\nProfessor Limbaugh's Dissertation on the &quot;Intellectual Stammer&quot;\r\n\r\nRUSH: The intellectual stammer is an actual rehearsed and practiced art of speech in the intellectual world.  It is done purposely, and the purpose of it is to convey serious, deep ponderances, incredibly deep thoughts.  The intellectual stammer is designed as a signature, in a way, to set the intellectual way, way, way apart and above you.  The intellectual stammer, as I say, is a practiced and honed speech pattern.  I've recognized it.  I have been able to learn it and mock it and imitate it.  I've seen it frequently. Many intellectual stammerers were regular guests on William F. Buckley's Firing Line.\r\n\r\nAn Obama Post-Presidency Preview\r\n\r\nRUSH: We are in this guy's head rent free. This is so indicative... I'm telling you, this is instructive.  The guy's really irritated.  He's one of these people that expects nobody to ever doubt him -- and, when somebody does, there's something seriously wrong with them. \r\n\r\nI'm Trending on Fakebook Again Because Liberals Are Totally Humorless\r\n\r\nTrump's Strategy to Combat the Media\r\n\r\nRUSH: I don't think Trump has thin skin.  He may, but I don't think that's what you're seeing.  I think what you're seeing is a philosophy.  Donald Trump has been a public figure for a long time.  As such, there have been many things that he considered wrong, damaging, lies, harmful, written and said about him. And, at some point, he devised a personal strategy for dealing with it, and we're seeing it in action. \r\n\r\nHow Can You Listen to This Show for 20 Years and Remain a Liberal?\r\n\r\nRUSH: Oh, no, what happened to the guy? Oh, for crying out loud, did you get his number?  Aw.  You know, we had a guy -- this is why I wanted to get to calls in the first hour.  We had a guy who claims to be a 20-year listener. He's a hard-core leftist but loves the program. He says he hears things, news things, stories, that he doesn't hear anywhere else, that's why he listens.  He doesn't get mad.  He appreciates the passion I bring, and he thinks that I'd be a great guy to have a sit-down, face-to-face conversation with.  Is that what he was gonna say?  And I was gonna ask, &quot;How can you be a 20-year listener here and still remain a liberal?&quot;\r\n\r\nStruggling Hillary Plays the Victim Card\r\n\r\nRUSH: Who would say that?  You know, what she's saying is that people admittedly come up to her and admit that they're sexists.  &quot;Gee, I really like you, Mrs. Clinton.  I just don't know if I can vote for a woman.&quot;  Do you know what that is?  That is also an insult to every potential voter in this country.  She's playing the victim card. \r\n\r\n\r\nThomas &quot;Loopy&quot; Friedman Has a Big Problem with Testosterone and Balls\r\n\r\nRUSH: He was wildly gesticulating; he was leaning forward, his chin sometimes on the table; his eyes were rolling; his eyebrows were going all over the place like Peter Jennings used to do; and he was pounding the table... Apparently he's really, really anxious out there over the potential damage to our great culture if Donald Trump is elected. He said that Trump's answer to the world's problems is nothing but testosterone and balls.  \r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:0b4acf0dd0f7611c494688295b246397d6122eb5","amp;dn":"Rush+Limbaugh+-+June+2%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b4acf0dd0f7611c494688295b246397d6122eb5","infoHashBuffer":{"type":"Buffer","data":[11,74,207,13,208,247,97,28,73,70,136,41,91,36,99,151,214,18,46,181]},"announce":[],"urlList":[]}}