{"title":"[Clips4sale] Fell -On: Fetish Factory - Madisin In Get Ready For","uid":14792950,"size":1065922808,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0b7fbfd9dc23ac4fc013d02415d880129fe53eff&amp;dn=%5BClips4sale%5D+Fell+-On%3A+Fetish+Factory+-+Madisin+In+Get+Ready+For&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"enterdrone","files":1,"time":1465075586,"description":"\n\r\n\r\nMadisin Lee - Get ready for g 720p.mp4\r\nSize: 1065922808 bytes (1016.54 MiB), duration: 00:19:52, avg.bitrate: 7154 kb/s\r\nAudio: aac, 48000 Hz, stereo (eng)\r\nVideo: h264, yuv420p, 1280x720, 29.97 fps(r) (eng)\r\n\r\nAdded: 4/9/16\r\n\r\n\r\nI was just about to leave to go hang out with my boys and pick up some hot chicks, when my mom came home in a panic. WTF! She told me that I had to stay home and help her clean the house because grandma was coming over. Damn, there goes my plans! I went in the kitchen to get a drink and my mom came in wearing her tight yoga pants and a white tank top with no bra. Damn! My mom is so fine! She bent over the counter to show me what to do, although I was not paying attention, I could not stop staring at her big round ass. She barked a bunch of orders at me and then ran out of the kitchen. I followed after her, because I needed another look. Holy ! I found her cleaning the windows with her breast up against the window and her shirt was wet. Damn, she caught me. I found her again bent over and again wet in the shower. I was so hot and hard from seeing her that I could not focus on cleaning. She came into the kitchen and found me on a ladder and she confronted me about spying on her. She saw my hard on and grabbed it. I tried to brush her off but she pulled down my shorts and put it in her mouth. WTF! She starting sucking my cock and the next thing I know I am fucking her! We were so hot for each other that I gave her a facial and then we heard a knock at the door. Damn! Its grandma!\r\n\r\n\r\nFor the MP4 version click: Get Ready For Grandma\r\nCategory: MOMMAS BOY\r\nRelated Categories: MILF, TABOO, FUCKING, BIG BUTTS, FACIALS\r\nKeywords: madisin lee, freddie cee, fucking, milf, mommas boy, doggiestyle, big butts, big tits, face fucking, facials, taboo, mom, son, family sex","torrent":{"xt":"urn:btih:0b7fbfd9dc23ac4fc013d02415d880129fe53eff","amp;dn":"%5BClips4sale%5D+Fell+-On%3A+Fetish+Factory+-+Madisin+In+Get+Ready+For","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b7fbfd9dc23ac4fc013d02415d880129fe53eff","infoHashBuffer":{"type":"Buffer","data":[11,127,191,217,220,35,172,79,192,19,208,36,21,216,128,18,159,229,62,255]},"announce":[],"urlList":[]}}