{"title":"Chasing Amy Soundtrack - (Complete) 30 Tracks. mp3","uid":15385713,"size":196559662,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0dd817cf3a5f63d6c46dd04d4352d19acc11c36f&amp;dn=Chasing+Amy+Soundtrack+-+%28Complete%29+30+Tracks.+mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Zeus1970","files":31,"time":1469290678,"description":"The Unofficial Chasing Amy Soundtrack - Complete. 30 tracks.\r\n\r\nI've searched the net extensively to try to find an edition of the Chasing Amy Soundtrack that is complete or correct, and I've found neither. The tracklists I dug up were either incomplete, tracks added in to supplement laziness, or incorrect tags. So I compiled my own, with a couple of sound-grabs for your enjoyment. They may not be the funniest bits according to you, but funny either way. \r\n\r\nThe following tracks appear in order of chronology and all tags are provided. I really hope you all enjoy this COMPLETE and CORRECT version of one of Kevin Smith's early classics.\r\n\r\n1.  Tube Of Wonderful (Opening Theme).mp3\r\n2.  Let's Go.mp3\r\n3.  Star Wars (Dialogue).mp3\r\n4.  Live Wire.mp3\r\n5.  The Impression That I Get.mp3\r\n6.  Ain't Nothin' Goin' On But The Rent.mp3\r\n7.  Run's House.mp3\r\n8.  Shared a Moment (Dialogue)+It's Ya' Birthday.mp3\r\n9.  Alive.mp3\r\n10. Red Alert.mp3\r\n11. Insomnia (Monster Mix).mp3\r\n12. Passion.mp3\r\n13. I Don't Care.mp3\r\n14. We're In It For The Money.mp3\r\n15. California.mp3\r\n16. Variety is the Spice of Life (Dialogue).mp3\r\n17. Jump Start.mp3\r\n18. S.A.T. Question (Dialogue).mp3\r\n19. Puppy Love.mp3\r\n20. Bach Prelude #2 In C Minor.mp3\r\n21. Red.mp3\r\n22. My Mama Never Taught Me How To.mp3\r\n23. Lucky One.mp3\r\n24. Fingercuffs (Dialogue).mp3\r\n25. Can't Do Nuttin' For Ya Man.mp3\r\n26. Have You Seen Mary.mp3\r\n27. Be Yourself.mp3\r\n28. Fight at the Hockey Game (Dialogue).mp3\r\n29. Stay.mp3\r\n30. We 3.mp3\r\n\r\n\r\nI also found this in the ViewAskew website as an explanation provided by Kevin himself. Hope it helps. \r\n\r\nQuestion: \r\n        Kevin, love your stuff, man. I have one question, though. Your other two movies had fantastic soundtracks. Why did &quot;Chasing Amy&quot; not have one?\r\n\r\nKevin: \r\n        Interesting story there. Long one, though. Got a minute? So this local Jersey rocker tells us that he wants to record a song for the flick. And at this point, we were out to other labels, seeing if they were interested in picking the soundtrack up (which admittedly was somewhat unappetizing for any label, being that it was made up largely of what they call 'catalogue songs' (older, previously released material). So Jersey Rocker Boy has Scott (my producer) and I over to his house, and not only does he hand us a song he's written, but he's also recorded it! He plays the tune for us, and it's tremendous. We're giving him huge props (&quot;Oh, Jersey Rocker Boy - you're the man!&quot; and that kind of thing). He says &quot;If you like it, it's your's. Do whatever you want with it,&quot; and makes mention that his label would probably want to put it out, and we could do the soundtrack there. So at this point, all bets elsewhere are off, and we're doing the soundtrack at his label. But then, a week later, we get a call - it's not going to happen. It seems that Jersey Rocker Boy's label put the fear of God in him about his own upcoming album release, maintaining that it'll canibalize sales of said release if they release a soundtrack with a song by the artist before release of his new album. Confused? So were we. Suddenly, Jersey Rocker Boy was out, and other labels were even less receptive than they were before. Then, good ol' Dave Pirner (who is really the Man), gets involved and does not just the score, but also a song or two, and helps pick out all the tunes for the flick. Unfortunately, it was too close to the release for a lot of labels (who consider soundtracks to be a commercial for the flick and vice versa). Hence, no soundtrack. It's a shame too, because it was my fave of the three. Pirner did a tremendous job.\r\n\r\nAOL Chat Session, May 21st, 1997","torrent":{"xt":"urn:btih:0dd817cf3a5f63d6c46dd04d4352d19acc11c36f","amp;dn":"Chasing+Amy+Soundtrack+-+%28Complete%29+30+Tracks.+mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dd817cf3a5f63d6c46dd04d4352d19acc11c36f","infoHashBuffer":{"type":"Buffer","data":[13,216,23,207,58,95,99,214,196,109,208,77,67,82,209,154,204,17,195,111]},"announce":[],"urlList":[]}}