{"title":"Rush Limbaugh - July 26, 2016 Full Podcast.mp3","uid":15417712,"size":261811859,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:117594847062131469b62afce60429daa65f39e5&amp;dn=Rush+Limbaugh+-+July+26%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1469602197,"description":"Rush Limbaugh - July 26, 2016 Full Podcast\r\n\r\nDemocrat Psychosis on Display\r\n\r\nRUSH:  I now watch with a different perspective.  I watch with a lot of sadness.  I watch this lunacy that we saw last night, and if you didn't watch it, don't worry, you'll get enough of a flavor for it after I finish the program today. You'll know.  It was sheer lunacy.  A lot of it was delusional and deranged.  A lot of it was unhinged.  The reason that I watch it with sadness is the realization now that close to 50% of the people in this country who vote eat it up\r\nMy Idea for a Short Trump Speech\r\n\r\nRUSH: My idea for a Trump speech would be simply to list -- and this is not instead of what he's doing; this is an addendum.  My idea for a short Trump speech, maybe an intro to the speech that he's gonna give to his improv at all of these appearances, is just list who the Democrats are.  Black Lives Matter, New Black Panthers, Occupy Wall Street, stripping God from their party platform, transgender bathroom advocates, pro-death panels, baby butchers!\r\n\r\nA candidate who violated the Espionage Act thousands of times, sexual predators, pedophiles, illegals, Sharia Muslims, Marxists.  That's the Democrat Party today.  That's who votes for them; that's who the Democrats defend.  And then, after listing the various constituencies of the Democrat Party -- 'cause that's who they are now. I mean, the Democrats used to have white, working-class males.  Trump owns them now.  Another Big Labor union came out and endorsed Trump.  They're losing the old faction of constituency groups and they've got a new group. \r\n\r\nMichelle Thinks America Is Great Now That Her Husband Has Transformed It\r\n\r\nRUSH: She's gotta give her husband credit. In her mind and his, with the way they are transforming America, I think they think it is on the way to greatness.  Maybe what they think is that the changes they are instituting, the changes being implemented are great to bring about the transformation this country deserves, because it's been much too powerful and much too rich for way too long.\r\n \nhttp://www.rushlimbaugh.com/daily/2016/07/26/my_idea_for_a_short_trump_speech","torrent":{"xt":"urn:btih:117594847062131469b62afce60429daa65f39e5","amp;dn":"Rush+Limbaugh+-+July+26%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"117594847062131469b62afce60429daa65f39e5","infoHashBuffer":{"type":"Buffer","data":[17,117,148,132,112,98,19,20,105,182,42,252,230,4,41,218,166,95,57,229]},"announce":[],"urlList":[]}}