{"title":"Battle For Honor: Gates - RJ Brousseau (Game Of Thrones/Fantasy)","uid":14755260,"size":1622215,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:126026e0c1715d0f4de018e491e855ae0ad4eae7&amp;dn=Battle+For+Honor%3A+Gates+-+RJ+Brousseau+%28Game+Of+Thrones%2FFantasy%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimlikesmayo","files":1,"time":1464797648,"description":"Three thousand years ago, Agora was brought to the brink of annihilation by the Third Great War. Since then, all has remained peaceful – until now. Challenges present themselves daily and the right response is paramount to survival. \r\n\r\nMarcus awakens in a world he does not know. Possessing the skills of a seasoned warrior, with the ability to unleash devastating magic, he ventures into the unknown to discover himself, the world and answers to the mysteries surrounding him. Who are these Guardians guiding him on this life’s mission? What do the Gods want? \r\n\r\nThe elf king, Kenric, rose from the rank of commoner at great personal expense; sacrificing everything he truly loves, including his wife and only son. He loyally serves his nation and people, believing his decisions will return them to a level of greatness that was lost long ago. The elf queen, Celeste, his second wife, wishes to serve her goddess, but secretly longs for the throne and the power it holds. \r\n\r\nThorel is a dwarf adventurer forced into the public eye, driven by his convictions to do what he believes is right, all the while hiding from himself and the true greatness that lies deep within his soul. He and his fellow adventurers possess a unique view of the world, plying their skills for a price. After all, a paladin has to eat. \r\n\r\nThorel discovers Marcus near death, the victim of a savage kobold attack, and is stunned to see the man being protected by two of the most vile and dangerous beasts of the tundra. Shortly after, the natural order of the world pivots at a remote village in a frozen wasteland. It is here that one man stands for what is right, instead of accepting the status-quo – and the world is forever changed. \r\n\r\nThe undead walk the lands, but why, and how did this come to be? Have the necromancers learned how to control their minions? The God of Death has indeed grown in power since the Third Great War. Have his worshipers followed suit? \r\n\r\nAs the world prepares for Armageddon, countries return to their old ways and beliefs’, vying to protect what is theirs and what they know to be true. Each nation only thinks about itself, causing isolation and division throughout the lands. \r\n\r\nNo matter the race, no matter the person, there is good and evil in all of us. Is it possible for the few to stand against the many? Has magic become too powerful to control? Do the Gods control our destiny, or do we? What will come of a single person, a single act, defying the laws of the land and the Gods themselves? The journey has been set in motion, leading towards a collision course with the greatest battle this world has ever known. \r\n\r\nWelcome to Agora","torrent":{"xt":"urn:btih:126026e0c1715d0f4de018e491e855ae0ad4eae7","amp;dn":"Battle+For+Honor%3A+Gates+-+RJ+Brousseau+%28Game+Of+Thrones%2FFantasy%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"126026e0c1715d0f4de018e491e855ae0ad4eae7","infoHashBuffer":{"type":"Buffer","data":[18,96,38,224,193,113,93,15,77,224,24,228,145,232,85,174,10,212,234,231]},"announce":[],"urlList":[]}}