{"title":"The Upperfloor--tUF-40273 Janice Griffith, Veronica Avluv and Mi","uid":14664910,"size":3497499214,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:15369f969524af713d8d9b5312e39bcf69c99cab&amp;dn=The+Upperfloor--tUF-40273+Janice+Griffith%2C+Veronica+Avluv+and+Mi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":2,"time":1463793172,"description":"The Nymphomaniac's Apprentice\r\n\r\nMay 20, 2016 - Performers: Mickey Mod ,  Veronica Avluv  and  Janice Griffith \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nVeronica Avluv is a sexual phenomenon, injecting unbridled, squirting, orgasmic submissive energy into every Upper Floor Service she provides. The House wishes for more slaves like her to add to our nymphomaniac stock, and petite Janice Griffith has been chosen. Janice's doll like features disguise a monstrous sexual appetite and hungry squirting pussy that takes an unforgiving pounding and fisting and then asks for more. These gorgeous sex slaves shall be trained, their hole's stretched, asses fucked in tight rope bondage, and left begging for cum by the end of the day. The first order of business is to show Janice that her new life will be without rules, in chains, with her only guiding principles being pleasure and pain. As Veronica repeatedly answers every question with a plead for cock and has her round as and pink cunt slapped, Janice gets the picture and leaves the world of discipline for one of hard cock and torment, having her own tiny frame beaten with canes, floggers, and hot wax while she begs to have her tiny pussy stretched and made to squirt. Once both ladies have been thoroughly warmed up they are brought into the Master bedroom and the real training begins : double fisting, jerking the Master's cock off inside your sister in slavehood, dousing the room in squirt, and still craving more. Off to a running start, we hope to have two nymphomaniac slaves in our care within the year.\r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=40273\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:15369f969524af713d8d9b5312e39bcf69c99cab","amp;dn":"The+Upperfloor--tUF-40273+Janice+Griffith%2C+Veronica+Avluv+and+Mi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15369f969524af713d8d9b5312e39bcf69c99cab","infoHashBuffer":{"type":"Buffer","data":[21,54,159,150,149,36,175,113,61,141,155,83,18,227,155,207,105,201,156,171]},"announce":[],"urlList":[]}}