{"title":"Hypervalent Iodine in Organic Synthesis - A. Varvoglis","uid":15382941,"size":9202429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:158b1bff0b3af254c8986e4e6f5f32a6b2e812c5&amp;dn=Hypervalent+Iodine+in+Organic+Synthesis+-+A.+Varvoglis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1469248826,"description":"Hypervalent Iodine in Organic Synthesis - A. Varvoglis (AP, 1997).pdf\r\n\r\nThis book describes the fascinating chemistry of the many kinds of organic compounds of hypervalent iodine. Each chapter deals with a particular iodine compound or families of compounds which have been used as reagents in a plethora of useful transformations. These include assorted oxidation, such as with the precious Dess-Martin reagent as well as with a wide range of further reactions.\r\nProminent features of hypervalent iodine reagents derived from iodobenzene are: ready availability, operational simplicity, mild reaction conditions, and high efficiency. They are environmentally safe and can be recycled. New species may be easily prepared by introducing substituents in the benzene ring or changing the ligand attached to iodine. Their combination with other reagents broadens considerably their synthetic potential. Today, no synthetic chemist can afford to ignore the valuable hypervalentiodine reagents. \r\n\r\nKey Features\r\n* Features up-to-date coverage of a wide range of topics\r\n* Includes many tables featuring a diversity of reactivity, and a comprehensive index\r\n* Acts as a comprehensive, up-to-date reference on all aspects of hypervalent iodine chemistry\r\n* Contains a section on unusual efficiency of hypervalent iodine reactions","torrent":{"xt":"urn:btih:158b1bff0b3af254c8986e4e6f5f32a6b2e812c5","amp;dn":"Hypervalent+Iodine+in+Organic+Synthesis+-+A.+Varvoglis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"158b1bff0b3af254c8986e4e6f5f32a6b2e812c5","infoHashBuffer":{"type":"Buffer","data":[21,139,27,255,11,58,242,84,200,152,110,78,111,95,50,166,178,232,18,197]},"announce":[],"urlList":[]}}