{"title":"{TeamSkeet -  InnocentHigh} Jenna Reid - Bad Chemistry = Great S","uid":14817372,"size":1408856057,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:16cc821be3a959d51a4d3448081532470f69da34&amp;dn=%7BTeamSkeet+-++InnocentHigh%7D+Jenna+Reid+-+Bad+Chemistry+%3D+Great+S&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"porn4u","files":1,"time":1465243268,"description":"{TeamSkeet -  InnocentHigh} Jenna Reid - Bad Chemistry = Great Sex (06 June 2016) 720p\r\n\r\nJenna had to stay after school to fulfill some extra credit for her chemistry class. Mr. Gunn is not too thrilled since he had other things he would rather be doing, but sometimes you have to do what you have to do. He reminds Jenna throughout her project to make sure she is paying attention to the labels, or else something terrible could happen! Jenna of course does the exact opposite and causes a mini explosion. Luckily, Mr. Gunn rushes straight to the rescue. He instructs Jenna to immediately take off her cloths because the chemicals she was working with were super caustic and could possibly cause chemical burns. She strips down to her birthday suit, and once Mr. Gunn gets a look at Jennas hot body, he has an idea. Since her extra credit was pretty much ruined form this explosion, maybe if she blows him and lets him fuck her she can get that extra A she needs oh so bad. CLASS IS IN SESSION! Jenna drops down to her knees like a good little slut and gives Mr. Gunns Cock a saliva filled rubdown which did wonders for the immense stress he has from teaching chemistry all day. Then Jenna relaxes her tight teen pussy and allows it to ride her teacher all up on his desk. All that pre cum and pussy juice might cause a chemical reaction of blissful proportions hehe. Jenna makes sure to have her safety goggles on before she gets jizzed on, safety first! Now if only she could learn to read the warning labels on her chemicals...\r\n\r\nScreenshoot:\r\n\r\n \nhttp://imgdone.com/viewer.php?file=29801145230024409838.jpg","torrent":{"xt":"urn:btih:16cc821be3a959d51a4d3448081532470f69da34","amp;dn":"%7BTeamSkeet+-++InnocentHigh%7D+Jenna+Reid+-+Bad+Chemistry+%3D+Great+S","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16cc821be3a959d51a4d3448081532470f69da34","infoHashBuffer":{"type":"Buffer","data":[22,204,130,27,227,169,89,213,26,77,52,72,8,21,50,71,15,105,218,52]},"announce":[],"urlList":[]}}