{"title":"Richard Hoagland - The Other Side of Midnight  - May 2016","uid":14816822,"size":662095809,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1bd34cd30f3ed39c172f7f9b11bb66c3262b76c7&amp;dn=Richard+Hoagland+-+The+Other+Side+of+Midnight++-+May+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NotHuman","files":8,"time":1465241259,"description":"Richard C. Hoagland - The Other Side of Midnight KCAA radio show MP3s\r\nMay 2016 (6 shows) \r\n\r\n***\r\n\r\nNOTE: 2016-06-06\r\n\r\nThe show has left the Dark Matter Digital Network and moved to KCAA, a terrestrial station.  Unfortunately, I missed this info and was still recording on DMDN for most of May.  As a result, I only have 6 shows for the month.  If anyone has any missing shows from May 2016, please email me at devoidzero AT gmail DOT com.\r\n\r\nAnother small issue is that the last 20 seconds or so of each show are cut off.  I adjusted the stop time in my recording program and this will be fixed for future shows.\r\n\r\n\r\n***\r\n\r\nThis is a collection of MP3s of The Other Side of Midnight, a radio program hosted by Richard C. Hoagland.  \r\n\r\nThe Other Side of Midnight now airs on the radio station KCAA based in Loma Linda, California and streaming via TuneIn and the show's own website.  It airs weekdays from 3-5am  Eastern (12-2am Pacific).  From the website:     \r\n\r\n &quot;The Other Side of Midnight hosted by Richard C. Hoagland takes you on a journey through the minds of exceptional scientific experts, investigators and analysts.\r\n \r\n Panel discussions will feature opposing points of view to discuss a wide variety of positions on science, humanity and government projects, while also venturing into comparisons of our own science fiction dreams and the reality of our human existence.&quot;\r\n\r\nThe MP3s were captured directly from the OSOM radio stream at its broadcast bitrate of 128kbps using the program streamWriter, with no re-encoding performed.  The commercials have not been removed.  All MP3s are properly tagged with the guest name and topic in the comments tag.    \r\n\r\nMy plan is to seed a new Other Side of Midnight torrent at the end of each month, containing all of the shows for that month.  \r\n\r\nIf you are planning on downloading multiple torrents, simply point each torrent to download to the top level folder above the &quot;Richard C. Hoagland - The Other Side of Midnight (KCAA)&quot; folder and the individual months will download to their own subfolders.  \r\n\r\nThe name of each torrent may appear the same in your BT client (depending on the client).  This is necessary to keep the folder structure I want as this will be a series of torrents with subfolders.  You can see which month/year a torrent is by clicking the Files tab for each torrent.  \r\n\r\n\r\nRelevant links:\r\n \nhttp://theothersideofmidnight.com/\r\n \nhttp://tunein.com/radio/KCAA-1050-s31934/\r\n \nhttp://www.enterprisemission.com/","torrent":{"xt":"urn:btih:1bd34cd30f3ed39c172f7f9b11bb66c3262b76c7","amp;dn":"Richard+Hoagland+-+The+Other+Side+of+Midnight++-+May+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bd34cd30f3ed39c172f7f9b11bb66c3262b76c7","infoHashBuffer":{"type":"Buffer","data":[27,211,76,211,15,62,211,156,23,47,127,155,17,187,102,195,38,43,118,199]},"announce":[],"urlList":[]}}