{"title":"Howells- Hymnus paradisi- Hill, Bournemouth SO (2006) [Philidor]","uid":15385835,"size":190373750,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1d04127d16b23f86f8469992bb6bd0fd3facc495&amp;dn=Howells-+Hymnus+paradisi-+Hill%2C+Bournemouth+SO+%282006%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Philidor","files":10,"time":1469291856,"description":"In mid-summer, 1935, composer Herbert Howell and his family vacationed in Gloucestershire. While there, his 9-year-old son, Michael, took ill. Five days later, he was dead from polio.\r\n\r\nThis loss, and the grief and other emotions it caused, were to inform much of the choral music that he continued to compose for the rest of his life. Arguably his greatest choral work, the Hymnus paradisi, was written under its shadow. Howells' daughter, Ursula, seeking to ease his pain, suggested he create a threnody for his son in music, and achieve some measure of emotional release. He came upon a text in Helen Waddell's Mediieval Latin Lyrics which began with the lines, translated into English, &quot;Take him, earth, for cherishing/To thy tender breast receive him.&quot; They were to sit as an inscription at the top of the new score, which drew in some measure, greatly transformed, from an earlier Requiem Howells had never finished.\r\n\r\nSince the Hymnus paradisi was an intensely personal work, meant as a catharsis for his tragedy and a means to work through it, when it was completed in short score in 1938 it was set aside. Only in 1949, when Herbert Sunsion, then Master of Music at Gloucester Cathedral, approached Howells for a composition for the Three Choirs festival the following year, was the work brought to light. Howells played it through to him on the piano, and Sunsion urged its use. But the composer had second thoughts, and it took the combined persuasion of his friends, Adrian Boult, Ralph Vaughan Williams, and Gerald Finzi to convince Howells of its importance. It saw light of day in September, 1950, and was heralded by that cringe-worthy, overused designation, &quot;a masterpiece.&quot; Perhaps in this case, at least, it was worth it.\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nBio enclosed, along with essay, text, and translations. You can find all my classical uploads by searching on Philidor, or in this thread:\r\n  \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:1d04127d16b23f86f8469992bb6bd0fd3facc495","amp;dn":"Howells-+Hymnus+paradisi-+Hill%2C+Bournemouth+SO+%282006%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d04127d16b23f86f8469992bb6bd0fd3facc495","infoHashBuffer":{"type":"Buffer","data":[29,4,18,125,22,178,63,134,248,70,153,146,187,107,208,253,63,172,196,149]},"announce":[],"urlList":[]}}