{"title":"Hot Legs And Feet - Katarina Muti, Candee Licious [720p]","uid":14897197,"size":2752115830,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1d38fbfa4378518d9168f6a77a6b95f638a1d96e&amp;dn=Hot+Legs+And+Feet+-+Katarina+Muti%2C+Candee+Licious+%5B720p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"hunter534","files":1,"time":1465783302,"description":"Join us for an amazing adventure into delicious desires of two absolutely stunning lesbians! This episode of DDF Networku2019s Hot Legs &amp; Feet gives you some fabulous closeup shots of Karina Muti licking yoghurt from her playmateu2019s sexy feet. The blonde hottie Candee Licious sits on the table while her brunette roommate covers her toes in strawberry yoghurt. Dinner is served, let the licking begin! They please each other with some extremely sexy foot play and cover their tasty toes in creamy tastiness! Itu2019s a kinky mess and the two get fully naked and keep sucking their toes, while their nipples get harder and harder and their snatches wetter and wetter. Once the feet are licked clean, the two lesbian foot lovers shift onto the couch in the living room and start sucking on a strap-on dildo. The blonde bombshell wraps that sex toy around her athletic thigh and starts banging her girlfriend, who rubs her clit while getting her shaved young pussy stuffed. She returns the favor with a pink vibrator and keeps inserting that dong into her breath-taking friendu2019s cunny while licking her feet and sucking her big toe. The scene comes to an end when both sugar babes reach their climaxes. What a tasty porn movie!\r\n\r\nSize: 2.56 GiB\r\nTime: 00:54:49\r\nFormat: MP4\r\nGenre: Lesbian, Blondes, Brunettes, European, Girls, Big Butt, Teen, Natural Tits, Masturbation, Lesbo, Porn Stars\r\nCast: Katarina Muti, Candee Licious\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-575df798ad862.html \r\n \nhttp://photo-up.info/img-575df7a464e1e.html","torrent":{"xt":"urn:btih:1d38fbfa4378518d9168f6a77a6b95f638a1d96e","amp;dn":"Hot+Legs+And+Feet+-+Katarina+Muti%2C+Candee+Licious+%5B720p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d38fbfa4378518d9168f6a77a6b95f638a1d96e","infoHashBuffer":{"type":"Buffer","data":[29,56,251,250,67,120,81,141,145,104,246,167,122,107,149,246,56,161,217,110]},"announce":[],"urlList":[]}}