{"title":"daños y perjuicios 02x13.FINAL.spanish","uid":14775313,"size":225330034,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:207194ccb9efd16119b9949a4874521e654324b6&amp;dn=da%26ntilde%3Bos+y+perjuicios+02x13.FINAL.spanish&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eltiotony","files":1,"time":1464948382,"description":"La Temporada 2 comienza cuando la ingenua joven abogada Ellen Parsons (Rose Byrne) hablando con alguien fuera de la pantalla. De repente, ella saca una pistola y aprieta el gatillo dos veces.\r\n\r\nSeis meses antes, un científico misterioso llamado Daniel Purcell (William Hurt) envía unos documentos a Patty (Glenn Close), que le ayudan a conseguir su victoria sobre Arthur Frobisher. Purcell pide ayuda a Patty, proclamando que él está siendo amenazado, pero ella se niega. La noche siguiente, la esposa de Purcell, Christine (Paige Turco), aparece muerta y una aparentemente arrepentida Patty está de acuerdo en ayudarlo. Mientras el caso por asesinato continúa, Patty comienza a darse cuenta de que hay una conspiración entre la empresa científica de Purcell y una importante corporación de energía Ultima National Resources. Con el tiempo, el presunto asesino de la esposa de Purcell es arrestado y la corporación queda expuesta. Cuando Patty se da cuenta de esto, ella decide utilizar un demandante de la UNR para detener lo que podría suceder. Ella es entonces capaz de convencer a Frobisher (Ted Danson) a participar, para reparar su imagen","torrent":{"xt":"urn:btih:207194ccb9efd16119b9949a4874521e654324b6","amp;dn":"da%26ntilde%3Bos+y+perjuicios+02x13.FINAL.spanish","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"207194ccb9efd16119b9949a4874521e654324b6","infoHashBuffer":{"type":"Buffer","data":[32,113,148,204,185,239,209,97,25,185,148,154,72,116,82,30,101,67,36,182]},"announce":[],"urlList":[]}}