{"title":"Bodyhack.Metal.Gear.Man.Two.in.One.Short.Doc.EN.SUB.x265.MPup","uid":14651722,"size":141501589,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2690a6ff96cf1949aa6745f9616f056d0e197944&amp;dn=Bodyhack.Metal.Gear.Man.Two.in.One.Short.Doc.EN.SUB.x265.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"makinapufterpup","files":2,"time":1463639652,"description":"BBC.Documentaries.2016.05.18.Bodyhack.Metal.Gear.Man.Two.in.One.Short.Form.Doc.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\n[i][color=&quot;blue&quot;]This torrent is HEVC x26[/color][color=&quot;red&quot;]5[/color][/i]\r\n[b][color=&quot;purple&quot;]It is[/color] [color=&quot;orange&quot;][u]NOT[/u][/color] [color=&quot;purple&quot;]a x26[/color][color=&quot;red&quot;]4[/color] [color=&quot;purple&quot;]torrent[/color][/b][/size]\r\n[b]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nIn two parts, this powerful short-form documentary follows 25 year-old James Young as he tries to regain control of his body after a terrible accident - by becoming part Cyborg.\r\nJames tragically lost an arm and a leg when he was dragged on to the tracks between two carriages of the London DLR as it was pulling in. Despite his loss, James refuses to let it interrupt his life and love of travel and video games.\r\n\r\nIn a bizarre twist of fate, James receives a bionic arm from gaming company Konami, modelled on lead character Snake from Metal Gear Solid.\r\n\r\nThis moving story is told in a first person perspective including gaming footage and the use of innovative filming techniques with a new type of camera called a ‘dji osmo’.\r\n\r\nWill Saunders, Creative Director of Digital BBC TV Production, says:&quot;We don't have to adhere to durations or TV schedules for some of our storytelling on BBC Three now. We really hope the audiences who mass around Gaming content online will share as well as watch James's amazing story.&quot;\r\n\r\n\t---------------------------------------------\r\n\r\nPart 1 [14:28]\r\n\r\nFollowing his accident, the first short film sees James, an avid gamer, respond to an advert by gaming company Konami, who are looking for an amputee who is interested in wearing a futuristic prosthetic limb.\r\n\r\nJames, who has become extremely adept at playing games one-handed, is selected to have a bionic arm custom made for him by renowned prosthetics artist Sophie De Oliviera Barata and a team of engineers.\r\n\r\nSophie and James work together and take inspiration from the artist of Metal Gear Solid. The arm is bespoke for James and he is able to indulge his fantasies, adding his own drone, lighting which he can change to suit his mood, a laser, a torch, USB port to charge his phone, a sport watch and a bionic hand which will respond to messages sent by his muscles.\r\n\r\nBut being given a new body part is not a simple process, the arm seems to have a life of its own and not all his family is sure it is a good idea becoming part robot.\r\n\r\n\t---------------------------------------------\r\n\r\nPart 2 [16:28]\r\nAfter months of waiting, James receives his new arm and interest in the project with the media starts to grow; he is invited to be a key speaker in the first ever ‘Bodyhacking’ conference in Austin Texas. Bodyhacking is a new movement which is bringing scientist and technologist together to explore ways to optimize the body, from placing magnets in the body so you can open doors and turn on laptops, to tattoos that respond to your moods.\r\n\r\nWith the arm not quite working as it should James starts to wonder if technology is the answer to him finding his way in life again.\r\n\r\nJames discovers through the process is that it is not just about the tech, but the human connections which are going to help him regain control of his life","torrent":{"xt":"urn:btih:2690a6ff96cf1949aa6745f9616f056d0e197944","amp;dn":"Bodyhack.Metal.Gear.Man.Two.in.One.Short.Doc.EN.SUB.x265.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2690a6ff96cf1949aa6745f9616f056d0e197944","infoHashBuffer":{"type":"Buffer","data":[38,144,166,255,150,207,25,73,170,103,69,249,97,111,5,109,14,25,121,68]},"announce":[],"urlList":[]}}