{"title":"Mohra 1994 DVDRip Hindi","uid":15491266,"size":432124393,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26ac252455113eb935fec98d7154bb922ef37c05&amp;dn=Mohra+1994+DVDRip+Hindi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"devil1219","files":1,"time":1470370872,"description":"Staring: Akshay Kumar, Raveena Tandon, Naseeruddin Shah, Sunil Shetty, Paresh Rawal, Raza Murad, Gulshan Grover\r\n\r\nReleasing Year : 1994\r\n\r\nRating : U/A \r\n\r\nFile Size : 411 MB\r\n\r\nVideo Resolution : 640 x 360\r\n\r\nDuration : 2:53:20\r\n\r\nStory : Vishal Agnihotri (Sunil Shetty), a convict, is imprisoned for the murder of a group of four criminals who had brutally raped and killed his sister-in-law. Vishal tries to get justice in court but is unsuccessful and the men are let out free with the help of a corrupt lawyer. They then visit Vishal's home for trying to file a case on them, and try to rape Vishal's wife Priya (Poonam Jhawer), but she kills herself with a knife. Angered at all this Vishal decides to take the matter into his own hands and murders the four criminals himself. He is sentenced for life in prison for the crimes.\r\n\r\nJournalist Roma Singh (Raveena Tandon) visits the jail for a report she's writing, where a few of the convicts tris to rape her. It reminds Vishal of his misfortune. Vishal intervenes and saves Roma. Roma hears Vishal's story and decides to help free him. Her voice is heard out by a blind businessman - Mr Jindal (Naseeruddin Shah) who tries to recruit Vishal as a hitman. He wants Vishal to kill some anti-social elements in the city, mainly the two powerful drug lords Jibran (Raza Murad) and Tyson (Gulshan Grover) and all the people who work for them. He tells Vishal, that these people are responsible for creating people like the group of four men he killed in the first place, by bringing drugs to the streets and corrupting the locals. Vishal refuses at first as he has just got out of prison, and now wants to live a normal life. However, the memories of his murdered family comes back to haunt him as he spends a day alone in his home, and he agrees to work for Jindal. Inspector Sahoo (Paresh Rawal) is very greedy and he becomes informer of Jibraan. He tells all internal matters of police department in return of money.\r\n\r\nPolice Inspector Amar Saxena (Akshay Kumar) is unhappy about the release of Vishal who he believes deserves to be in prison because of the murders he committed. Things complicate even more when Amar finds Vishal around almost every murder scene of criminals involved in drug-trading, who Amar is trying to catch alive. Vishal goes on a murder spree, until he realizes that even the Commissioner (Sadashiv Amrapurkar) thinks that the unknown murderer is doing more help to the society than police could ever do. Vishal refuses to kill the Commissioner, but Jindal becomes angry. Vishal attacks Jindal with a paper-weight, but Jindal dodges it. Vishal then realizes that Jindal is not blind.\r\n\r\nJindal tells Vishal that Jibran and Tyson were his rivals. He also tells that he murdered his wife Pooja (Priya Tendulkar) &amp; Inspector Karan Saxena (who happens to be Amar's father), to cover up the truth. He pretended to be blind to throw the police off his trail. Jindal, who has now partnered with Jibran, leaves Vishal to die. Vishal escaped, only to be confronted by Amar. Vishal subdues Amar &amp; tells him the truth. Inspector Sahoo, who is brought to Jindal by Jibran to give important information about Vishal, tells him that Vishal is alive and will tell the entire truth to Amar and Commissioner by next morning. Then Jindal kidnaps Roma and kills his sub-editor Siddiqui who tries to save Roma. Amar, Vishal and Commissioner goes to Jindal's home to arrest him but they find the Sub-editor Siddiqui brutally murdered at his home. They come to know that Jindal has kidnapped Roma in order to forcefully marry her. Amar &amp; Vishal find out Jindal's den with the help of Inspector Sahoo &amp; corner him.\r\n\r\nAfter a melee, Jibran is killed. Jindal tries to kill Amar, but Vishal takes the bullet on himself. Vishal dies in Amar's lap, upon which Amar kills Jindal and avenges the death of Vishal &amp; his father","torrent":{"xt":"urn:btih:26ac252455113eb935fec98d7154bb922ef37c05","amp;dn":"Mohra+1994+DVDRip+Hindi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26ac252455113eb935fec98d7154bb922ef37c05","infoHashBuffer":{"type":"Buffer","data":[38,172,37,36,85,17,62,185,53,254,201,141,113,84,187,146,46,243,124,5]},"announce":[],"urlList":[]}}