{"title":"Score Videos – Selexia Rae [1080p]","uid":15421999,"size":1022825693,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:275a344fe865ed96cb4083e5c7c647402bd6d3d8&amp;dn=Score+Videos+%26ndash%3B+Selexia+Rae+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hunter534","files":1,"time":1469647716,"description":"Selexia Rae – Selexias Lingerie Voyeur Fuck FlingSelexia Rae ordered sexy lingerie but the delivery never showed. She’s in the middle of speaking to customer service when her neighbor JMac shows up with her package. It was mistakenly delivered to his address by the stupid courier service. JMac notes the return envelope and sees where it came from. Selexia thanks him and closes the door, leaving him standing outside.\r\nBut that won’t stop him. He’s too horny. He’s seen Selexia in a skin-tight dress and wants to see her change into her new purchase so he sneaks around to a window and watches her change. Selexia begins masturbating when she sees him, and walks over to the window. In a bizarre, peepshow style scene, Selexia presses her nipples against the glass, which JMac licks. Selexia sees JMac’s poker sticking out of his fly and invites him in to fuck her, a task he’s anxious to perform. She strokes his shaft as he kisses her boobs and neck. She gets into a kneeling stance and begins blowing him with her pierced tongue, sucking the balls and licking every inch, her head guided by his firm hand.\r\nHe tells her to lie on the couch. He straddles her chest, cock between her breasts so she can suck it more and wrap her big tits around the shaft. Her pussy needs attention too. He pumps her in missionary while she quickly rubs her clit with her fingers. They save the hottest, fastest thrusting for a lap dance fuck, Selexia sitting on his lap. Reaching the point of no return, JMac gets up, positions Selexia on the floor in a kneeling pose and furiously beats off in her face. Her face and her flickering tongue is splattered as he busts his nut all over her lovely face. All this just for being a good neighbor. It pays to care about your community.\r\n\r\nSize: 975.44 MiB\r\nDuration: 00:16:49\r\nFormat: MP4\r\n\r\nGenre: Big Tits, Blonde, Hardcore,A\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://img-one.com/img-5798ef3c2f537.html \r\n \nhttp://img-one.com/img-5798ef42ccb0a.html","torrent":{"xt":"urn:btih:275a344fe865ed96cb4083e5c7c647402bd6d3d8","amp;dn":"Score+Videos+%26ndash%3B+Selexia+Rae+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"275a344fe865ed96cb4083e5c7c647402bd6d3d8","infoHashBuffer":{"type":"Buffer","data":[39,90,52,79,232,101,237,150,203,64,131,229,199,198,71,64,43,214,211,216]},"announce":[],"urlList":[]}}