{"title":"Loving My Family","uid":14741835,"size":1930924450,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2a020051f279b8473e3807c2ed7ed54bd0b3569f&amp;dn=Loving+My+Family&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1464681141,"description":"Cover: \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1317\r\n\r\nPreview: \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1318 \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1319 \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1320 \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1321 \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1322 \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1323\r\n\r\n\r\n\r\nYear: 2016\r\nGenre: Big Boobs, Naturally Busty, Family Roleplay, Older Men, Teens, Star Showcase, All Sex, Blowjob, Doggy, Cowgirl, Shaved\r\nCountry: USA\r\nCast: Hope Harper\r\n\r\n\r\nIt doesn't matter if it's her brother, uncle or daddy, for Hope Harper, family always cums first. The other day my brother came in my room and asked me if we could mess around. I told him I wasn't really in the mood. He got all butthurt so I told him I'd give him a BJ. I licked and sucked his hard cock til he exploded on my face. A few friends and I want to throw a huge party this weekend but the only problem is we need someone's house. I tried to seduce my Uncle Jack to get what I want but he wasn't being as cooperative as I hoped I was even teasing and licking his cock. He wasn't giving in to my demands so I just left him with a huge hardon! Then I went by Daddys office to have a little mid day fun. He wasn't there but while I was searching through his desk I found a glass dildo. I thought it was for his girlfriend and got turned on. It wasn't long before I was using the toy on myself! Dad walked in on me and was upset I found my present I had to make it up to him so his cock replaced the toy and he fucked me until we both came together on his desk. Damn! I totally forgot to ask about the party. I needed to make myself feel better so when my brother got home I had him lay in my bed while I teased him. I took out his hard cock and started playing with the tip. My tongue slid along his cock until he begged me to fuck him. I agreed and climbed on top. After I came, I stroked his throbbing cock until he came all over the place. I wound up apologizing to Uncle Jack and had to give him exactly what he wanted for the use of his house. And of course, after he fucked me my friends canceled the party. I guess I'll just have to amuse myself for the night!! xoxoxo Hope.\r\n\r\n\r\nQuality: WEBRip/SD (Split Scenes)\r\nFormat: MP4\r\nVideo: MPEG4 Video (H264) 852x480 59.92fps 3599kbps [Video]\r\nAudio: AAC 48000Hz stereo 127kbps [Audio]","torrent":{"xt":"urn:btih:2a020051f279b8473e3807c2ed7ed54bd0b3569f","amp;dn":"Loving+My+Family","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a020051f279b8473e3807c2ed7ed54bd0b3569f","infoHashBuffer":{"type":"Buffer","data":[42,2,0,81,242,121,184,71,62,56,7,194,237,126,213,75,208,179,86,159]},"announce":[],"urlList":[]}}