{"title":"Conquering College: The Most Fun You Can Have Learning the Thing","uid":14845866,"size":1713301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d8b395d96c76df875769c69793b5f4f9d523377&amp;dn=Conquering+College%3A+The+Most+Fun+You+Can+Have+Learning+the+Thing&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ackoacko","files":1,"time":1465419118,"description":"Who Am I To Tell You? \r\n  \r\n         I conquered college. \r\n         By this I mean: I received my Bachelor of Science degree from Tulane University (in New Orleans) with honors, sporting a cumulative GPA (Grade Point Average) of 3.9. I completed a double major in Economics and Mathematics, with an additional minor in Theater Arts. You will see evidence of all three throughout this book. \r\n         I was on the Dean's list every term, and was recognized as a Tulane Scholar. I was inducted into the freshman honor society, the math honor society, and Phi Beta Kappa, the national honor society. \r\n         I did all this in three years - not four - saving lots of money. \r\n         On the strength of this record, I was granted a full scholarship to the school of engineering where I completed my Master of Computer Engineering degree in one year (GPA 3.9). \r\n         Then I hit the job market with a vengeance, earning over one million dollars before my 27th birthday (honest, you can check my tax returns). I worked exclusively as an employee, at jobs which I received primarily on the strength of my college record. \r\n         Would you be proud of these accomplishments? \r\n         I am. My college record has been, and will continue to be, a constant source of pleasure (and profit) in my life. I'm always pleased to discuss my college experience with anyone who is interested. My parents and relatives don't care if you're interested; they will tell you about it anyway. \r\n         You see, my parents were not only proud, they were also quite relieved. Before college, I had never been a distinguished student; I got mostly B's and C's from kindergarten through high school","torrent":{"xt":"urn:btih:2d8b395d96c76df875769c69793b5f4f9d523377","amp;dn":"Conquering+College%3A+The+Most+Fun+You+Can+Have+Learning+the+Thing","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d8b395d96c76df875769c69793b5f4f9d523377","infoHashBuffer":{"type":"Buffer","data":[45,139,57,93,150,199,109,248,117,118,156,105,121,59,95,79,157,82,51,119]},"announce":[],"urlList":[]}}