{"title":"Coast Coast July 25 2016 MOB CONFESSIONS","uid":15401347,"size":29341958,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:324ae62e6e4f5720d2ba12a1891540615afd0cb7&amp;dn=Coast+Coast+July+25+2016+MOB+CONFESSIONS&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1469459716,"description":"Coast to Coast July 25, 2016 Mob Confessions\r\nmp3 2 files\r\nIn the first half, George Knapp welcomed investigative author and lawyer Charles Brandt. In the course of nearly five years of recorded interviews, mob strongman Frank Sheeran confessed to Brandt that he handled more than 25 hits for the Mob, and was eventually ordered to kill his friend Jimmy Hoffa. Brandt shared an update to his original investigation with more evidence about Sheeran's involvement with Hoffa, new information on other famous murders, and how the Mob does not take &quot;no&quot; for an answer. Brandt described Sheeran’s extensive WWII battle service and how it changed him from a &quot;Huckleberry Finn type&quot; beforehand, but &quot;came out of the war a changed man.&quot; His strict Catholic upbringing and the morals instilled in him were suppressed by his war experiences. This made him ripe for recruitment by organized crime when he met mobster Russell Bufalino in the 1950s and the two became friends. Bufalino started Sheeran on small jobs, such as collecting unpaid loans, and slowly eased him into actual murders.\r\n\r\nBrandt said that after he got Sheeran out of jail on a medical leave, the two became friends and began a series of interviews in which the former hit man confessed his role as the triggerman in the murder of Hoffa, well as some other famous assassinations, such as the death of crime boss Joey Gallo in 1972. Brandt recalled the account that Sheeran gave him of the murder of Hoffa and how it matched evidence that was later found showing a trail of blood at the house where the alleged hit took place. Brandt also said that Sheeran darkly hinted that he was involved with the assassination of JFK but &quot;would not go anywhere near Dallas&quot; when questioned. A film directed by Martin Scorcese and starring Robert De Niro and Al Pacino based on Brandt’s research is slated to begin production soon. Related article on the search for Hoffa.\r\n \nhttp://www.coasttocoastam.com/show/2016/07/24","torrent":{"xt":"urn:btih:324ae62e6e4f5720d2ba12a1891540615afd0cb7","amp;dn":"Coast+Coast+July+25+2016+MOB+CONFESSIONS","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"324ae62e6e4f5720d2ba12a1891540615afd0cb7","infoHashBuffer":{"type":"Buffer","data":[50,74,230,46,110,79,87,32,210,186,18,161,137,21,64,97,90,253,12,183]},"announce":[],"urlList":[]}}