{"title":"Magnetic Microscopy of Nanostructures - H. Hopster, H.P. Oepen","uid":15521884,"size":7590522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:375e890ec4257b0dd6174b25b68b4ca100238d9f&amp;dn=Magnetic+Microscopy+of+Nanostructures+-+H.+Hopster%2C+H.P.+Oepen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470758310,"description":"Magnetic Microscopy of Nanostructures - H. Hopster, H.P. Oepen (Springer, 2005).pdf\r\n\r\nInrecentyears,anew?eldinsciencehasbeengrowingtremendously,i. e. ,theresearch on nanostructures. In the early beginning, impetus came from different disciplines, like physics, chemistry, and biology, that proposed the possibility of producing str- turesinthesub-micronrange. Theworldwideoperatingelectroniccompaniesrealized that this would open up new ?elds of application, and they proposed very challe- ing projects for the near future. Particularly, nanomagnetism became the focus of new concepts and funding programs, like spintronics or magnetoelectronics. These new concepts created a strong impact on the research ?eld of fabricating nanoscaled magnetic structures. Simultaneously, a demand for appropriate analyzing tools with high spatial resolution arose. Since then, the development of new techniques and the improvement of existing techniques that have the potential of analyzing magnetic properties with high spatial resolution have undergone a renaissance. Aiming at s- tems in the range of some 10nm means that the analyzing techniques have to go beyond that scale in their resolving power. In parallel to the efforts in the commercial sector, a new branch has been established in basic research, i. e. , nanomagnetism, that is concerned with the underlying physics of the fabrication, analyzing techniques, and nano-scaled structures. The progress in one of these ?elds is inherently coupled with better knowledge or understanding and, hence, success in the other ?elds. The imaging technique – as a synonym for spatial resolution – plays a key role in this triangle. In this book, we bring together the state-of-the-art techniques of magnetic im- ing","torrent":{"xt":"urn:btih:375e890ec4257b0dd6174b25b68b4ca100238d9f","amp;dn":"Magnetic+Microscopy+of+Nanostructures+-+H.+Hopster%2C+H.P.+Oepen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375e890ec4257b0dd6174b25b68b4ca100238d9f","infoHashBuffer":{"type":"Buffer","data":[55,94,137,14,196,37,123,13,214,23,75,37,182,139,76,161,0,35,141,159]},"announce":[],"urlList":[]}}