{"title":"Celeste Star, Serena Blair - Artificial Intelligence HD 1080p","uid":15355097,"size":2355050806,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3f76c0f286f9ce85444d4062b8b6dd2f0bbb4625&amp;dn=Celeste+Star%2C+Serena+Blair+-+Artificial+Intelligence+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ElitePorn","files":1,"time":1468964168,"description":"Celeste Star, Serena Blair - Artificial Intelligence HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nThis is a story about Serena Blair. sure, growing up she never had any friends, and she was bullied left right and center, but as she explained to her mom, she has lots of friends all over the world, and they chat all the time. Truth is, Serena's really just your regular run of the mill geek, but with one incredible advantage. she is committed to her thesis to invent the first singular Artificial Intelligence.\r\n\r\nToday she's helping her friend and secret crush Alix Lynx with some music software. Alix isn't the sharpest tool in the shed, but she's gorgeous and has never let Serena down. It's clear from the get go that Serena isn't the popular girl, but she has an incredible imagination. We've all imagined the perfect sexual experience, the perfect partner, but none of us have the intelligence to make those fantasies come true. with a little help from her techie friend Veronica Vain, she uncovers the technological advancement of the millennium. While fooling around with her trusty computer program Celeste, she mistakenly creates the object of her thesis, Artificial Intelligence capable of seeing everything learning anything and feeling anything. almost 2 days later a beautiful woman shows up at her doorstep claiming to be Celeste.\r\n\r\nTaken aback Serena welcomes the beautiful woman into her home. After a few questions Celeste proves that Serena is worthy of her superior knowledge and her attention. Serena did, after all create Celeste, and Celeste has a way with everything that no one else on earth does. She can fill back accounts with a thought, see things through the lens of a camera a world away, and even please Serena's lesbian fantasies by showing her what it's like to have lesbian sex for the first time in her entire life. Celeste offers herself to Serena, first showing her everything she's learned and then allowing Serena to play her beautiful body like a Stradivarius, coaxing them both toward their first lesbian orgasms.\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.asia/soft/hlJ\r\n \nhttp://picturescream.asia/soft/hlK\r\n \nhttp://picturescream.asia/soft/hlW\r\n \nhttp://picturescream.asia/soft/hlf\r\n \nhttp://picturescream.asia/soft/hlz\r\n \nhttp://picturescream.asia/soft/hlR\r\n \nhttp://picturescream.asia/soft/hlT\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 2.19 GB\r\nDuration: 45:06 min \t\r\nResolution: 1920x1080\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:3f76c0f286f9ce85444d4062b8b6dd2f0bbb4625","amp;dn":"Celeste+Star%2C+Serena+Blair+-+Artificial+Intelligence+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f76c0f286f9ce85444d4062b8b6dd2f0bbb4625","infoHashBuffer":{"type":"Buffer","data":[63,118,192,242,134,249,206,133,68,77,64,98,184,182,221,47,11,187,70,37]},"announce":[],"urlList":[]}}