{"title":"Battle For Honor: Rebirth - RJ Brousseau (GOT/Fantasy)","uid":14755264,"size":1748946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40e3a7888a4cd350f2a9979b6e55380156d48ffc&amp;dn=Battle+For+Honor%3A+Rebirth+-+RJ+Brousseau+%28GOT%2FFantasy%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jimlikesmayo","files":1,"time":1464797843,"description":"The winds whip over the hallowed lands of Agora, as all they have ever known is now changing, everything sacred has been shattered and crushed to dust. It has been six years since the dwarf capital Brinstone Gates fell to the invading elf army, but to many, it has been a lifetime. Things haven't been this bleak since the Great War oppression washed over the lands many generations ago. \r\n\r\nThe dwarfs have been allowed to establish a temporary home in MorBlanc, alongside the humans, yet they continue to be persecuted by both known and unknown forces. Thorel is king and desperately tries to keep his people safe, while struggling with everyday politics. Eagan, a former member of the human royal court, is now the sitting queen for the dwarfs, yet exactly where do her loyalties lie? Thorel’s inner circle continues to support the king, although allegiances will be tested. \r\n\r\nThe elves prosper since their conquest, however life is now very different from before, and not everyone is happy. Kenric is wrestling with his inner demons, unable to comprehend why he suffers as he rises to ultimate power. He continues to remain obsessed with his plans to completely wipe out every dwarf, even as a larger goal is in his sights. Celeste no longer speaks with the goddess, instead she longs for more power, and freedom from her ever distant husband. Allies become enemies and alliances never before imaged surface, while the elves consolidate power, tightening their grip around the world’s throat. \r\n\r\nThe humans are growing tired of sharing their home. Their troubled king, Travis, tries to find a way to deal with the public outcry over his decision to aid the dwarfs, all the while feeling his power slipping away. The humans, as well as all the other non-elf races, are feeling isolated, and fear they may be the next on the elf king’s agenda. \r\n\r\nThe savior that descended amongst the dwarf people died by a single arrow, and with that, almost all hope died with him. The avatars are once again dispatched to the physical plane, but this time without guidance. Along with these heroes, a new evil is unleashed upon the world, known only as the shadow knight. \r\n\r\nMagic is even more powerful, and more unstable. Those that are able to control the energies are now able to accomplish great feats, or are consumed by the very powers they crave. Witness the discovery of new races and lands, and watch the vampire clans unite to form an independent nation. \r\n\r\nHow does Thorel, the reluctant king of the dwarfs, respond to these new threats? Who else will stand up against the elf conquest?","torrent":{"xt":"urn:btih:40e3a7888a4cd350f2a9979b6e55380156d48ffc","amp;dn":"Battle+For+Honor%3A+Rebirth+-+RJ+Brousseau+%28GOT%2FFantasy%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40e3a7888a4cd350f2a9979b6e55380156d48ffc","infoHashBuffer":{"type":"Buffer","data":[64,227,167,136,138,76,211,80,242,169,151,155,110,85,56,1,86,212,143,252]},"announce":[],"urlList":[]}}