{"title":"Mitigating Environmental Impact of Petroleum Lubricants","uid":14894757,"size":4990370,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:436ad9fa18f507034c969bbabb228512694eb65a&amp;dn=Mitigating+Environmental+Impact+of+Petroleum+Lubricants&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1465775324,"description":"Mitigating Environmental Impact of Petroleum Lubricants - I. Madanhire, C. Mbohwa (Springer, 2016).pdf\r\n\r\nISBN 978-3-319-31357-3\r\n\r\nThis book explores effective environmental impact mitigation for petroleum-based lubricants to reduce their negative persistence during usage and upon end-of-life disposal. The book reviews the basic tribology of lubricants as well as initiatives that may enhance the environmental and economic effectiveness of lubricating oils from the composition design perspective across industries. Considering the blending, application, and disposal of petroleum lubricants in a holistic manner, the book presents and extends current best practices that minimize or eliminate adverse environmental impact throughout the product’s life cycle. The book reviews methods including: raw material substitution, minimizing oil losses during and after manufacturing, raw material and energy consumption reduction, and environmentally friendly applications of oil disposal as ways forward for cleaner and more effective production.\r\n\r\nThis book provides readers with strategies for incorporating cleaner production practices into their operations – a benefit to both environmental legal compliance and business competitiveness – all the while preserving the environment for sustainable development. The book is therefore of interest to both manufacturers and consumers in the lubricants industry","torrent":{"xt":"urn:btih:436ad9fa18f507034c969bbabb228512694eb65a","amp;dn":"Mitigating+Environmental+Impact+of+Petroleum+Lubricants","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"436ad9fa18f507034c969bbabb228512694eb65a","infoHashBuffer":{"type":"Buffer","data":[67,106,217,250,24,245,7,3,76,150,155,186,187,34,133,18,105,78,182,90]},"announce":[],"urlList":[]}}