{"title":"Fursonas (2016) Documentary HD 1080p x264 MKV","uid":14654496,"size":5795635565,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a853934729a102c03ab07cf431c696917792059&amp;dn=Fursonas+%282016%29+Documentary+HD+1080p+x264+MKV+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"airwrecka","files":1,"time":1463686595,"description":"Like any community, the Furry world is one with gossipers, dreamers, followers, whistleblowers and the one guy who wants to rule them all. \r\n\r\nApproaching a community filled with so many rumors and misconceptions is no easy task. First time director Dominic Rodriguez is not without his own biases but instead of attempting to deny this fact, he faces it head on, unafraid to be shot down by his subjects. Fursonas is a whistleblower film that oscillates between the fantastic and the unusual, with moments of awe and wonder slapped against harsh reality. Whether or not you've heard of furry fandom, this documentary is a ride from start to finish. From the innocent to the tainted, the audience can delight in infiltrating the fun and sometimes dark secrets of an escapist community. Like a small town in middle America, you'll find friends in the most unusual places and unexpected enemies around every corner. Unlike a small town in middle America, you'll find Furries.\r\n\r\n\r\n\r\nIf you enjoyed this, please seed! I am, however, on a decently fast internet connection (10mbps up or over 1MB/s) and can seed this pretty quickly as well. Please enjoy! This was recorded in-house by ripping it from an HD rental in Google Play Movies. It's of excellent, untouched quality, albeit it is somewhat large","torrent":{"xt":"urn:btih:4a853934729a102c03ab07cf431c696917792059","amp;dn":"Fursonas+%282016%29+Documentary+HD+1080p+x264+MKV+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a853934729a102c03ab07cf431c696917792059","infoHashBuffer":{"type":"Buffer","data":[74,133,57,52,114,154,16,44,3,171,7,207,67,28,105,105,23,121,32,89]},"announce":[],"urlList":[]}}