{"title":"Celestian Tales Old North Howl of the Ravager-HI2U","uid":14856589,"size":1076667050,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4b52fb4b6a4e04b6a72f8cf292e54593f12f7b19&amp;dn=Celestian+Tales+Old+North+Howl+of+the+Ravager-HI2U&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":5,"time":1465484873,"description":"bmx! 20\r\n15 [HI2U]\r\n\r\nCelestian Tales: Old North - Howl of the Ravager (c)\r\n\r\nEkuator Games\r\n\r\nRelease 09/06/2016\r\n\r\nProtection: Steam\r\nGame Size: 1 DISC\r\nGame Type: RPG, Indie [RELEASE NOTES]\r\nHowl of the Ravager stands as a powerful story on its own and a precursor\r\nto the main trilogy, shedding light to events which took place more than\r\ntwenty years before Celestian Tales: Old North. Glimpse upon the life of\r\nyoung Severin Leroux and witness his first steps to become a hero of the\r\nrealm\r\nWhile bringing back the much-loved painted environments, emotive character\r\nportraits, meaningful combat encounters, and heavy storyline of Celestian\r\nTales: Old North, Howl of the Ravager also improves upon many of the core\r\ngame's features. Due to popular demand, it brings increased movement\r\nspeed, event-skipping function, as well as difficulty settings, among\r\nother things\r\nMain Game:\r\n\r\nCelestian Tales: Old North is a refreshing take on the classic turn-based\r\nJapanese style RPG, where your decisions in its dark and gritty storyline\r\nshape the world of tomorrow. When the future comes at last, is it what you\r\nhoped for?\r\nThe First of the Celestian Tales 3 Part Series, Old North is full of lush\r\nhand-painted environments, emotive portraits, memorable characters and a\r\nsprawling engaging moralistic storyline that is told through the eyes of\r\nsix protagonists. The actions you perform and the decisions you make in\r\nCelestian Tales: Old North will carry over to the next installment of the\r\nseries\r\nExperience what it's truly like to bear the responsibilities of a hero in\r\nthe beautifully hand-drawn Old North. Take on the role of one among six\r\nyoung nobles, learning your way of knighthood and assisting the lords you\r\nserve. When an external force threatens the land, you find yourself swept\r\nin the tides of war where the deadliest enemies are those among your own\r\nranks\r\nCelestian Tales: Old North is a complex tale of human interactions where\r\ndeception, intrigue, and betrayal stand side-by-side with loyalty\r\nfriendship, and personal growth. Scrapping away the clich of a destined\r\nperson or a boy/girl-saving-the-world, the story is tailored for a mature\r\naudience and questions the bare morals of a human being. Will you do\r\nanything to survive? Will you be steadfast in defending your faith and\r\nbeliefs? Or will you let yourself be corrupted, little by little, in the\r\nname of greater good?\r\nFeaturing a turn-based combat system with plenty of character and party\r\ncustomization options, Celestian Tales allows you to play the game at your\r\nown pace in your own style. Enter the first decade of this epic three-game\r\nseries and see for yourself what sets it apart\r\nFeatures:\r\n\r\nMoral Confrontations - Situations are presented to the player throughout\r\nthe game that force players to face moral questions and beliefs\r\nUnique Story By avoiding genre cliches, the story brings a fresh\r\napproach to RPG storytelling by allowing players feel the weight of their\r\ncharacter s actions\r\nMultiple Story Arcs - 6 Selectable Characters allow you to play the game\r\nfrom 6 different perspectives. Play through the game as all 6 characters\r\nfor a full experience\r\nTraditional RPG Gameplay - Inspired by classic JRPGs with a turn-based\r\nRPG battle system, players can develop a personal combat style\r\nBeautiful Art - Lush hand-painted background visuals and environments\r\nwith detailed emotive character portraits and animated pixel-art\r\ncharacters create a full and complete world experience\r\nEpic Music - A sweeping score that captures the pace and emotion of the\r\nstory as it unfolds\r\nMore to Come - Old North is the First episode of a planned trilogy of\r\ngames and your actions in this game will have impact in the next episode\r\nof the series [INSTALL NOTES] 1 Unpack 2 Mount / burn image 3 Install 4 Copy content from 'Crack' folder and replace game dir files 5 Play game 6 If U like it, buy it!\r\n\r\n2015\r\nbmx![BAFH]\r\n\r\n__________________________.-..__.-...-..___.-..________________________///\r\n|: MisterX &amp; MisterY: / // | ||/| ||: Site Scripts V2.0:|\r\n`--_______________/---------___//--|_||//|_||---------_________________/'","torrent":{"xt":"urn:btih:4b52fb4b6a4e04b6a72f8cf292e54593f12f7b19","amp;dn":"Celestian+Tales+Old+North+Howl+of+the+Ravager-HI2U","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b52fb4b6a4e04b6a72f8cf292e54593f12f7b19","infoHashBuffer":{"type":"Buffer","data":[75,82,251,75,106,78,4,182,167,47,140,242,146,229,69,147,241,47,123,25]},"announce":[],"urlList":[]}}