{"title":"My Trip To Al-Qaeda 2010 480p 6ch 2ch x265","uid":15001710,"size":610135524,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4bf7b2268393354d4f52132671022b740a6b4848&amp;dn=My+Trip+To+Al-Qaeda+2010+480p+6ch+2ch+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bsg4you","files":3,"time":1466378558,"description":"My.Trip.To.Al-Qaeda.2010.480p.6ch.2ch.x265.mkv\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nMy Trip To Al-Qaeda (2010)\r\nvideo: 720x480 HEVC crf=21.00 preset=medium ~638Kbps 8-bit\r\naudio1: 5.1 surround English HE-AAC 224Kbps\r\naudio2: 2.0 stereo English HE-AAC 80Kbps\r\nsource: DVD\r\n1hour26min06sec 610,082,927bytes includes chapters\r\n  http://www.imdb.com/title/tt1608182/  \r\n\r\nIMDB: Chronicles fundamentalist Islam's rise to power and explores Wright's struggle to maintain his objectivity as a journalist writing about Islamic terror.\r\n\r\nHBO: In 2006, Pulitzer Prize-winning journalist Lawrence Wright staged &quot;My Trip to al-Qaeda,&quot; a one-man play that explored the moral dilemmas he encountered while researching his bestselling book &quot;The Looming Tower: al-Qaeda and the Road to 9/11.&quot;\r\n\r\nNow, Academy Award winner Alex Gibney (&quot;Taxi to the Dark Side&quot;) brings Wright's off-Broadway show to the screen, chronicling fundamentalist Islam's rise to power, as well as Wright's struggle to maintain objectivity as a journalist in the wake of 9/11,\r\n\r\nA firsthand account of Wright's experience researching his 2006 book &quot;The Looming Tower: al-Qaeda and the Road to 9/11,&quot; MY TRIP TO AL-QAEDA sheds important light on al-Qaeda, Islamic radicalism, hostility to America and the U.S. military presence in Afghanistan, Iraq and the Middle East overall.\r\n\r\nThe riveting travelogue/performance piece combines Wright's first-person narrative with documentary footage and photographs, while raising important questions about the war on terrorism, and questioning the U.S. stance as a role model as it engages in a war that erodes the country's reputation and resources.\r\n\r\nAmazon review: Wright is a journalist who has spent much time working in the Middle East, co-wrote the screenplay to &quot;The Siege&quot; (a 1998 film about terrorism on American soil), penned the bestseller &quot;The Looming Tower: Al-Qaeda and the Road to 9/11&quot; and staged a one-man multimedia theater event that is the basis for this movie. In fact, much of the presentation focuses on Wright as he performs (or you might say narrates) before a live audience. Sounds simple and scaled back, and it is. But it is also thoroughly compelling and thought provoking. The movie also uses archival news footage, outside interviews, and portions of Wright on location. The many elements are blended seamlessly. And for a film that runs just 86 minutes, it presents a lot of information in a concise and logical way. To really understand the motivations behind 9/11 and its participants, it's important to put things into context from a cultural standpoint. And Wright assembles the pieces like a technician.\r\n\r\nPlease check out other documentaries, Rifftrax, MST3K, Battlestar Galactica, Star Trek, Gotham, DC Comics, and more at:\r\n  https://thepiratebay.org/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:4bf7b2268393354d4f52132671022b740a6b4848","amp;dn":"My+Trip+To+Al-Qaeda+2010+480p+6ch+2ch+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf7b2268393354d4f52132671022b740a6b4848","infoHashBuffer":{"type":"Buffer","data":[75,247,178,38,131,147,53,77,79,82,19,38,113,2,43,116,10,107,72,72]},"announce":[],"urlList":[]}}