{"title":"Susan Freed's Mural Making Training, Interior Designer Training","uid":14745227,"size":121138749,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4f79d17dbdb85769845df13f871dd3714b683d5e&amp;dn=Susan+Freed%27s+Mural+Making+Training%2C+Interior+Designer+Training+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1464717090,"description":"Susan Freed's Mural Making Training,Interior Designer Training Services In Atlanta, Georgia\r\n\r\nilovesusanfreed.me \r\n\r\n\r\nMy team and I are engaged in offering Training Services to the candidates who want to learn different arts related to ceramics. Our range of training comprise of Mural Making Training, Interior Designer Training, Ceramic Design Training, etc. \r\n\r\nWe have employed a team of highly qualified and seasoned artists who have been in the field for long time to impart knowledge based training. The emphasis is laid on both the theatrical and practical aspect of ceramic designing. \r\n\r\nThus, when it comes to offer the best Training Services in Atlanta, Georgia, we are counted at the top.   Pottery organizes regular workshops all the year round for children in Earthenware ceramics, Stoneware ceramics, Slab Pottery, Paper Clay, Coil work, Mask making, Pinching , Mural Making and Tile Making . \r\n\r\nChildren are given special attention by our experienced teachers who help children express their creativity. Our teachers always stress on the fact that children should not be encouraged to duplicate from something, here at  children are allowed to express their creativity. \r\n\r\nPottery is especially helpful for children as it helps them to positively channel their energy, and assists hyperactive children to be calmer and more disciplined.  Stoneware ceramics is a type of ceramic product that is hard and impermeable and is fired at a very high temperature of about 1300 degree Celsius. Because of its inherent quality these products can be used for daily needs like cooking and serving, and can also be used for decorative purposes.\r\n\r\nAll products are dishwasher and microwave safe.  Earthenware ceramics is another form of ceramics where the product produced by this type of clay is fired at 900°C to 1050°C which is less than stoneware firing. Due to the properties of the clay used to make earthenware it is usually not impervious to liquids and is best suited for decorative purposes.\r\n\r\nSlab Pottery is a process of making pottery without using the potter’s wheel. Here slabs are rolled out from clay and interesting pieces of art can be created since the scope of creating with hands is much wider than when the wheel is used.\r\n\r\nUsually a mural represents an art work that is created on a wall or ceiling or any other surface that is permanent.  pottery creates ceramic murals that can adorn the interiors of any structure.  Paper clay is a relatively new concept in Atlanta, Georgia where paper is added to clay to make ceramic products. The firing temperatures of paper clay can be low or high depending upon the clay used, and on drying they are usually harder than when only clay has been used. \r\n\r\nHowever they are porous and hence can only be used for decorative purposes. The addition of paper to clay makes it strong and consequently more delicate pieces can be attempted.  Customized Training is arranged regularly for companies and is customized keeping in mind their special needs and necessities. \r\n\r\nWorkshops are regularly conducted for employees of companies from varied industries, and since it is a known fact that pottery is therapeutic in relieving stress, these Workshops are especially beneficial for them. Another industry susceptible to stress both mental and physical is the IT industry, as it involves working on the computer extensively and it brings with it common nerve related ailments in employees. \r\n\r\nSince pottery involves the systematic movement of fingers they get well exercised and toned which helps employees avoid those problems. Training can be arranged at the office premises or even in our facility which is situated amidst naturally beautiful surroundings near Lake Lanier, Georgia. The workshop duration can range from anything between 2 to 8 days depending on the requirement of the company.\r\n\r\nSchool Training Programs are regularly conducted and interested schools are invited to approach us so that a fully customized course can be designed for the school children to induct pottery as a course in the curriculum.\r\n\r\nClay has healing properties that have been proven to be therapeutic for mentally challenged children. At  Pottery we arrange workshops and courses at NGOs dealing with mentally challenged children. Pottery helps these children to think, to create, and to apply; this helps them improve their mind and action coordination, which in turn helps to develop their motor skills.\r\n\r\nPlease check out my website at ilovesusanfreed dot me","torrent":{"xt":"urn:btih:4f79d17dbdb85769845df13f871dd3714b683d5e","amp;dn":"Susan+Freed%27s+Mural+Making+Training%2C+Interior+Designer+Training+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f79d17dbdb85769845df13f871dd3714b683d5e","infoHashBuffer":{"type":"Buffer","data":[79,121,209,125,189,184,87,105,132,93,241,63,135,29,211,113,75,104,61,94]},"announce":[],"urlList":[]}}