{"title":"The Effect of Creep and other Time Related Factors on Plastics a","uid":15533232,"size":28354174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ff24a1008b88594c3b6819e8ff73dff44f9bbd2&amp;dn=The+Effect+of+Creep+and+other+Time+Related+Factors+on+Plastics+a&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470855046,"description":"The Effect of Creep and other Time Related Factors on Plastics and Elastomers 2nd ed - Laurence W. McKeen (WA, 2009).pdf\r\n\r\nThe second edition of the classic data book, The Effect of Creep and Other Time Related Factors on Plastics and Elastomers (originally published in 1991), has been extensively revised with the addition of an abundance of new data, the removal of all out-dated information, and the complete rebuilding of the product and company listings.\r\n\r\nThis new edition also has been reorganized from a polymer chemistry point of view. Plastics of similar polymer types are grouped into chapters, each with an introduction that briefly explains the chemistry of the polymers used in the plastics. An extensive introductory chapter has also been added, which summarizes the chemistry of making polymers, the formulation of plastics, creep-testing, test methods, measurements, and charts, as well as theory and plastic selection.\r\n\r\nEach chapter is generally organized by product and concludes with comparisons of brand or generic products. The appendices include a list of trade names, plastics sold under those names, and manufacturer. A list of conversion factors for stress measures is also included","torrent":{"xt":"urn:btih:4ff24a1008b88594c3b6819e8ff73dff44f9bbd2","amp;dn":"The+Effect+of+Creep+and+other+Time+Related+Factors+on+Plastics+a","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff24a1008b88594c3b6819e8ff73dff44f9bbd2","infoHashBuffer":{"type":"Buffer","data":[79,242,74,16,8,184,133,148,195,182,129,158,143,247,61,255,68,249,187,210]},"announce":[],"urlList":[]}}