{"title":"‫Directory Opus Pro_ 11.19 Build 6005","uid":15018058,"size":94954315,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:51ddc1db86040e383d635f5f320bc7baa10f1621&amp;dn=%E2%80%ABDirectory+Opus+Pro_+11.19+Build+6005&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fzSoft","files":6,"time":1466458920,"description":"About this release\r\n\r\nRelease date: 10/06/2016\r\nOS: Windows XP/7/8/8.1/10 (x86/x64)\r\nInstall: run setup, launch and select Pro Version (later run Trial Reset when needed)\r\nPortable: file associations and context menus disabled, unzip and run Directory Opus (32-bit), it also runs on 64-bit systems\r\n\r\nChanges in version 11.19\r\n\r\n- Fixed inverted colors in some CMYK JPGs.\r\n- Fixed button editor duplicating the next line if you double-clicked the end of a line, and then crashing if you clicked OK.\r\n- Duplicating a folder over an existing one would incorrectly display an error (&quot;you can't copy a file over itself&quot;) for any files that clashed with existing ones in the target folder.\r\n- The Image command no longer requires CONVERT if either the WIDTH or HEIGHT arguments are specified (previously it needed both for CONVERT to not be needed).\r\n- Updated to 7z.dll v16 which includes security fixes.\r\n- Updated to latest UnRar.dll.\r\n- Fixed sorting error with Tags column.\r\n- Fixed ftp not logging into the Folder+ iOS FTP server app.\r\n- Lossless JPEG rotation was broken and always failed (falling back on lossy rotation if the command's arguments allowed it).\r\n\r\nAbout Directory Opus\r\n\r\nDirectory Opus provides a complete Explorer Replacement with far more power and functionality than any other file manager available today.\r\n\r\nJust some of the features include\r\n\r\n- Single or dual pane file display and trees\r\n- Folder tabs let you keep multiple folders open and switch quickly between them\r\n- Unique Explorer Replacement mode provides a full replacement for Windows Explorer\r\n- Quickly filter, sort, group and search your folders\r\n- Support for FTP and archive formats like Zip, 7Zip and RAR\r\n- Viewer pane lets you preview images, documents and more\r\n- Batch renaming, view and edit file metadata\r\n- Access content on portable devices like phones, tablets and cameras, and burn your files to CD or DVD\r\n- Built-in tools including synchronize and duplicate file finder\r\n- Calculate folder sizes and print or export folder listings\r\n- Queue multiple file copies for improved performance\r\n- Color-code your files and folders or assign star ratings\r\n- Fully configurable user interface - toolbars, keyboard hotkeys, and a full scripting interface let you tailor Opus exactly to suit your needs\r\n- Efficient, multi-threaded, modern design. Available in both 32 and 64 bit versions\r\n\r\nEase of use\r\nAs far as possible, Opus works just like Explorer does. You don't have to learn any complicated scripting or non-standard mouse techniques to use Opus. If you've ever used Explorer to copy a file, you already know exactly how to do it in Opus as well.\r\n\r\nConfigurability\r\nWe believe in the user's right to choose how their computer operates. You'll find that almost every aspect of Opus can be changed - from the buttons on the toolbar to the color used to draw the background of a compressed file.\r\n\r\nEfficiency\r\nOpus is designed to be as efficient as possible. The entire program makes use of multi-threading to ensure that you should never have to wait for one operation to complete before beginning another.\r\n\r\nCompatibility\r\nAs an Explorer Replacement it's important that Opus appears (to the system) just like Explorer does. Within the limits set by Microsoft, Opus achieves this and most software written with only Explorer in mind will still work fine with Opus installed","torrent":{"xt":"urn:btih:51ddc1db86040e383d635f5f320bc7baa10f1621","amp;dn":"%E2%80%ABDirectory+Opus+Pro_+11.19+Build+6005","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51ddc1db86040e383d635f5f320bc7baa10f1621","infoHashBuffer":{"type":"Buffer","data":[81,221,193,219,134,4,14,56,61,99,95,95,50,11,199,186,161,15,22,33]},"announce":[],"urlList":[]}}