{"title":"Isis 24 Bit Vinyl Pack Vol 2","uid":15415064,"size":11382474619,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5544d5dac09f95fb3db6528dec144e227a62300a&amp;dn=Isis+24+Bit+Vinyl+Pack+Vol+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"politux","files":114,"time":1469582821,"description":"Isis 24 Bit Vinyl Pack Vol 2\r\n\r\n  Genre: Rock\r\n  Styles: Metal, Sludge, Post-Rock\r\n  Source: vinyl\r\n  Codec: FLAC\r\n  Bit Rate: ~ 2,900 kbps\r\n  Bit Depth: 24\r\n  Sample Rate: 96 kHz\r\n\r\n  Celestial (Escape Artist Records EA 7.1)\r\n  In the Absence of Truth (Robotic Empire robo 071)\r\n  In the Absence of Truth (Daymare Recordings DYMV-009 Japan Clear)\r\n  In the Absence of Truth (Robotic Empire robo 071 OP White)\r\n  Oceanic (Escape Artist Records EA 19.0 White)\r\n  Oceanic (Robotic Empire US ROBO 096 2LP Black Reissue)\r\n  Panopticon (Ipecac Recordings IPC-57)\r\n  Wavering Radiant (Ipecac Recordings IPC-113)\r\n  Wavering Radiant (Conspiracy Records)\r\n  Melvins - ISIS Split (Hydra Head Records HH666-214)\r\n\r\n  lthough rooted heavy metal and the punk/hardcore aesthetic, Isis' music relies just as heavily on ambience, atmosphere, and tone as it does complexity and aggression. Not so much a band per se as a musical collective, the members of the Boston-based quintet layer their compositions with feedback, power chords, quiet/loud dynamics, and vocals that are sometimes shouted, frequently screamed, and occasionally sung. The band was formed by Hydra Head Records owner Aaron Turner, who was hoping to combine the minimalism of Earth and the Melvins with the experimentalism of Godflesh, backed by the depth and power of the band's most obvious musical counterpart, Neurosis. It was the union of Turner with bassist Jeff Caxide and powerhouse drummer Aaron Harris that formed the core of the Isis project in 1997. The band recorded a demo that year with guitarist Randy Larson, garnering the attention of Escape Artist Records.\r\n\r\n  With noisemaker Chris Mereshuk on keyboards/samples and minus Larson, the band recorded the The Mosquito Control EP at God City Studios in 1998, establishing Isis as a band with artistic vision and conceptual foresight. Former Cast Iron Hike guitarist Mike Gallagher joined the lineup in time for a tour with Converge and Cavity, just as Mereshuk exited and was replaced by Agorophobic Nosebleed's Jay Randall. In 1999, Isis released an EP titled The Red Sea through Second Nature on both 8&quot; vinyl and CD. Randall exited the group shortly thereafter and was replaced by Cliff Meyer, and Isis subsequently toured with Cave In that summer before supporting Neurosis -- who had become admirers of the group -- that winter.\r\n\r\n  In 2000, Isis produced their masterwork, the Celestial opus, which built upon the promise of the EP releases while expanding the band's scope to include more warmth and melody than its decidedly brutal predecessors. The band toured relentlessly in its support with the likes of the Dillinger Escape Plan, Candiria, and Burn It Down, releasing a follow-up of material from the Celestial sessions through Neurosis' own Neurot Recordings in 2001. Dubbed SGNL&gt;05, the EP expanded the conceptual and musical threads of Celestial, complete with a remix by one of the band's heroes, Godflesh's electronic wizard Justin Broadrick.\r\n\r\n  Oceanic became the band's breakthrough record, receiving positive reviews upon its release in 2002. The follow-up effort, Panopticon, appeared two years later, while the two-CD remix collection Oceanic: Remixes/Reinterpretations landed in 2005. One year later, the band collaborated with the Scottish pop band Aereogramme for the 14th volume of the Konkurrent label's In the Fishtank series. Isis then released their next full-length album, In the Absence of Truth, before touring alongside Tool, whose guitarist Adam Jones opted to join Isis in the studio upon the tour's completion. Jones lent his instrumental prowess to two songs, both of which appeared on the band's 2009 album Wavering Radiant.\r\n\r\n  In 2010, Isis announced their decision to break up, and later that year they played their last show in Montreal. Though the band was done, a split EP with the Melvins featuring unrleased tracks from the Wavering Radiant sessions would appear later that year. Isis' final release, the sprawling rarites and demos compilation Temporal, appeared late in 2012","torrent":{"xt":"urn:btih:5544d5dac09f95fb3db6528dec144e227a62300a","amp;dn":"Isis+24+Bit+Vinyl+Pack+Vol+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5544d5dac09f95fb3db6528dec144e227a62300a","infoHashBuffer":{"type":"Buffer","data":[85,68,213,218,192,159,149,251,61,182,82,141,236,20,78,34,122,98,48,10]},"announce":[],"urlList":[]}}