{"title":"Kapoor &amp; Sons (2016) - BD.rip - 720p - HEVC - x265.AC3.DDR","uid":14999829,"size":2682597346,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:55a2874794fa5fe30eb252ca91f293d07ed8cf37&amp;dn=Kapoor+%26amp%3B+Sons+%282016%29+-+BD.rip+-+720p+-+HEVC+-+x265.AC3.DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":2,"time":1466369870,"description":"\nPresenting a DDR Anniversary Exclusive\r\n\r\n\r\nKapoor &amp; Sons (2016)\r\n(A film by Shakun Batra)\r\n\r\nHindi - BD Rip - 720p - 1280x544 (2.35:1)- 2.5 GB - x.265.AC3-Esubs - 2 Hrs:17 Min\r\n\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/ar2F \nhttp://extraimago.com/image/ar2D \nhttp://extraimago.com/image/ar25 \nhttp://extraimago.com/image/ar2g \nhttp://extraimago.com/image/ar2X \nhttp://extraimago.com/image/ar2P \nhttp://extraimago.com/image/ar2G \nhttp://extraimago.com/image/ar2r \nhttp://extraimago.com/image/ar2p \nhttp://extraimago.com/image/ar2Y\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/arNd\r\n\r\nSynopsis:\r\nThe Kapoors are a dysfunctional family. The ailing old patriairch Amarjeet (Rishi Kapoor) wants to hold the family together for one last family picture. His son Harsh (Rajat Kapoor) has a failing business and is also two-timing his wife Sunita (Ratna Pathak) who wants to start her own catering business. The two grandsons Rahul (Fawad Khan) and Arjun (Siddarth Malhotra) are both aspiring writers but Rahul is successful and Ajun is struggling. The two siblings struggle to get along and their rivalry stretches to a common girlfriend Tia Malik (Alia Bhat).\r\n\r\nThe family meet because Amarjeet has a heart attack and the differences get accentuated. How the family gets its act together for on last photograph of Kapoor &amp; Sons, papering over their differences, is the story of this film...\r\n\r\nComments:\r\nFor a change, this is a family drama which is not soppy and does not really depend on miracles and external influences to live happily ever after. In fact, we don't even know if they will live happily ever after, for we see only a story in which family feelings help overcome very large differences and hold the clan together. Its the same story, but treated differently and therefore refreshing.\r\n\r\ncredit must fo to Director Shakun Batra and producer Karan Johar for making a somewhat off-beat film from a common theme. Credit also to Rishi Kapoor for lighting up the screen every time he is around. Rajat Kapoor and Ratna Pathak are old warhorses and don't let you down. Among the younger lot, Fawad Khan as Rahul shines. Alia Bhat only has to look pretty and Siddarth Malhotra's Arjun is a little subdued.\r\n\r\nWatch the film for some superb outdoor cameramanship in an around Connoor. You start believing that it is really God's Own Country! Technically the rest of the film is competent as most Hindi films are.\r\n\r\nAll said, a slightly different film that you would enjoy..\r\n\r\nUploader's Notes:\r\nIn comparison to the DVD, the Blu Ray was of astonishingly good quality. We only needed to enhance details a bit and do some edge-sharpening. The colors are fine - a little biased towards yellow but nothing displeasing. The picture quality is good and this rip just enhances the Blu-Ray images a bit.\r\n\r\nThis is a 10-bit HEVC encoding in x265. The over two hour length meant that, without compromising on quality, we could compress the film into just 2.5 GB. Since there wasn't much to the music, we are bringing you the original AC3 version. The TrueHD 7.1 audio file itself was 3.9 GB and it seemed a waste of good bytes to upload it.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on most stand-alone devices. You can only watch this on a computer or a compatible device. On your computer be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nEnjoy!\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4900716/","torrent":{"xt":"urn:btih:55a2874794fa5fe30eb252ca91f293d07ed8cf37","amp;dn":"Kapoor+%26amp%3B+Sons+%282016%29+-+BD.rip+-+720p+-+HEVC+-+x265.AC3.DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a2874794fa5fe30eb252ca91f293d07ed8cf37","infoHashBuffer":{"type":"Buffer","data":[85,162,135,71,148,250,95,227,14,178,82,202,145,242,147,208,126,216,207,55]},"announce":[],"urlList":[]}}