{"title":"Koihime Enbu","uid":14660542,"size":4209894732,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:563261c5b241f55b988f359c1cb40876e74caf91&amp;dn=Koihime+Enbu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1463745843,"description":"\nAbout This Game\r\nBased on the Koihime Musou visual novel, Koihime Enbu features a reimagining of the Romance of Three Kingdoms where the majority of characters are girls. Originally an arcade fighting game, Koihime Enbu draws upon this pedigree to offer players accessible and exciting mechanics that will draw in beginner and veteran players alike.\r\n\r\n\r\n\r\nKoihime Enbu is an ground based fighting game. Anyone can enjoy it from a beginner to a skilled fighting game veteran. Fighting game veterans will relish the tight controls and fast combat, providing the possibility for huge combos and devastating counters. Explore the Fatal Counter system that creates additional combo opportunities. With almost every attack being punishable, Koihime Enbu strives to provide a cleaner and more precise fighting experience.\r\nFeatures:\r\n\r\n    Play as 13 different characters and 7 &quot;assist&quot; characters to create a huge variety of strategies!\r\n    Explore the Fatal Counter system which gives moves different properties that make comboing easier, and longer!\r\n    Utilise the Tactics Meter with special moves, ex special moves, super moves, and ultimate moves!\r\n    Save your best bouts for later, or learn from your previous battles with Replay Mode!\r\n    Ascend the online rankings by battling in ranked matchmaking, keep it closer to home and play with your friends in local versus mode!\r\n    Steam Achievement, Cloud, Trading Cards","torrent":{"xt":"urn:btih:563261c5b241f55b988f359c1cb40876e74caf91","amp;dn":"Koihime+Enbu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"563261c5b241f55b988f359c1cb40876e74caf91","infoHashBuffer":{"type":"Buffer","data":[86,50,97,197,178,65,245,91,152,143,53,156,28,180,8,118,231,76,175,145]},"announce":[],"urlList":[]}}