{"title":"Human Brain Proteome - Lisa A. Neuhold","uid":15514586,"size":8932247,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5860e4680990b4cde8598ad49d110901075f58bb&amp;dn=Human+Brain+Proteome+-+Lisa+A.+Neuhold&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470695825,"description":"Human Brain Proteome - Lisa A. Neuhold (AP, 2004).pdf\r\n\r\nProteomics is a systematic approach for studying the identity and function of all proteins expressed in a cell, tissue or organ. New drug targets for diseases are often identified by comparing the proteome of the disease state to the normal state. As a result, proteomics has become increasingly important in the pharmaceutical and biotechnology industries as well as academics. This book contains five sections encompassing the research aspects of proteomics on the brain including the most recent advances in the technology and informatics. It discusses advances in high-throughput proteomic technologies and their application to studying neurological disorders such as Alzheimer’s disease, alcoholism, trauma/stroke, Huntington's disease, and Parkinson's disease. With numerous illustrations to explain the concepts, it provides a comprehensive review on the topic.\r\n\r\n* Describes the latest databases and techniques for analyzing the data generated by proteomics\r\n* Outlines the latest developments in proteomic methods\r\n* Provides numerous color illustrations highlighting the application of proteomics to the identification of novel drug targets and biomarkers","torrent":{"xt":"urn:btih:5860e4680990b4cde8598ad49d110901075f58bb","amp;dn":"Human+Brain+Proteome+-+Lisa+A.+Neuhold","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5860e4680990b4cde8598ad49d110901075f58bb","infoHashBuffer":{"type":"Buffer","data":[88,96,228,104,9,144,180,205,232,89,138,212,157,17,9,1,7,95,88,187]},"announce":[],"urlList":[]}}