{"title":"NubileFilms - Jillian Janson, Kinsley Eden (Dirty Blondes) NEW 2","uid":15419306,"size":368532746,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:58d1c20d0e42dc68aa87bbe775f7cbd8be1681a8&amp;dn=NubileFilms+-+Jillian+Janson%2C+Kinsley+Eden+%28Dirty+Blondes%29+NEW+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1469619224,"description":"Kinsley Eden is enjoying a good book in bed when Jillian Janson and Chad White come upstairs to join her. They're already hot and horny as Chad's hands freely roam Jillian's body, leaving no question what they're after. Taking Kinsley's book, Jillian lets her girlfriend know with a deep kiss that it's time for other pursuits. Chad second Jillian's opinion, leaning forward to caress Kinsley's thong-clad ass.As soon as Jillian is certain that Kinsley is in the mood, she and Chad turn her around so that Jillian can pull Kinsley's sheer thong aside and bury her face in her lover's landing strip snatch. Chad is busy, too, pulling Kinsley's shirt down to play with her medium boobs and rock hard nipples. When he slips a hand down to fondle Kinsley's clit while Jillian delivers a pussy fingering, things quickly heat up in the bedroom!Knowing that she can't have all the fun, Kinsley helps Jillian out of her dress and bra. The two girls lay down side by side on the bed so that Chad can peel off Jillian's thong and then sample each of their creamy fuck holes with his soft tongue. When he reaches out to put both hands to work rubbing and fucking their snatches, while continuing to sneak tastes with his tongue, the girls cannot contain their mutual moans of approval...\r\nCategories:Medium Boobs Shaved Pussy Landing Strip Pussy Tall Girls Blonde Long hair Panties Hardcore Lesbian High Heels Feet Girl-Girl-Boy Deep Throat Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=63966236197860273633.jpg\r\n \nhttp://imgdone.com/viewer.php?file=18481733011593338816.jpg","torrent":{"xt":"urn:btih:58d1c20d0e42dc68aa87bbe775f7cbd8be1681a8","amp;dn":"NubileFilms+-+Jillian+Janson%2C+Kinsley+Eden+%28Dirty+Blondes%29+NEW+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58d1c20d0e42dc68aa87bbe775f7cbd8be1681a8","infoHashBuffer":{"type":"Buffer","data":[88,209,194,13,14,66,220,104,170,135,187,231,117,247,203,216,190,22,129,168]},"announce":[],"urlList":[]}}