{"title":"Liane Moriarty - Big Little Lies [Audiobook]","uid":14853360,"size":10115293440,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5a1e35b62184060ba027c17367f724c6a3ebc015&amp;dn=Liane+Moriarty+-+Big+Little+Lies+%5BAudiobook%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"pmfsr","files":138,"time":1465448890,"description":"Big Little Lies follows three women, each at a crossroads:\r\n\r\nMadeline is a horse to be reckoned with. She’s funny and biting, passionate, she remembers everything and forgives no one. Her ex-husband and his yogi new wife have moved into her beloved beachside community, and their daughter is in the same kindergarten class as Madeline’s youngest (how is this possible?). And to top it all off, Madeline’s teenage daughter seems to be choosing Madeline’s ex-husband over her. (How. Is. This. Possible?).\r\n\r\nCeleste is the kind of beautiful woman who makes the world stop and stare. While she may seem a bit flustered at times, who wouldn’t be, with those rambunctious twin boys? Now that the boys are starting school, Celeste and her husband look set to become the king and queen of the school parent body. But royalty often comes at a price, and Celeste is grappling with how much more she is willing to pay.\r\n\r\nNew to town, single mom Jane is so young that another mother mistakes her for the nanny. Jane is sad beyond her years and harbors secret doubts about her son. But why? While Madeline and Celeste soon take Jane under their wing, none of them realizes how the arrival of Jane and her inscrutable little boy will affect them all.\r\n\r\nBig Little Lies is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive.\r\n\r\n-----------\r\n\r\nAudio files in AIFF format","torrent":{"xt":"urn:btih:5a1e35b62184060ba027c17367f724c6a3ebc015","amp;dn":"Liane+Moriarty+-+Big+Little+Lies+%5BAudiobook%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1e35b62184060ba027c17367f724c6a3ebc015","infoHashBuffer":{"type":"Buffer","data":[90,30,53,182,33,132,6,11,160,39,193,115,103,247,36,198,163,235,192,21]},"announce":[],"urlList":[]}}