{"title":"UNDER.NIGHT.IN-BIRTH.Exe.Late-SKIDROW","uid":15344117,"size":6147581600,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6332efc1ca3ea68c6fa8a6c83e4dd961c87cddbe&amp;dn=UNDER.NIGHT.IN-BIRTH.Exe.Late-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tenguken","files":2,"time":1468872424,"description":"S  K  I  D  R  O  W\r\n.the leading force.\r\n\r\nproudly presents\r\nUNDER NIGHT IN-BIRTH Exe:Late\r\n(c) Arc System Works\r\n\r\n................Release Date &lt;-&gt; Protection.................Steam\r\nFighting...........Game Type &lt;-&gt; Disk(s)....................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nThe story of the In-births unfold-\r\nSince time immemorial, the organization known as the  Night Blade  has\r\nacted as guardians in what is known as the  Hollow Night . While\r\nresting from her eternal labors in a non-descript town that the\r\nPrincess of the Night Blade, Linne, meets a young boy named Hyde, who\r\nis in possession of the fabled sword of destiny that she has been\r\nsearching far and wide for.\r\n\r\nIn the Hollow Night, monsters called Voids feed upon the power that\r\nmanifests there, while those known as In-births use that same power for\r\ntheir own ends. While investigating the reason behind the sudden\r\nincrease in the numbers of both Voids and In-births in the Hollow\r\nNight, Linne hears of an evil plot being hatched by someone calling\r\nthemselves  Paradox . This person turns out to be none other than\r\nHilda, the leader of a shadowy organization known as  Amnesia .\r\n\r\nVowing to stop  Paradox  before her nefarious plans come to fruition,\r\nLinne heads off into the Night. Unbeknownst to her, the young boy she\r\nencountered, Hyde, follows behind her with a desperate need to know\r\nwho, and what, she is.\r\nAnd thus, the story of the Hollow Night, and In-births, begins--\r\n\r\nThe tale of the &quot;In-births&quot; and the battle for the &quot;Abyss&quot;\r\nThose that dwell in the darkness of the night - the &quot;Voids&quot;. It is said\r\nthat humans who have their souls consumed by the Void shall be bestowed\r\nwith an artificial death, and after which they awaken as an &quot;In-birth&quot;.\r\nThe In-births awaken with a supernatural power known as &quot;EXS&quot;, which\r\nallows them to perform superhuman feats. The &quot;Hollow Night&quot;, which\r\nappears in the night of the full moon accompanied by the phenomenon of\r\nthe Crimson Fog. The &quot;Abyss&quot;, the fountain of EXS and the core of it.\r\nIn there, power-wielders gather. For glory, for ambition, for pride,\r\nfor their own motives, the In-births fight.\r\n\r\nFantasy Light-Novel type Stylish Action Fighting\r\nPick one of the many unique characters, and fight your way through the\r\ndangers of the &quot;Hollow Night&quot;, and claim your victory over those who\r\nobstruct your way. Experience the classic anime fighter controls, with\r\na splash of devastating combos and thrilling exchanges! A fight is more\r\nthan just pressing buttons!\r\n\r\nOnline Gameplay\r\nPlayers may head over to the &quot;NETWORK MODE&quot; and play against other\r\nplayers over the internet with &quot;RANK MATCH&quot; and &quot;PLAYER MATCH&quot;. There's\r\nalso a ranking leaderboard for players who wish to be in the hall of\r\nfame!\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy the cracked content from the SKIDROW folder and into the main\r\ninstall folder and overwrite\r\n5. Block the game in your firewall and mark our cracked content as\r\nsecure/trusted in your antivirus program\r\n6. Play the game\r\n7. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:6332efc1ca3ea68c6fa8a6c83e4dd961c87cddbe","amp;dn":"UNDER.NIGHT.IN-BIRTH.Exe.Late-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6332efc1ca3ea68c6fa8a6c83e4dd961c87cddbe","infoHashBuffer":{"type":"Buffer","data":[99,50,239,193,202,62,166,140,111,168,166,200,62,77,217,97,200,124,221,190]},"announce":[],"urlList":[]}}