{"title":"Lost Echo v1.9.9 full + data [apkpita]","uid":14669248,"size":304203293,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:63504685ab9d94f99b66329a61914bf964682919&amp;dn=Lost+Echo+v1.9.9+full+%2B+data+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1463851127,"description":"In the near future Greg's girlfriend Chloe mysteriously disappears in front of him.\r\nHe starts a desperate search for her. What happened? Why does no-one else remember her?\r\n\r\nIn this indie, story driven adventure game you explore fully 3d environments using an intuitive point and click interface.\r\nSolve puzzles, explore, play minigames, interact with numerous characters and find out what really happened!\r\n\r\nFEATURES\r\n* Detailed and realistic graphics, rarely found on mobile devices.\r\n* A soundtrack written specifically for the game. Drawing from multiple genres so it creates the proper atmosphere for each area.\r\n* An engrossing mystery with a satisfying conclusion. Meet and interact numerous characters, find clues and slowly reveal the truth. But is the truth really enough?\r\n* Point and click is one of those genres where touch devices just make sense. We made sure we took advantage of that.\r\n* Two modes, normal and old school, so you can play regardless of experience with the genre! And if you get stuck, you can always use the built-in hint system.\r\n\r\n\r\n&quot;A richly defined, innovative experience, Lost Echo is exactly what an iOS adventure should be, capturing the spirit of traditional adventure gaming with all the potential the platform has to offer.&quot; -AdventureGamers.com\r\n&quot;I can't help but be completely and utterly impressed.&quot; -IndieGames.com\r\n\r\n&quot;This is a must-buy for anybody who loves sci-fi, mystery, or just adventure games in general.&quot; -148apps\r\n\r\n&quot;A good looking game with a challenging mystery waiting to be solved: you won't be able to put it away!&quot; -Touch Tap Play\r\n\r\n\r\nWhat’s new:\r\n+Added Spanish localization!\r\n+Fixed minor gamepad lag.\r\n+Minor lighting improvements.\r\n+Minor adjustments to a couple of characters.\r\n+Minor animation adjustments.\r\n+Redid certain effects.\r\n+Bit of extra polish.\r\n+Greg gained the ability to run while holding an icecream! (wow!)\r\n+Fixed rare crash after the lab.\r\n+Chess riddle improvements.\r\n+A bunch of other minor fixes and improvements.\r\n+Fixed minor issue when importing profiles from Google saves.\r\n\r\nFrom the Greek Developers Nick Konstantoglou and Vagelis Antonopoulos \nhttp://www.kickback-studios.com/\r\n\r\nRequirements: Android OS 2.3.3 and up\r\nInstall APK. Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:63504685ab9d94f99b66329a61914bf964682919","amp;dn":"Lost+Echo+v1.9.9+full+%2B+data+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63504685ab9d94f99b66329a61914bf964682919","infoHashBuffer":{"type":"Buffer","data":[99,80,70,133,171,157,148,249,155,102,50,154,97,145,75,249,100,104,41,25]},"announce":[],"urlList":[]}}