{"title":"Dead Moon - Defiance, In the Graveyard FLAC","uid":14674245,"size":345482598,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:65baa9c376a91cced36343e361aa322ad8a74f09&amp;dn=Dead+Moon+-+Defiance%2C+In+the+Graveyard+FLAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"voxish","files":20,"time":1463917543,"description":"DEFIANCE \r\nThis is the album that's got Johnny's Got a Gun, Dagger Moon, Walking On My Grave, Dagger Moon, and another half-dozen classics beloved by Dead Moon enthusiasts. For the uninitiated, DEAD MOON come on almost like a hybrid of the most exciting elements of Love, AC/DC, the Weeds, and the Elevators. No joke. The group are also famous for operating extremely DIY, down to the recording and mastering of their albums (famously cut on the very same lathe that cut Louie Louie by the Kingsmen!)\r\n\r\nIN THE GRAVEYARD\r\nThe music is moody, aggressive, and genuine. It's great rock put out by an amazing solid three piece band. If you're still wondering whether or not to check out Dead Moon, keep in mind that Sub Pop put out a compilation CD years ago, meaning that Dead Moon fits in with the dirtier grungier side of Sub Pop. If you're a lover of pure rock and roll, you want Dead Moon. This album is the poster child of dirty blues rock albums. It includes awesome covers of &quot;Hey Joe&quot; and &quot;Parchment Farm.&quot; These guys know their rock and roll, and they know how to slap it up side the head, turn it sideways, and make it cry. Plus, my favorite Dead Moon song of all time &quot;I Hate the Blues&quot; appears on this album. You can't do any better than this album","torrent":{"xt":"urn:btih:65baa9c376a91cced36343e361aa322ad8a74f09","amp;dn":"Dead+Moon+-+Defiance%2C+In+the+Graveyard+FLAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65baa9c376a91cced36343e361aa322ad8a74f09","infoHashBuffer":{"type":"Buffer","data":[101,186,169,195,118,169,28,206,211,99,67,227,97,170,50,42,216,167,79,9]},"announce":[],"urlList":[]}}