{"title":"CRC Handbook of Enthalpy Data of Polymer-Solvent Systems","uid":14672478,"size":4013843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:695f4914bcc7650a9e89a1ca81c3c5f0d4731501&amp;dn=CRC+Handbook+of+Enthalpy+Data+of+Polymer-Solvent+Systems&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1463883500,"description":"CRC Handbook of Enthalpy Data of Polymer-Solvent Systems - Christian Wohlfarth (CRC, 2006).pdf\r\n\r\nISBN 978-0-8493-9361-7\r\n\r\nThe CRC Handbook of Enthalpy Data of Polymer-Solvent Systems presents data that is as essential to the production, process design, and use of polymers as it is to understanding the physical behavior and intermolecular interactions in polymer solutions and in developing thermodynamic polymer models.\r\n\r\nProviding an all-encompassing collection of current enthalpy data for all types of polymer solutions, this handbook is a ready companion with Christian Wohlfarth’s previously published handbooks of thermodynamic data for copolymer solutions, aqueous polymer solutions, and polymer solutions at elevated pressures, which contain only a small amount of enthalpic data in comparison to the data presented here. This volume contains 1770 data sets that include enthalpies of mixing and dilution for the entire concentration range as well as partial enthalpies of mixing and solution at infinite dilution. Special appendices allow scientists to access specific systems and data easily.\r\n\r\nThe CRC Handbook of Enthalpy Data of Polymer-Solvent Systems is a practical, one-stop resource that allows polymer chemists, biochemists, chemical engineers, materials scientists, and physical chemists involved in both industrial and laboratory processes to quickly retrieve relevant information as needed","torrent":{"xt":"urn:btih:695f4914bcc7650a9e89a1ca81c3c5f0d4731501","amp;dn":"CRC+Handbook+of+Enthalpy+Data+of+Polymer-Solvent+Systems","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"695f4914bcc7650a9e89a1ca81c3c5f0d4731501","infoHashBuffer":{"type":"Buffer","data":[105,95,73,20,188,199,101,10,158,137,161,202,129,195,197,240,212,115,21,1]},"announce":[],"urlList":[]}}