{"title":"John Batchelor Why is Hamilton $ 10.mp3","uid":14834742,"size":5248857,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7c6ea8e2990f85e87da200d25a3b51351baf149a&amp;dn=John+Batchelor+Why+is+Hamilton+%24+10.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1465347407,"description":"Why is Hamilton on the $10 Bill? Richard Brookhiser, WSJ. @rbrookhiser\r\n\r\n&quot;...Hamilton as Treasury secretary adopted two strategies for handling the debt. The first was for the new federal government, as reorganized under the Constitution he had helped ratify, to assume the debts of all the states, along with its own. The second was a policy of nondiscrimination: All holders of U.S. debt would be paid at a common rate.\r\n\r\n&quot;Both policies were controversial. States that had already paid their debts resented shouldering the burdens of deadbeats. Nondiscrimination seemed like a gift to speculators: Everyone agreed that soldiers who had been mustered out with IOUs should finally be rewarded for their service. But should sharpies who had bought IOUs at discounts, when it seemed as if they might never be redeemed, be rewarded too?\r\n\r\n&quot;Hamilton argued for mutual respect and realism. States like Massachusetts were not deadbeats but brothers who had spent heavily in a common struggle. Nondiscrimination was the price for entering the debt market: Borrowers who played favorites among their creditors would soon find no one willing to extend them credit.\r\n\r\n&quot;Promising to pay America’s debts was a big step, but it was only a beginning. Hamilton’s next move was to establish a central bank—the Bank of the United States. It would handle the federal government’s assets. But it would also be a private bank, selling stock to investors and making loans to ordinary customers. Hamilton saw it as a way of both increasing and regulating the money supply—a boon to a cash-poor economy. Hamilton’s Federalist collaborator, James Madison, thought the bank was illegal—the Constitution mentioned no such thing. Hamilton argued that a bank was necessary to fulfill a function the Constitution did mention—borrowing money on the credit of the United States—therefore it was an implied power. President Washington and Congress agreed....&quot;\r\n \nhttp://www.wsj.com/articles/first-aaron-burr-now-jack-lew-1434756149\r\nThe John Batchelor Show","torrent":{"xt":"urn:btih:7c6ea8e2990f85e87da200d25a3b51351baf149a","amp;dn":"John+Batchelor+Why+is+Hamilton+%24+10.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c6ea8e2990f85e87da200d25a3b51351baf149a","infoHashBuffer":{"type":"Buffer","data":[124,110,168,226,153,15,133,232,125,162,0,210,90,59,81,53,27,175,20,154]},"announce":[],"urlList":[]}}