{"title":"PrettyDirty - AJ Applegate, Cassidy Klein (Battle Of The Interns","uid":15168245,"size":469962994,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:80e24dd10af05ecab79bb7a529b151ff0c6ce675&amp;dn=PrettyDirty+-+AJ+Applegate%2C+Cassidy+Klein+%28Battle+Of+The+Interns&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1467367776,"description":"Mick Blue is a powerful Lawyer, with a dirty mind and a job to get done. He's sure that his two favorite Interns Cassidy Klein and AJ Applegate will go above and beyond to get the job he's offering them. Among the five summer interns only one can be chosen, and Mick has his eyes (and a few other things) focused on these two beautiful candidates. Without telling them exactly why they're at his house on such a beautiful day, he hints that he's willing to see how badly they want the job. Well, AJ takes the hint immediately and is eager to pounce on Mick to make her impression. Cassidy is instantly jealous and forces AJ out of the way to lay seductive kiss on Mick's waiting mouth. AJ, now left out in the cold decides that she'll get on her knees to prove she's the best. after a great deep throating session with AJ, Cassidy uses her seductive charm to lure him to the Bannister with her pussy wafting his way in the open air. He takes the bait, and soon he is having his way with both these gorgeous interns. He fucks Cassidy while AJ takes his cock in her throat, and AJ even eats out Cassidy's pussy when her throat isn't filled. He has them both suck his big cock at the same time. Before long, AJ needs her horny wet holes filled, so she climbs on for a ride. Mr. Blue directs the whole affair, making sure they all have their fill. Cassidy and AJ sure get theirs when he busts his nuts all over their faces and in their open mouths.\r\nCategories Blonde, Brunette, Piercings, Hardcore, Threesome, Natural Tits, Small Tits, Rim Job, Fingering, 69, Tattoos, Pussy Licking, Pussy to mouth, Blowjob, Deepthroat, Open Mouth Facial, Big Dick, Ass\r\n \nhttp://imgdone.com/viewer.php?file=74113546375025077836.jpg\r\n \nhttp://imgdone.com/viewer.php?file=12300178158408116755.jpg","torrent":{"xt":"urn:btih:80e24dd10af05ecab79bb7a529b151ff0c6ce675","amp;dn":"PrettyDirty+-+AJ+Applegate%2C+Cassidy+Klein+%28Battle+Of+The+Interns","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80e24dd10af05ecab79bb7a529b151ff0c6ce675","infoHashBuffer":{"type":"Buffer","data":[128,226,77,209,10,240,94,202,183,155,183,165,41,177,81,255,12,108,230,117]},"announce":[],"urlList":[]}}