{"title":"Dyked - Alexis, Elsa (From Now On You Are My Bitch / TeamSkeet)","uid":14762161,"size":262032769,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:831c99570fbd44283ed64e8fc6337b993f74698d&amp;dn=Dyked+-+Alexis%2C+Elsa+%28From+Now+On+You+Are+My+Bitch+%2F+TeamSkeet%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"codho","files":1,"time":1464849769,"description":"Dyked - Alexis, Elsa (From Now On You Are My Bitch / TeamSkeet) sd NEW June 02, 2016 \r\n\r\n\r\nTheres nothing like capping off on the phone with your best friends after a long day. Alexis is talking to one of her besties about the wild night she had fucking some new rich stud she had met. Sounds perfectly normal right? Wrong. Alexis is married and should not be letting other dicks double dip that pussy. Luckily, her secret is safe right? Wrong. Her step daughter Elsa was supposed to be out for the day, but it turns out she was just minding her own business on the couch, until she heard what was going on. Elsa moved in a bit closer to hear more of the details and couldnt believe that this ungrateful bitch was cheating on her daddy. This can not go unpunished. While Alexis was sleeping, Elsa stealthily snuck into her room to tie her up. Alexis woke up the next morning in complete bondage, and when she screamed for help Elsa slowly crept out from the corner basking a whip and an abusive agenda. Elsa explains what she heard, and Alexis tries to deny it but its no use. Shes gonna get DYKED and there is nothing she can do about it. Elsa starts by forcefully smacking her ass for every single guy shes ever cheated on her dad with. Then Elsa harshly finger fucked her pussy to the point where it wasnt pleasure, but sheer pain. Then she made Alexis force suck her outrageous purple strap on. She had to choke to know that what she had done was unacceptable. After thoroughly fucking her pussy to a pulp that no man could ever want again, Elsa finally stops and lays down the law. Alexis is her property now, and if she doesnt want daddy to find out about her devious ways, she will do whatever the fuck Elsa says whenever she says it. DONT TRY ME BITCH!\r\n\r\nScreenshots :\r\n\r\n\r\n \nhttp://imgaah.com/viewer.php?file=64906534615464405731.jpg\r\n \nhttp://imgaah.com/viewer.php?file=42247428232079530602.jpg\r\n \nhttp://imgaah.com/viewer.php?file=80729411091735178921.jpeg","torrent":{"xt":"urn:btih:831c99570fbd44283ed64e8fc6337b993f74698d","amp;dn":"Dyked+-+Alexis%2C+Elsa+%28From+Now+On+You+Are+My+Bitch+%2F+TeamSkeet%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"831c99570fbd44283ed64e8fc6337b993f74698d","infoHashBuffer":{"type":"Buffer","data":[131,28,153,87,15,189,68,40,62,214,78,143,198,51,123,153,63,116,105,141]},"announce":[],"urlList":[]}}