{"title":"Anal Brats 2","uid":14645875,"size":1860853844,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:84acdaa25fa665ff85aa7f926a79f12292054812&amp;dn=Anal+Brats+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hunter534","files":1,"time":1463586283,"description":"For Anal Brats 2, the perverted husband-and-wife team at LeWood Productions rounded up a fresh batch of up-and-coming ass whores eager to flaunt their lusty skills. Fresh-faced blonde Samantha Rone provides a delectable poolside tease, using her radiant smile - among many other assets - to lure director Mark Wood for a relentless anal power-fuck. She sucks cock ass-to-mouth before Mark slathers her smiling face with semen. Slender brat Nikki Knightly uses Mark`s club-like cock as her personal plaything, sloppily sucking him as a tear drips down her cheek. She buzzes a vibrator over her pussy while he plunges her anus; he lewdly shows off her juicy, gaping asshole to the camera. Chesty redhead Lauren Phillips fondles her furry bush in preparation for Chris Strokes` oversized meat sword. Lauren rides him like a thoroughbred before he showers her face with warm, spunky cream. Tanned beauty Summer Day twerks her butt playfully to instigate a scorching sphincter reaming. The sloppy slut gives Mark an eye-watering, ass-to-mouth blow job.\r\n\r\nGenre: All Sex, Big Tits, Hardcore, Anal\r\nCast: Mark Wood, Francesca Le, Summer Day, Chris Strokes, Lauren Phillips, Samantha Rone, Nikki Knightly\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-573c719e02a58.html \r\n \nhttp://photo-up.info/img-573c71a93df84.html","torrent":{"xt":"urn:btih:84acdaa25fa665ff85aa7f926a79f12292054812","amp;dn":"Anal+Brats+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84acdaa25fa665ff85aa7f926a79f12292054812","infoHashBuffer":{"type":"Buffer","data":[132,172,218,162,95,166,101,255,133,170,127,146,106,121,241,34,146,5,72,18]},"announce":[],"urlList":[]}}