{"title":"Oz: Broken Kingdom v1.1 mod + data [apkpita]","uid":14859553,"size":625778419,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:84f0d2fae403d08325046b26ff124f957d772fad&amp;dn=Oz%3A+Broken+Kingdom+v1.1+mod+%2B+data+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":5,"time":1465509257,"description":"Battle the Great Darkness that has cast its shadow across the peaceful Land of Oz. Join the kingdom's brave new heroine Ophelia Shen, along with Oz's legendary heroes -- Tin Man, Lion, and Scarecrow -- as they embark on an epic quest to stop the rising evil, restore the balance of magic, and return the kingdom to its rightful glory.\r\n\r\nCOMMAND a cast of new and classic Oz heroes in breathtaking turn-based combat. \r\n\r\nCOLLECT astounding abilities to evolve your heroes to Legendary levels of power.\r\n\r\nSUMMON incredible spells to crush fearsome enemies and rally the kingdom to your side!\r\n\r\nEXPLORE the dark corners of Oz, solve the thrilling mystery, and restore the balance between Good and Evil!\r\n\r\nUNLEASH UNIMAGINABLE POWER\r\nWith the combined might of Tin Man, Lion, Scarecrow, and mysterious newcomer Ophelia at your call, face the growing evil that is corrupting the source of all magic in Oz. Evolve each hero's unique abilities to devastate your enemies, and harness powerful gemstones to become a force for Good the likes the Kingdom has never known!\r\n\r\nFIGHT TO SAVE THE REALM\r\nBattle hordes of fiendish foes, beastly bosses, and nightmarish minions terrorizing the once-peaceful Kingdom of Oz. Dare to journey through the sinister Munchkin countryside, the perilous halls of Emerald City, and the shadowy lands beyond -- to shine the light of Goodness before the Great Darkness engulfs the entire realm.\r\n\r\nCOLLECT MIGHTY ABILITIES\r\nCollect unique abilities to summon the forces of strength, nature, and magic. Level up your heroes’ abilities to battle and cripple your enemies. Prepare to unleash the might of Tin Man’s Seismic Strike, Ophelia’s Blade Dance, and more!\r\n\r\nWhat’s new:\r\nBug fixes\r\n\r\nHacks:\r\n1. No Skill Cooldown.\r\n2. Instant Max Mana Refill at the end of every round.\r\n3. Healing Skill Multiplier.\r\n4. Enemy dodging AI disarmed.\r\n\r\nRequirements: Android OS 4.1 and up\r\nInstall APK. Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:84f0d2fae403d08325046b26ff124f957d772fad","amp;dn":"Oz%3A+Broken+Kingdom+v1.1+mod+%2B+data+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84f0d2fae403d08325046b26ff124f957d772fad","infoHashBuffer":{"type":"Buffer","data":[132,240,210,250,228,3,208,131,37,4,107,38,255,18,79,149,125,119,47,173]},"announce":[],"urlList":[]}}