{"title":"TopStyle 5.0.0.105 (Install + Portable)","uid":14996639,"size":55844107,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:865c5b0849b5bd00af892c19dc48045a2bb0e4b4&amp;dn=TopStyle+5.0.0.105+%28Install+%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jovo_bih","files":1,"time":1466353659,"description":"TopStyle 5.0.0.105 (Install + Portable)\r\n\r\nAbout this release\r\n\r\nVersion 5.0.0.105 is a hot-fix for version 5.0.0.104, not a true install.\r\nBug in v 5.0.0.104 : when you validate a HTML5 doc with the W3C validator, then the following error appears: HTTP Error 12168. Fixed.\r\n\r\nInstall: install v 5.0.0.104, update to 5.0.0.105 and apply patch (see readme file)\r\nPortable: registered, simply unpack and run Topstyle executable, disallow internet access\r\n\r\nAbout TopStyle\r\n\r\nTopStyle 5, a powerful HTML5 &amp; CSS3 editor for Windows.\r\n\r\nBring your ideas to life with HTML5 &amp; CSS3\r\nTopStyle 5 supports the newest versions of core standards that drive modern web experiences.\r\nYou'll get access to all the latest tags and properties, including assistance from built in tools like Insight, Inspector &amp; validators.\r\n\r\nHyperlinking (Go to Declaration) &amp; Property Help\r\nTopStyle's unique hyperlinking greatly simplifies navigating between documents. Click an HTML class attribute to navigate to the definition of that class in an external style sheet, or click an anchor tag or CSS link to open the linked file for editing. Clicking on a CSS property name in the editor window while holding the Ctrl key down will display detailed help about the selected property.\r\n\r\nSmart Copy and Paste - now 100% faster!\r\nWe believe that even smallest details can be improved and Smart Copy and Paste is our answer. You no longer need to highlight/select a word to copy it. With your cursor in a word all you have to do is press Ctrl+C (or Ctrl+X) and TopStyle will figure out what to select and copy. Smart Paste (Ctrl+Shift+V) will replace the current word. You won't believe how much you'll miss this feature in other editors!\r\n\r\nValidation: Style Checker and W3C + CSE + HTML5 validators\r\nCSS is actually quite simple, but getting it to work in multiple browsers is a challenge. This is where TopStyle shines! TopStyle's Style Checker is a powerful tool which validates your style sheets against multiple browsers, flagging any invalid properties or values it finds. What's more, TopStyle enables you to pass your style sheets directly to the W3C's validation services so you can quickly check against the official specifications.\r\n\r\nCSS3 Media Queries\r\nCSS3 allows you to specify a style sheet for certain conditions. For example, you can have one style sheet for large displays and a different style sheet specifically for mobile devices. TopStyle 5 allows you to tailor to different resolutions and devices without changing the content.\r\n\r\nCSS Selector Panel\r\nThe CSS Selector Panel displays all selectors in your document. Clicking any selector in the list will dive to the correct spot in a long document. But there is more: you can easily comment out or create new selectors too!\r\n\r\nHTML Structure Panel\r\nThe HTML Structure Panel appears below the code editor, and displays the hierarchy of HTML tags that lead up to your editing position. Selecting the parent tag is easy! When you click on one of the buttons in the HTML Structure Panel, TopStyle 5 will select the corresponding HTML tag (and its contents) in the editor.\r\n\r\nCSS Groups\r\nOne of the most daunting things about building and maintaining a web site can be wading through huge, disorganized style sheets. Nothing is worse than opening up a style sheet someone else has worked on and thinking, &quot;what the heck happened here?&quot;. One of TopStyle's most powerful features is its ability to group CSS selectors into a folder structure.\r\n\r\nAnd tons of small things:\r\n- HTML toolbar: TopStyle comes with a user-configurable HTML toolbar that is displayed above the editor. Simply click and hold down the mouse button on a snippet, and - then drag the item from the HTML toolbar anywhere into your document.\r\n- XRAY: You click the XRAY button to instantly answer those vital questions: where is the top and left of this element? how big is each margin? how big is the padding? how wide and high is the content box? what CSS selector(s) apply to this element?\r\n- Live Spell Checking: TopStyle identifies spelling errors as you type with wavy red underlines, and allows you to act upon each identified problem with a context menu.\r\n- Unicode: The TopStyle editor, Inspector, etc. are all Unicode-compliant. When you save your (X)HTML document, you can optionally select encoding for your document (UTF-8, UTF-16, ANSI, etc).\r\n- Prefixr: Keeping up with vendor-prefixed properties is hard. Prefixr to the rescue. Prefixr will filter your CSS3 properties and dynamically update them, adding (vendor-prefixed) properties for cross-browser compatibility.\r\n- File History: TopStyle 5 creates a backup every time you update and save a document. Thanks to a new History window, you can open a backup, compare differences between revisions, or roll back to a backup (restore a previous revision).\r\n- Wrap HTML Tag: While TopStyle easily provides auto tag closing, it also allows you to easily wrap an existing HTML Tag. Pick an element name from the Wrap HTML Tag dialog and your HTML tag should now be wrapped in a new HTML tag, without you having to manually locate the position for the open tag and the close tag.\r\n- Image Maps: An image map is an image that has been divided into areas, or &quot;hotspots&quot;; when the user clicks a hotspot, an action occurs (for example, your reader is taken to another Web page). TopStyle 5 comes with a built-in image map editor that makes it easy to create image maps for your Web pages.\r\n...and just the beginning.\r\n\r\nHomepage https://www.htmlvalidator.com/topstyle/","torrent":{"xt":"urn:btih:865c5b0849b5bd00af892c19dc48045a2bb0e4b4","amp;dn":"TopStyle+5.0.0.105+%28Install+%2B+Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"865c5b0849b5bd00af892c19dc48045a2bb0e4b4","infoHashBuffer":{"type":"Buffer","data":[134,92,91,8,73,181,189,0,175,137,44,25,220,72,4,90,43,176,228,180]},"announce":[],"urlList":[]}}