{"title":"Rush Limbaugh - June 1, 2016 Full Podcast.mp3","uid":14761349,"size":95730715,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:87ec0bd12072c4cc1d52b2aa938c63e926372754&amp;dn=Rush+Limbaugh+-+June+1%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1464839972,"description":"Rush Limbaugh - June 1, 2016 Full Podcast\r\n\r\nAs Predicted, Drive-By Media Claims Credit for Trump's Donations to Vets\r\n\r\n\r\nRUSH: Trump called the press conference, and I said when it was over: &quot;They're gonna claim credit here as having forced Trump into donating money he never intended to donate,&quot; that he was just saying he was going to.  But they have made Trump follow through on his promises, which he would not have done were it not for the brave, brave people in the Drive-By Media.  Well, let's see if I'm right.  We have put together a media montage of various media commentary following the presser from yesterday afternoon into last night.\r\n\r\nWhy Am I the Only One Who Said This About Trump's Press Conference?\r\n\r\nRUSH:  I got the audio sound bite roster, and I find out I'm half of it.  And it's because I, apparently, am the only person in major media who had the take on the Trump press conference that I had.  Apparently, virtually everybody in the cable news universe that cable news networks go to for analysts and analysis and so forth thought that Trump stepped in it big time yesterday. &quot;He made one of the biggest unforced errors of the campaign, to treat the press that way, to deal with them that way, to have this adversarial relationship with them.&quot;\r\n\r\n\r\nPolitical Journalism Isn't Personal, Claims Brit Hume\r\n\r\nRUSH:  You mean it isn't personal?  All this time and it's not personal?  See, I've been under the impression that it is all personal.  I know damn well the things that the Drive-Bys do to me are personal.  It certainly isn't professional.  \r\n\r\nSetting the Table for the Big Show\r\n\r\nRUSH: Bill Kristol has named his third-party godsend to save us all from Trump: David French, a writer at National Review... The Libertarian Mighty Mouse save-the-day character has got $15,000 in the bank...The Zika virus, Obama already wants $1.9 million to fight this virus. I think we're being scammed... On the weekend that Harambe, the 400-pound silverback gorilla at Cincinnati Zoo was killed, 69 people in Chicago were killed ...Two stories today on &quot;Clinton Might Not Be the Nominee&quot;...  Hillary, quote, &quot;People say, 'I really like you.  I just don't know if I can vote for a woman.'&quot;  She claims this is what people are saying to her!  Of course it's BS... \r\n\r\nMrs. Clinton Lacks Trump's Star Power -- And the Democrats Know It\r\nRUSH: There aren't too many politicians that cross over and are legitimate political stars and pop culture stars. And Trump is.  Whether you like it or not. And I'm not opining on it; I'm just saying it's what it is.  There is enthusiasm on the Trump side like there isn't anywhere else in this entire campaign.  No other candidate, Republican, Democrat, independent, has anything like this going on.  Trump, I read this morning, has achieved 100% name recognition, meaning he's the most famous person on the planet right now. \r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:87ec0bd12072c4cc1d52b2aa938c63e926372754","amp;dn":"Rush+Limbaugh+-+June+1%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ec0bd12072c4cc1d52b2aa938c63e926372754","infoHashBuffer":{"type":"Buffer","data":[135,236,11,209,32,114,196,204,29,82,178,170,147,140,99,233,38,55,39,84]},"announce":[],"urlList":[]}}