{"title":"Radiant Silvergun XBLA (Xbox 360)","uid":14772701,"size":642887680,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:88579775de7176dbe6eb8abb07b0411c48d3b8cb&amp;dn=Radiant+Silvergun+XBLA+%28Xbox+360%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"witzirlm","files":1,"time":1464923035,"description":"Radiant Silvergun is a vertically scrolling shoot 'em up video game developed by Treasure. It was originally released on the ST-V arcade platform in 1998 and subsequently ported to the Sega Saturn later that year.\r\n\r\nA port of Radiant Silvergun with enhanced high definition visuals was announced at Tokyo Game Show 2010 and released on the Xbox 360 via the Xbox Live Arcade service on September 14, 2011. Rather than emulate the Sega Saturn, the source code was used to port the game to the Xbox 360's hardware. Sprites were redrawn in high definition with an optional blooming effect, true alpha blending implemented (buggy and therefore limited on Saturn and Titan hardware) and a post-process filter applied to enhance the look of the game. Options are included to disable any or all of these graphical enhancements, allowing players to enjoy the game as it originally appeared if they so desire. Like the Xbox Live Arcade port of Ikaruga, the game's original 4:3 playing field runs pillarboxed in 16:9 aspect ratio and moves UI elements like player score, weapon level, and chain counter (new to this port of the game) to the border area with the new HUD. However, the game's original HUD can also be used if desired. In addition, the anime cut-scenes introduced in the Sega Saturn version of the game return with subtitles based on the Xbox 360's system language. Another special feature of the Xbox Live Arcade port of Radiant Silvergun includes a secret &quot;Ikaruga Mode&quot; where the game uses the same scoring mechanics of its spiritual successor, which can be accessed by unlocking an achievement within Ikaruga. Finally, the game comes with the options to play local or online cooperative modes and online leaderboards with the ability to download and share replays over Xbox Live","torrent":{"xt":"urn:btih:88579775de7176dbe6eb8abb07b0411c48d3b8cb","amp;dn":"Radiant+Silvergun+XBLA+%28Xbox+360%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88579775de7176dbe6eb8abb07b0411c48d3b8cb","infoHashBuffer":{"type":"Buffer","data":[136,87,151,117,222,113,118,219,230,235,138,187,7,176,65,28,72,211,184,203]},"announce":[],"urlList":[]}}