{"title":"John Batchelor June 2 2016 Battle Guadacanal part 1.mp3","uid":14776784,"size":9804716,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:88a11d0ab4c7f5143d6b818c3f2d4f0a1b78e0bc&amp;dn=John+Batchelor+June+2+2016+Battle+Guadacanal+part+1.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1464960614,"description":"\nThe Battle for Hell's Island: How a Small Band of Carrier Dive-Bombers Helped Save Guadalcanal by Stephen L. Moore. Part 1 OF 2\r\n\r\nFrom the author of Pacific Payback comes the gripping true story of the Cactus Air Force and how this rugged crew of Dive-Bombers helped save Guadalcanal and won the war.\r\n\r\nNovember 1942: Japanese and American forces have been fighting for control of Guadalcanal, a small but pivotal island in Japan’s expansion through the South Pacific. Both sides have endured months of grueling battle under the worst circumstances: hellish jungles, meager rations, and tropical diseases, which have taken a severe mental and physical toll on the combatants. The Japanese call Guadalcanal Jigoku no Jima—Hell's Island.\r\n\r\nAmid a seeming stalemate, a small group of U.S. Navy dive bombers are called upon to help determine the island's fate. The men have until recently been serving in their respective squadrons aboard the USS Lexington and the USS Yorktown, fighting in the thick of the Pacific War's aerial battles. Their skills have been honed to a fine edge, even as injury and death inexorably have depleted their ranks. When their carriers are lost, many of the men end up on the USS Enterprise. Battle damage to that carrier then forces them from their home at sea to operating from Henderson Field, a small dirt-and-gravel airstrip on Guadalcanal.\r\n\r\nWith some Marine and Army Air Force planes, they help form the Cactus Air Force, a motley assemblage of fliers tasked with holding the line while making dangerous flights from their jungle airfield. Pounded by daily Japanese air assaults, nightly warship bombardments, and sniper attacks from the jungle, pilots and gunners rarely last more than a few weeks before succumbing to tropical ailments, injury, exhaustion, and death. But when the Japanese launch a final offensive to take the island once and for all, these dive-bomber jocks answer the call of duty—and try to perform miracles in turning back an enemy warship armada, a host of fighter planes, and a convoy of troop transports.\r\n\r\nA remarkable story of grit, guts, and heroism, The Battle for Hell's Island reveals how command of the South Pacific, and the outcome of the Pacific War, depended on control of a single dirt airstrip—and the small group of battle-weary aviators sent to protect it with their lives.\r\n\r\n\r\nThe John Batchelor Show\t \nhttp://johnbatchelorshow.com/","torrent":{"xt":"urn:btih:88a11d0ab4c7f5143d6b818c3f2d4f0a1b78e0bc","amp;dn":"John+Batchelor+June+2+2016+Battle+Guadacanal+part+1.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88a11d0ab4c7f5143d6b818c3f2d4f0a1b78e0bc","infoHashBuffer":{"type":"Buffer","data":[136,161,29,10,180,199,245,20,61,107,129,140,63,45,79,10,27,120,224,188]},"announce":[],"urlList":[]}}