{"title":"[JulesJordan] - Jessa Rhodes - Big Tit Slut Rewarded With A Crea","uid":15358427,"size":614903257,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8a26b0171cb8a00a6a99495f9109ccf5de2fdee9&amp;dn=%5BJulesJordan%5D+-+Jessa+Rhodes+-+Big+Tit+Slut+Rewarded+With+A+Crea&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheSgrt","files":1,"time":1469007347,"description":"Screenshots:\r\n \nhttp://xxximages.co/img-578f290eef667.html\r\n\r\nDescription:\r\n\r\nJessa Rhodes is like the porn star that porn stars want to be. She's got smoldering eyes, a pouty mouth, juicy tits and nice booty. She's stacked, gorgeous and horny like a cat in heat. Jessa was always a hottie, but when she's pushing her sweet ass up in the air and begging daddy to spank her ass, she transcends hotness to some cosmic porn-perfection. What helps is knowing how much she wants dick - she wants dick anyway she can get it - this means she cannot wait to suck James' cock. She begs for it, the dirty slut, as he teases her pretty mouth with his hard cock. She's on her knees getting face fucked and titty fucked, and tells him to spit in her mouth because she wants to be treated like the beautiful whore she is. He sticks his tongue deep in her asshole and adds to her pussy juices so he can slide his cock inside and fuck her brains out. He bends her over and fucks her from behind, tosses her around and plows her hard and fast as he chokes her and makes her cum. Jessa wants that cum inside her pussy so bad and James finally gives her all that she wants. That tasty little cream filled pussy is a sight to behold and Jessa is a happy little slut with her dose of Internal Damnation!\r\n\r\n[JulesJordan] - Jessa Rhodes - Big Tit Slut Rewarded With A Creampie From James Deen - [July 20, 2016 - APT].mp4","torrent":{"xt":"urn:btih:8a26b0171cb8a00a6a99495f9109ccf5de2fdee9","amp;dn":"%5BJulesJordan%5D+-+Jessa+Rhodes+-+Big+Tit+Slut+Rewarded+With+A+Crea","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a26b0171cb8a00a6a99495f9109ccf5de2fdee9","infoHashBuffer":{"type":"Buffer","data":[138,38,176,23,28,184,160,10,106,153,73,95,145,9,204,245,222,47,222,233]},"announce":[],"urlList":[]}}