{"title":"Dungeon Quest v2.2.0.5 mod","uid":14822794,"size":42341736,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:8e549dcd483bf54dc15ab33722b7431d7039e392&amp;dn=Dungeon+Quest+v2.2.0.5+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pr1s0neR","files":2,"time":1465267764,"description":"Embark on a journey to find the best loot and defeat all challengers in this truly free-to-play Offline Action RPG.\r\n\r\nFeaturing randomized loot, dynamically generated dungeons, and 4 acts each with their own legendary boss awaiting. Journey through unlimited floors of increasingly difficult enemies while collecting the best items possible while competing with your friends in our Battle Arena competitive leagues.\r\n\r\nEquip your Wizard, Warrior, or Rogue with infinitely customizable weapons and armor to help destroy the elemental evils plaguing the land. There are always new ways to vanquish your foes! Upgrade your gear with our Crystal and Mythstone crafting system. Make your character even more powerful using our Gear-Based Skill and Talent system.\r\n\r\nTired of playing alone? Bring your other characters into combat with you to gain experience and loot alongside your hero using our Hireling system. Or maybe you'll come across one of the many endearing companions included in our Pet system! \r\n\r\nFeatures Include:\r\n\r\n• Play for as long as you want not content or pay walls\r\n• Equip your Wizard, Warrior, or Rogue with amazing randomized loot you find on   your adventure!\r\n• Never fight in the same dungeon twice! Climb your way through more than unlimited randomly generated floors.\r\n• Test your skill against one of 4 Legendary bosses at the end of every Act!\r\n• Bring your other characters into your adventures using the new Hireling System!\r\n• Manage your player AI to create your own army of adventures!\r\n• Native Controller integration for iOS7 with full HUD support!\r\n• Customize the dungeon's difficulty and rewards by choose between 8 enemy power levels.\r\n• New Pet System that lets you choose a follower to aid in your journey","torrent":{"xt":"urn:btih:8e549dcd483bf54dc15ab33722b7431d7039e392","amp;dn":"Dungeon+Quest+v2.2.0.5+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e549dcd483bf54dc15ab33722b7431d7039e392","infoHashBuffer":{"type":"Buffer","data":[142,84,157,205,72,59,245,77,193,90,179,55,34,183,67,29,112,57,227,146]},"announce":[],"urlList":[]}}