{"title":"Sances - Scrd and Sec Songs - Musica Fabula (2000) [Philidor]","uid":15502398,"size":246364224,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:90613b34ff4bb7147d0d79c1667080956bdcd92d&amp;dn=Sances+-+Scrd+and+Sec+Songs+-+Musica+Fabula+%282000%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Philidor","files":22,"time":1470530823,"description":"Giovanni Felice Sances began his career as a singer; good ones were among the most highly paid musicians at the courts of 17th century Europe. He turned his hand to composition, and esecpially opera, where he produced a number of hit works--remember, at a time when operas last the entire evening, with other entertainment between the acts, and a given opera was the equivalent of watching one's favorite television series in terms of popularity. In 1636 in moved to the Holy Roman Empire's court in Vienna, and by 1649 had worked his way up to vice-Kapellmeister, where he wrote many highly regarded sacred works. Twenty years later, he became Kapellmeister, one of the most coveted of positions, in charge of over 250 musicians, as well as composing and training them.\r\n\r\nSances' songs, sacred and secular, on this album show a ready, fluid tunefulness and theatrical gesture that recalls both Italian popular music and opera. The Viennese emperors favored this Italianate approach, and it's difficult not to imagine some favored singer or two performing these for the royals long after the ceremonial activities of the day had ended.\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nBio enclosed. Texts and translations are provided. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread:\r\n  \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:90613b34ff4bb7147d0d79c1667080956bdcd92d","amp;dn":"Sances+-+Scrd+and+Sec+Songs+-+Musica+Fabula+%282000%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90613b34ff4bb7147d0d79c1667080956bdcd92d","infoHashBuffer":{"type":"Buffer","data":[144,97,59,52,255,75,183,20,125,13,121,193,102,112,128,149,107,220,217,45]},"announce":[],"urlList":[]}}