{"title":"Michel Coquet - Kundalini, le Yoga du Feu (Chakras)","uid":14841650,"size":11837727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92411b9ed334744ea7e954f067bc51285f102ff6&amp;dn=Michel+Coquet+-+Kundalini%2C+le+Yoga+du+Feu+%28Chakras%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"asperge","files":2,"time":1465378268,"description":"Michel Coquet - Kundalini, le Yoga du Feu\r\nAlphée | ISBN : 2753804745 | 2009-07 | PDF/EPUB | 308/347 pages | 8/2 MB\r\n\r\nPeu de sujets de nature ésotérique ont autant suscité l'intérêt et la curiosité, et enflammé l'imagination, que ce feu sacré connu des yogis sous le nom de Kundalinî. Ce feu divin, véritable force électrique pour certains ou feu pranique pour d'autres, est une puissance potentielle lovée à la base de l'épine dorsale de tout être humain. En s'éveillant, cette puissance féminine s'élève et ouvre les chakras du corps vital, conférant au yogi certains pouvoirs ou charismes. Puis, une fois parvenue au sommet du crâne, elle fusionne avec la conscience divine, apportant l'extase et la libération du cycle de vie et de mort.\r\nVoilé sous le couvert de la symbolique tantrique, le kundalinî yoga peut tout aussi bien être la baguette magique de la résurrection que le plus terrible des feux destructeurs. Grâce à certaines clefs, l'auteur s'est efforcé de dégager des voiles et des allégories, les lois et les connaissances de ce feu mystérieux. Ce traité n'est pas une méthode mais une approche théorique de la nature de ce feu, de sa manière de s'élever, des dangers et des bienfaits de son éveil.\r\nUn pan du mystère qui entourait cette connaissance millénaire est désormais accessible, elle n'en demeure pas moins l'objet d'une prudente technique spirituelle ne pouvant être transmise que par l'initiation, la connaissance intellectuelle n'étant qu'un simple, mais utile, préliminaire.\r\n\r\nMichel COQUET a réalisé de nombreux voyages à travers le monde qui lui ont permis de faire la part entre le mythe et la réalité dans le domaine de la spiritualité. Il est l'auteur de nombreux ouvrages dont Histoire des peuples et des civilisations, de la création jusqu'à nos jours (éditions Nouvelles Réalités, 2002) ; La Vie de Jésus démystifiée (éditions Nouvelles Réalités, 2003) ; Shingon, le Bouddhisme tantrique japonais (édition Guy Trédaniel, 2004). Enfin Les Maîtres, du mythe à la réalité et Le Troisième Œil, en 2007 et 2008 aux éditions Alphée","torrent":{"xt":"urn:btih:92411b9ed334744ea7e954f067bc51285f102ff6","amp;dn":"Michel+Coquet+-+Kundalini%2C+le+Yoga+du+Feu+%28Chakras%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92411b9ed334744ea7e954f067bc51285f102ff6","infoHashBuffer":{"type":"Buffer","data":[146,65,27,158,211,52,116,78,167,233,84,240,103,188,81,40,95,16,47,246]},"announce":[],"urlList":[]}}