{"title":"Phoenix Marie Megapack","uid":14674912,"size":58337322438,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:92f6ba87c4cdfc4abe4c80926ba0c7fa8c6f0ed4&amp;dn=Phoenix+Marie+Megapack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":null,"files":165,"time":1463936481,"description":"About\r\nBorn: 1981-09-21\r\nBirthplace: Golden Valley, Arizona, United States of America\r\nHeight: 5 ft 9 in (175 cm)\r\nWeight: 141 lbs (64 kg\r\n\r\nBio\r\nToday, Phoenix Marie is an absolute tigress of the smut industry. She’s strong, demanding, insatiable, and could eat up horny little wankers like a mid-sex snack. Imagine this tall, blonde, fully-developed superwoman crawling on all fours toward you like she’s going to devour every drop of sex slime that your balls could muster. How many men and women have fallen fully prey to her big juicy ass? The thing about Phoenix is, she’s a true pervert of the mind and only needed the porn industry to help bring it out. Before getting into the biz, and even before discovering her cougar powers, this girl was a certified nerd, shy and awkward, but with a growing curiosity about everything deviant and filthy when it came to ugly-bumping. What a trip it’s been from that curious girl to corrupted sex-pod when a genius talent agent helped her break into meat movies. Where does Miss Marie shine most? Up her ass. Phoenix loves doing anal so much that she often tells her male performers to stick it up there even when it’s not in the script. Imagine that booty riding your dong in reverse cowgirl, and you’ve maybe just caught a glimpse of paradise on earth. Aside from this other-worldly body, we’re glad to know that Phoenix is down to earth on her own time. It gives horny people hope that there might be a Phoenix Marie lurking in the depths of shy awkward girls everywhere.\r\n\r\nScreenshots","torrent":{"xt":"urn:btih:92f6ba87c4cdfc4abe4c80926ba0c7fa8c6f0ed4","amp;dn":"Phoenix+Marie+Megapack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92f6ba87c4cdfc4abe4c80926ba0c7fa8c6f0ed4","infoHashBuffer":{"type":"Buffer","data":[146,246,186,135,196,205,252,74,190,76,128,146,107,160,199,250,140,111,14,212]},"announce":[],"urlList":[]}}