{"title":"tuPOY - Thermally Unstable Partially Oriented Yarns","uid":15169356,"size":2859868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95dae7f937c3be798307374fa05f52cbcba1fefc&amp;dn=tuPOY+-+Thermally+Unstable+Partially+Oriented+Yarns&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1467380380,"description":"tuPOY - Thermally Unstable Partially Oriented Yarns - Silicon of the Future - H.D. Mustafa et al. (Springer, 2016).pdf\r\n\r\nISBN 978-81-322-2630-7\r\n\r\nThis book provides a new direction in electronics research with the invention of a new material tuPOY, which changes our perception of developing electronics. Evolving on a relatively underplayed phenomenon of static electricity in scientific exploration and application, tuPOY upholds the potential to rival both silicon and metals as electronics of the future. Devices made of tuPOY present a new emblem to the technological world, where we could envision our electronic paraphernalia from a completely different perspective. A computer the size of a big wall, which could be neatly folded and kept in our pockets when not in use and laundered on a regular basis, can be imagined possible with this invention. The concept, manufacturing process, physics and uses of tuPOY as the next generation material of electronics is described in this book.\r\n\r\nThe book covers the production process of tuPOY and goes on to conceptual advancement from manipulating the sensing, radiating and processing properties of tuPOY. Theoretical modelling of tuPOY is characterized by steady-state equations exploiting interchanges based on the lattice kinetics, which mathematizes an Interchange Phenomenon in tuPOY. The numerical manifestations calibrate mathematically, tuPOY’s response to any external physical impetus such as charge, heat or energy flow.\r\n\r\nThe book validates the sensing properties and theoretical model by designing a tuPOY sensor which can be used in a plethora of applications. A novel microstrip antenna is designed by amalgamation of tuPOY, raw silk and polynylon composites to experimentally verify the radiation properties of the new material. The conduction properties are verified by drawing fibres of tuPOY and using them as wires and connectors in electronics. A Power Generating Unit (PGU) is designed with tuPOY as its primary element. This is a first of its kind PGU that scavenges power from thermal energy presenting a new dimension in operational power dynamics.\r\nOverall this book should be of interest to a wide range of readers ranging from researchers, scientists, developers, manufacturers, engineers, graduate students and anyone who has satiety to think differently","torrent":{"xt":"urn:btih:95dae7f937c3be798307374fa05f52cbcba1fefc","amp;dn":"tuPOY+-+Thermally+Unstable+Partially+Oriented+Yarns","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95dae7f937c3be798307374fa05f52cbcba1fefc","infoHashBuffer":{"type":"Buffer","data":[149,218,231,249,55,195,190,121,131,7,55,79,160,95,82,203,203,161,254,252]},"announce":[],"urlList":[]}}