{"title":"Brexit.the.movie.CSH.avi","uid":14677429,"size":722758610,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a9e436a5dadcecbeb5bbe1890bd05a54511edd7&amp;dn=Brexit.the.movie.CSH.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GM_CSH","files":1,"time":1463957466,"description":"Encoded by GM_CSH\r\nfile Format MP4 / Avi \r\nMP3 audio \r\n\r\nthis has had half a million views on you tube in the last week.\r\n\r\nmovie info from site follows.\r\n\r\nBREXIT THE MOVIE is a feature-length documentary film to inspire as many people as possible to vote to LEAVE the EU in the June 23rd referendum.\r\n\r\nBREXIT THE MOVIE spells out the danger of staying part of the EU. Is it safe to give a remote government beyond our control the power to make laws? Is it safe to tie ourselves to countries which are close to financial ruin, drifting towards scary political extremism, and suffering long-term, self-inflicted economic decline?\r\n\r\nBREXIT THE MOVIE shows a side of the EU they don't want us to see: the sprawling self-serving bureaucracy, the political cynicism, the lack of accountability, the perks, the waste, the cronyism, the corruption.\r\n\r\nBREXIT THE MOVIE cuts through the patronizing intellectualism of the noble, higher goals of 'Project Europe', to reveal the self-interestedness of the political-bureaucratic class which runs and benefits from the EU.\r\n\r\nBREXIT THE MOVIE highlights the danger of becoming a prisoner in an insular, backward-looking Fortress Europe. And it explores the exciting opportunities that open up to us when we look beyond the narrow confines of the EU.\r\n\r\nBREXIT THE MOVIE looks to the future, arguing forcefully and persuasively that it is safer and wiser to live in a country which is free, independent, self-governing, confident and global.\r\n\r\nFor more information, visit www.brexitthemovie.com","torrent":{"xt":"urn:btih:9a9e436a5dadcecbeb5bbe1890bd05a54511edd7","amp;dn":"Brexit.the.movie.CSH.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a9e436a5dadcecbeb5bbe1890bd05a54511edd7","infoHashBuffer":{"type":"Buffer","data":[154,158,67,106,93,173,206,203,235,91,190,24,144,189,5,165,69,17,237,215]},"announce":[],"urlList":[]}}