{"title":"C-II + Updated Installer","uid":15165685,"size":234359725,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9d26c31d1834272b8ec32747fa5d2add5cf95e8b&amp;dn=C-II+%2B+Updated+Installer&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FlatSoda","files":3,"time":1467342044,"description":"NOTE: THIS IS NOT A GAME, IT IS A FAKE GAME DIRECTORY AND INSTALLER\r\n\r\nI think I put a little too much effort into pretending to develop a fake 90s game... So a 90s kid like me wanted to make a 90's PC FPS game and I got the idea of doing so from a litteral dream I had. And since it's not the 90's and I have little to no talent on making games, I decided today, lets make all this useless shit because I feel like looking at something nostalgic and pretty. So let's run down all this shit and how I made this garbage so...\r\n\r\n-BOX ART: I made the box art to look like a 90's PC game cover and taking ideas from the Descent 3 cover, I embarassingly took a Roblox Skybox and mirrored it and added a cool and confusing label to it because those PC games always had those complex and creative titles. And out of ideas, completely, lets just make a title that sounds cool and make it abbreviate something. I made this box art in under 30 minutes on Sony Vegas (yeah. not photoshop) and I had it sitting in my pictures folder since forever now. So this idea was a while back.\r\n\r\n-GAME DIRECTORY AND INSTALL: This was made today since during another dream I had, the cool looking box art wasn't enough. So I wanted to add a little more to it by using the process, iexpress.exe to make an installer for all this. And for the directory, so I look up other game directories specifically with a lot of different file types, copy and paste them and rename them as well. I used GTA IV for the most part since that entire thing looks like a freaking code for arming a laser cannon in space. Especially the physical PC copy. This took the entire day TBH.\r\n\r\n-GAME SCREENSHOT: Really, it wasn't that much of a challenge or anything major. All I did was start Garry's Mod and set the game on VERY low settings, 800x600 resolution and an Unreal Tournament weapon mod and take place in a Half Life: Source map. But I make it feel like it runs on the Quake engine and has realistic weapons and the only realistic weapon I have in the pack is that thing. I disable all but the Quake View Bob, Unreal Tournament SWEPS and some other vital stuff such as the &quot;Press E to take weapon&quot; instead of being near it to grab it, Extended Properties, Empty Hands mod, and Remove or Give all weapons mod. Personally, I keep these so I start with only the UT weapons, don't pick up random HL weapons, empty hands for the intro, and other stuff such as more stuff to do to the game when you right click an object.\r\n\r\n\r\nOverall, I really wished this was a thing since I put so much needless effort into it but maybe when I grow into a more independent person, I might do something with this but I don't garuntee it since I got really lazy with the Directory part since that shit took forever.\r\n\r\nApparently, Windows doesn't like iexpress.exe stuff that much since you can easily add unwanted stuff on that. The .exe's do not do anything but start a useless installer for a randomly generated terms of use .txt which in fact, I made from a website and WITHOUT any payment since that'd be absurd to do for a fake game. The directory download is mostly for looks and a detailed walkthrough of random junk files from other games put into a folder. Please though, if you're done with it, delete it. I don't want to watch you guys waste hard drive space like that. But I hope you guys understand my confidence in a cool idea such as this. Thanks everyone and I will see you all next time.\r\n\r\nBOX ART: http://i.imgur.com/Os9XPOY.jpg\r\n\r\nGAME SCREENSHOT (not real): http://i.imgur.com/Xt5k2QQ.jpg","torrent":{"xt":"urn:btih:9d26c31d1834272b8ec32747fa5d2add5cf95e8b","amp;dn":"C-II+%2B+Updated+Installer","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d26c31d1834272b8ec32747fa5d2add5cf95e8b","infoHashBuffer":{"type":"Buffer","data":[157,38,195,29,24,52,39,43,142,195,39,71,250,93,42,221,92,249,94,139]},"announce":[],"urlList":[]}}