{"title":"Best Bible Movies - 04 - Paul and Peter","uid":15385377,"size":9007087833,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9fbf967b8044f9c8fe109e1a6ee26274546e2120&amp;dn=Best+Bible+Movies+-+04+-+Paul+and+Peter&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":73,"time":1469287194,"description":"lassic Bible Movies - 04 - Paul and Peter - Vol 2\r\n\r\n\r\nPOtHS says: Peter and Paul The Dynamic Duo\r\n\r\nDescription:\r\n\r\nWhere the Passion ends...the story of Paul begins.\r\n\r\nPaul The Apostle -aka- (Saul Of Tarsus) and (St. Paul).\r\n\r\nFrom the Emmy award-winning director of Joseph and Jesus comes the story of Paul the Apostle. This miniseries chronicles the life of Christ's most prolific messenger. Paul, originally known as Saul of Tarsus, was a persecutor of Christians until Jesus came to him in a vision. Forever changed, Paul withstood persecution and imprisonment and with unflagging determination he spread the word of Christ. Beautifully shot in the Moroccan desert, Paul the Apostle is a sweeping saga of a man whose story continues after the Passion of Christ.\r\n\r\nTravel the road to Damascus and witness Saul's transformation from persecutor to preacher of Christ! Look behind the pages of Scripture to observe political and religious conflicts. As you follow Paul's gospel-spreading journeys, you'll see what life was like for first-century believers. Beautifully filmed on location in Morocco. (Contains some violence.) Approx. 3 hours\r\n\r\nThe world-changing saga of Paul the Apostle.\r\n\r\nThe early first century followers of Jesus were a small, struggling group within Judaism who seemingly posed no threat to anyone, certainly not the mighty Roman empire. But there was one determined to see this fledging faith exterminated. His name was Saul and he became the greatest persecutor of the early church. But within a matter of a few years, the Christians fiercest opponent became its most effective advocate.\r\n\r\nStruck down by a powerful conversion experience on the road to Damascus, Saul--his name changed to Paul--went on to become the greatest missionary in the history of Christianity. He went on to write more of the New Testament books than any other. In this impressive drama starring Garry Cooper we follow Saul the angry zealot to Paul the servant of Christ who will pay any price to bring his message to the world.\r\n\r\nSPECIAL FEATURES:\r\n\r\n  * Biographical information on leading actors\r\n  * Chapter titles provided for easy scene access\r\n  * Extra bonus feature: I, Paul -- a reenactment of II Timothy\r\n\r\nPeter &amp; Paul\r\n\r\nAnthony Hopkins stars in this epic network television mini-series that brings to life the precarious existence of early Christianity. The new movement is beset by violent opposition from without and constant turmoil from within. Two key leaders emerge -- Peter and Paul -- who struggle to keep the faith alive. This dramatic presentation follows the pair, together and separately, through three epochal decades. Included are the stoning of Stephen, the road to Damascus, their encounter in Jerusalem, their conflicts over how the word of Christ should be spread. Paul’s travels to Asia Minor and Greece, Peter and Paul’s clashes over Jewish law, and Peter’s decision to follow in Paul’s courageous footsteps. The drama concludes in Rome in approximately A.D. 64 with the beheading of Paul and the crucifixion of Peter under Emperor Nero","torrent":{"xt":"urn:btih:9fbf967b8044f9c8fe109e1a6ee26274546e2120","amp;dn":"Best+Bible+Movies+-+04+-+Paul+and+Peter","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fbf967b8044f9c8fe109e1a6ee26274546e2120","infoHashBuffer":{"type":"Buffer","data":[159,191,150,123,128,68,249,200,254,16,158,26,110,226,98,116,84,110,33,32]},"announce":[],"urlList":[]}}