{"title":"Mary Connealy-Now and Forever &amp; Fire &amp; Ice","uid":15398544,"size":405818682,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a0a1e446c980ba32afd67ba3165b540ceb71891a&amp;dn=Mary+Connealy-Now+and+Forever+%26amp%3B+Fire+%26amp%3B+Ice&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twocows","files":70,"time":1469426239,"description":"Now and Forever\r\n\r\nShannon Wilde is the middle sister--and the one who loves animals. She's established her own homestead and is raising sheep for their wool. Things are going fine...until Shannon gets swept over a cliff by Matthew Tucker! Tucker seizes every opportunity to get away from civilization, but one particular walk in the woods ends with him sprinting away from an angry grizzly and plunging into a raging river, accidentally taking Shannon Wilde with him. Their adventure in the wilderness results in the solitary mountain man finding himself hitched to a young woman with a passel of relatives, a homestead, and a flock of sheep to care for. As Tucker and Shannon learn to live with each other, strange things begin to happen on Shannon's land. Someone clearly wants to drive her off, but whoever it is apparently didn't count on Tucker. Trying to scare Matthew Tucker just makes him mad--and trying to hurt the woman he's falling in love with sets off something even he never expected.\r\n\r\nFire &amp; Ice\r\nSaddle Up for a Wildly Fun Ride in Mary Connealy's Latest Bailey Wilde is one of the best new ranchers in the West. She's been living disguised as a man for a while, but when Gage Coulter comes to drive her off her homestead, he quickly realizes he's dealing with a woman-a very tough, very intriguing woman at that. Gage is an honest man, but he didn't make his fortune being weak. He won't break the law, but he'll push as hard as he can within it. Five thousand acres of his best range land is lost to him because Bailey's homestead is located right across the only suitable entrance to a canyon full of lush grass","torrent":{"xt":"urn:btih:a0a1e446c980ba32afd67ba3165b540ceb71891a","amp;dn":"Mary+Connealy-Now+and+Forever+%26amp%3B+Fire+%26amp%3B+Ice","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0a1e446c980ba32afd67ba3165b540ceb71891a","infoHashBuffer":{"type":"Buffer","data":[160,161,228,70,201,128,186,50,175,214,123,163,22,91,84,12,235,113,137,26]},"announce":[],"urlList":[]}}