{"title":"Counter Strike 1.6 Original Version","uid":15379762,"size":209040384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a31a77c6b2db7f6002d8662d6611ee6eb8e1f2aa&amp;dn=Counter+Strike+1.6+Original+Version&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Jellybe","files":1,"time":1469221240,"description":"Full clean: this version has no mods and other stuff like that. \r\n\r\nCounter-Strike (also known as Half-Life: Counter-Strike) is a first-person shooter video game developed by Valve Corporation. It was initially developed and released as a Half-Life modification by Minh &quot;Gooseman&quot; Le and Jess &quot;Cliffe&quot; Cliffe in 1999, before Le and Cliffe were hired and the game's intellectual property acquired. Counter-Strike was first released by Valve on the Microsoft Windows platform in 2000. The game later spawned a franchise, and is the first installment in the Counter-Strike series. Several remakes and Ports of Counter-Strike have been released on the Xbox console, as well as OS X and Linux. It is sometimes referred to as Counter-Strike 1.6 to distinguish it from other titles of the series, 1.6 being the final major software update the game received.\r\n\r\nSet in various locations around the globe, players assume the roles of members of combating teams of the governmental counter-terrorist forces and various terrorist militants opposing them. During each round of gameplay, the two teams are tasked with defeating the other by the means of either achieving the map's objectives, or else eliminating all of the enemy combatants. Each player may customize their arsenal of weapons and accessories at the beginning of every match, with currency being earned after the end of each round","torrent":{"xt":"urn:btih:a31a77c6b2db7f6002d8662d6611ee6eb8e1f2aa","amp;dn":"Counter+Strike+1.6+Original+Version","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a31a77c6b2db7f6002d8662d6611ee6eb8e1f2aa","infoHashBuffer":{"type":"Buffer","data":[163,26,119,198,178,219,127,96,2,216,102,45,102,17,238,110,184,225,242,170]},"announce":[],"urlList":[]}}