{"title":"Pokémon Go v2.9.2","uid":15359468,"size":60878833,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a68fe858a19b46de307933edffbb3f2118b9e9d5&amp;dn=Pok%C3%A9mon+Go+v2.9.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ShotChain","files":1,"time":1469022817,"description":"Pokémon Go (stylized as Pokémon GO) is a free-to-play location-based augmented reality mobile game developed by Niantic for iOS and Android devices. It was released in most regions of the world in July 2016. Making use of GPS and the camera of compatible devices, the game allows players to capture, battle, and train virtual creatures, called Pokémon, who appear on device screens as though in the real world. The game is free-to-play, although it supports in-app purchases of additional gameplay items. An optional companion Bluetooth wearable device, the Pokémon Go Plus, is planned for future release and will alert users when Pokémon are nearby.\n\nPokémon Go was released to mixed reviews. Reviewers praised the overall experience of the game and the incentive to adventure the real world, while noting technical issues that were apparent at launch. The game quickly became one of the most used smart device apps, surpassing the previous record held by Candy Crush Saga in the United States, and was a boon to the stock value of The Pokémon Company and Nintendo. The game was credited with popularizing augmented reality, and was praised by some medical professionals for potentially improving the mental and physical health of players, but also attracted some controversy due to reports of causing accidents and being a public nuisance at some locations.\n\n","torrent":{"xt":"urn:btih:a68fe858a19b46de307933edffbb3f2118b9e9d5","amp;dn":"Pok%C3%A9mon+Go+v2.9.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a68fe858a19b46de307933edffbb3f2118b9e9d5","infoHashBuffer":{"type":"Buffer","data":[166,143,232,88,161,155,70,222,48,121,51,237,255,187,63,33,24,185,233,213]},"announce":[],"urlList":[]}}