{"title":"Power of omens- Rooms of anguish(Flac rip)","uid":15487237,"size":537796074,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a6f68c90e5d2cbdbcd00ccb64a9f77cca494a27a&amp;dn=Power+of+omens-+Rooms+of+anguish%28Flac+rip%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Failrner","files":9,"time":1470334305,"description":"Overpayed for this rare cd to share it with you guys in flac format so you don't have to overpay for it. =)\r\n\r\n\r\nPower of Omens biography\r\nPOWER OF OMEN (PoO for short) out of San Antonio (Texas) is showing the world what progressive metal can evolve into. For those unfamiliar with the band, PoO is a highly complex prog metal band that employs a very unique style with powerful, clean melodies riffs and at the same time with a versatile vocals that finishes for convince. Their sound blends QUEENSRYCHE style vocals and melodies with instrumentation that reminds me a lot of &quot;Perfect Symmetry&quot; era FATES WARNING. Their compositions fell in the monotony in some passages.\r\n\r\nA demo emerged in 1996 and their first effort &quot;Eyes of the Oracle&quot; was released in 1998. This has a similar blend of jazzy instrumentation, superlative vocals, and dark atmosphere. No need to compare &quot;Rooms Of Anguish&quot; with their previous album because this new one is so brilliant that you will forget all the rest. This album becomes a fan of influences and similiraties that go it doing each time more interesting for the fans of the style; is incorporated a great deal of the classical thing in the style of FATES WARNING, PARALLELS and QUEENSRYCHE. Put this album in your private CD collection, you won't regret it!","torrent":{"xt":"urn:btih:a6f68c90e5d2cbdbcd00ccb64a9f77cca494a27a","amp;dn":"Power+of+omens-+Rooms+of+anguish%28Flac+rip%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6f68c90e5d2cbdbcd00ccb64a9f77cca494a27a","infoHashBuffer":{"type":"Buffer","data":[166,246,140,144,229,210,203,219,205,0,204,182,74,159,119,204,164,148,162,122]},"announce":[],"urlList":[]}}