{"title":"Le Choix Atlante (Atlantide.Histoire.Religions)","uid":14646611,"size":28734957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a879f322cb4108ff922df83b32ff0f11096210c3&amp;dn=Le+Choix+Atlante+%28Atlantide.Histoire.Religions%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"asperge","files":8,"time":1463594895,"description":"Guillaume Delaage - Le choix atlante : L'origine secrète du mal planétaire actuel\r\nAlexandre Moryason | ISBN : 2352800110 | 2013-06 | PDF/DJVU | 372 pages | 9/5 MB\r\n\r\nDans des éléments enfouis, « cachés » - et donc dits « secrets » - de l'Histoire des Atlantes réside, pour l'humanité du XXIe siècle, non pas un intérêt intellectuel mais un véritable « plan de survie »... C'est avec une grande érudition et une simplicité percutante que Guillaume Delaage révèle les enjeux actuels dus à « ce Mal Planétaire » qui enserre, tel le serpent néfaste des mythologies, notre monde.\r\n\r\nCe « mal ancien », inoculé sur Terre aux temps de l'Atlantide et « venu de l'espace » pour nous détruire, est magistralement expliqué dans cet ouvrage. Il se manifeste, depuis des millénaires et de façon plus intense ces dernières décennies, par l'intention volontaire de soumettre les êtres à un esclavage irrémédiable en leur supprimant les ressources financières, en valorisant des instincts les plus violents et destructeurs et en favorisant un abêtissement graduel qui permet de ne plus penser et donc de rester passif face à ce système aliénant menant, à terme, à la perte de notre humanité, c'est-à-dire de notre Âme. C'est ce but auquel tendent ceux qui le servent et que l'on nomme « les Fils de Bélial »...\r\n\r\nIl s'agit bien de la survie de notre dignité humaine et spirituelle. Nous sommes, par conséquent, tous concernés.\r\n\r\nCet ouvrage, abondamment documenté, nous amène à reconsidérer nos origines et à conforter, de ce fait, la quête d'un bonheur authentique. Il nous incite à appréhender l'existence d'autres êtres, « bons » ou « mauvais » vivant dans l'Espace qui, bien que la plupart d'entre nous l'ignorent, influencent encore le cours des événements de notre planète...\r\n\r\nEn effet, chacun de nous porte dans son inconscient le « souvenir » enfoui d'une époque très lointaine où le bonheur sur Terre ne se mesurait pas à l'aune des biens matériels possédés mais à la Paix de l'Âme. Celle-ci était conquise par son union constante avec des Êtres à la Conscience très élevée, vivant dans les mondes spirituels et appartenant à d'autres espaces interstellaires ; c'était l'union avec « les Dieux »... Parmi ces Dieux se détachait un Être emblématique de toute Science et de grande Sagesse parce qu'il était considéré comme l'Instructeur de notre Planète : le célèbre Dieu Thot des Égyptiens, qui transmit une Connaissance qui devint secrète et qui fonde la « Doctrine Hermétique », « l'Ésotérisme », « les Sciences Occultes ». Cette Doctrine recèle les clefs de notre bonheur ici-bas","torrent":{"xt":"urn:btih:a879f322cb4108ff922df83b32ff0f11096210c3","amp;dn":"Le+Choix+Atlante+%28Atlantide.Histoire.Religions%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a879f322cb4108ff922df83b32ff0f11096210c3","infoHashBuffer":{"type":"Buffer","data":[168,121,243,34,203,65,8,255,146,45,248,59,50,255,15,17,9,98,16,195]},"announce":[],"urlList":[]}}