{"title":"PrettyDirty - Cherie DeVille (The One Night Stand Part One) NEW","uid":15418775,"size":434945031,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:abf6692bb698be3c05260403efc251dc405782e0&amp;dn=PrettyDirty+-+Cherie+DeVille+%28The+One+Night+Stand+Part+One%29+NEW+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1469616497,"description":"Danny Mountain is your typical scumbag husband always on the run, making excuses to his wife as to why he's always in a rush to leave. Today, he meets with realtor Cherie DeVille and after a quick view of the home, he grabs her into his arms and kisses her passionately ready to fuck her brains out. He throws her onto the bed, spreads her legs and eats out her pussy like a hungry wildling and finger fucks her tight hole, preparing her for his huge cock. Cherie deep throats Danny's shaft until his ball sack hits her chin with saliva drenching her pretty face. He fucks her from the back and front, leaving her breathless in orgasmic gratification before gifting her with a mouthful of hot cum. After Danny's fix he rushes out the door as if nothing ever happened, leaving Cherie with the unrealistic idea that she is in love...That is, until she sees the wedding ring that he left behind. Cherie becomes psychotic and in a jealous rage dreams up a plan to get back at Danny. Then her phone rings and it's Danny desperately needing his ring back.. What will she do now?\r\nCategories Blonde, Big Tits, Hardcore, Fingering, MILF &amp; Mature, Pussy Licking, Pussy to mouth, Blowjob, Deepthroat, Open Mouth Facial, Big Dick\r\n \nhttp://imgdone.com/viewer.php?file=90154671975943445817.jpg\r\n \nhttp://imgdone.com/viewer.php?file=26749178167548850536.jpg","torrent":{"xt":"urn:btih:abf6692bb698be3c05260403efc251dc405782e0","amp;dn":"PrettyDirty+-+Cherie+DeVille+%28The+One+Night+Stand+Part+One%29+NEW+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf6692bb698be3c05260403efc251dc405782e0","infoHashBuffer":{"type":"Buffer","data":[171,246,105,43,182,152,190,60,5,38,4,3,239,194,81,220,64,87,130,224]},"announce":[],"urlList":[]}}