{"title":"Need For Speed (NFS) Most Wanted Plus Cheats v1.3.71 Android","uid":14799540,"size":22121395,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ac2a317e2bcf77176dd033c218b6889adcb85ee3&amp;dn=Need+For+Speed+%28NFS%29+Most+Wanted+Plus+Cheats+v1.3.71+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zerk1337","files":2,"time":1465113309,"description":"Buckle up, hit the gas and hold on tight; you’re in for the ride of your life. Outrun cops, outsmart rivals – and outdrive your friends – in the most dangerous Need for Speed yet. Do you dare to be the Most Wanted?\r\n\r\nNeed for Speed Most Wanted is an immersive, high quality game that requires a 350MB+ download. To speed things up, we recommend connecting to WiFi. We promise – it’s worth it!\r\n\r\nMAKE TROUBLE, GET WANTED\r\nEvade a relentless police force while you clash with street racers. Race and chase hot cars like the SRT Viper GTS, Porsche 911 Carrera S, Hummer H1 Alpha, and many more. Feel the intensity of no-brakes-allowed street racing with realistic full-car damage for the first time on mobile.\r\n\r\nLEAVE YOUR MARK\r\nLog into Origin to check the Wanted List and find out who is the Most Wanted across platforms and among your friends. Then, challenge your friends and prove your racing skills in nonstop competition.\r\n\r\nGO FROM ZERO TO MOST WANTED…\r\nDrive and customize over 35 of the world’s most exciting cars\r\nRace the way you want! By popular demand, you can now touch or tilt to steer\r\nUse Mods to enhance your car and get ahead of the pack in style\r\nExperience the action with mind-blowing graphics and intense full-car damage \r\nEarn Speed Points to unlock new cars\r\nYour rivals will do everything they can to stop you from getting to the top – but in this world, there can only be one Most Wanted.\r\n\r\nWhat's in this version: (Updated : Feb 12, 2016)\r\n'Rev your engines and get ready to burn some rubber! We’ve made some behind-the-scenes improvements to keep your game running smoothly.\r\nRequired Android O/S : 2.3.3+","torrent":{"xt":"urn:btih:ac2a317e2bcf77176dd033c218b6889adcb85ee3","amp;dn":"Need+For+Speed+%28NFS%29+Most+Wanted+Plus+Cheats+v1.3.71+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac2a317e2bcf77176dd033c218b6889adcb85ee3","infoHashBuffer":{"type":"Buffer","data":[172,42,49,126,43,207,119,23,109,208,51,194,24,182,136,154,220,184,94,227]},"announce":[],"urlList":[]}}