{"title":"Os Cavaleiros do Zodiaco - Cavaleiros de prata","uid":14665413,"size":2218461408,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac7b9f196c4216941996fe3af980766390f981af&amp;dn=Os+Cavaleiros+do+Zodiaco+-+Cavaleiros+de+prata&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Downloadlitoral","files":26,"time":1463795705,"description":"Cavaleiros de Prata\r\n\r\nNo Santuário, Mestre Ares chama o Cavaleiro de Cristal e aplica nele o golpe Satã Imperial, deixando o cavaleiro totalmente dominado. Ao chegar à Sibéria, Hyoga encontra seu Mestre transformado e acaba tendo que matá-lo.\r\n\r\nGigars envia o Cavaleiro do Fogo para matar Saori Kido. Shun tenta detê-lo, mas surge Ikki de Fênix, que liquida o Cavaleiro do Fogo.Pitón manda Marin de Águia, que foi mestra de Seiya, ir atrás dele no japão. Misty de Lagarto a segue e enfrenta Seiya, mas o Lagarto é derrotado pelo Pégaso. Chegam mais dois Cavaleiros de Prata. Mouses de Baleia e Asterion de Cães de Caça. Eles descobrem que Marin ajudou Seiya a exterminar Misty e prendem a amazona como traidora. No meio do combate com Seiya, os Cavaleiros de Prata revelam que Marin é a irmã desaparecida do Pégaso. Seiya elima Mouses. Marin se solta e ajuda Seiya a vencer Asterion.\r\n\r\nDe volta à Grécia, os Cavaleiros de Bronze descobrem que Saori Kido é a reencarnação de Atena. Surge Babel de Centauro. Durante a luta aparecem três cavaleiros desconhecidos, os Cavaleiros de Aço. Com a ajuda dos Cavaleiros de Aço. Com a ajuda dos Cavaleiros de Aço, Hyoga liquida Babel.\r\n\r\nPitón então envia Shina de Cobra, Algol de Perseu e Spartam atrás de Seiya e seus amigos. Seiya enfrenta e vence Shina, mas ele e Shun são transformados em pedra pelo Escudo da Medusa de Algol. Cego, mas guiado pelo cosmo de Atena, Shiryu derrota o Cavaleiro de Prata, fazendo Seiya e Shun voltarem ao normal. Shina e Spartan fogem.\r\n\r\nDe volta ao Japão, Seiya e os demais ficam sabendo que os Cavaleiros de Aço foram criados em segredo por Mitsumasa Kido para ajudá-los. Shiryu volta a Rosan para se recuperar.\r\n\r\nEnquanto isso, na Fundação, Seiya e Ikki se desentendem e Jamian de Corvo seqüestra Saori. O Pégaso localiza o Cavaleiro de Prata que levou Atena e a liberta dos corvos mas, encurralado, é obrigado a saltar montanha abaixo com Saori nos braços. Shina surge e vê a Deusa agradecer a Seiya por tê-la salvo. Enciumada, a Amazona de Cobra parte para matar o Cavaleiro de Bronze. Porém, quando tudo parece perdido, Shun e Hyoga chegam ao local, derrotam Jamian e atingem Shina, que desaparece.\r\n\r\nMais dois Cavaleiros de Prata aparecem. Capella de Auriga e Dante de Cérbero quase matam os Cavaleiros de bronze. Entretanto, ikki surge para defender Saori. Dante é liquidado por Fênix e Capella é mandado para o Mundo dos mortos com o Golpe Fantasma. Dante ainda tenta voltar à luta, mas Shun dá conta dele.\r\n\r\nIkki volta à Ilha da Rainha da Morte, onde enfrenta dois Cavaleiros Negros: Jango e o Fênix das Trevas. Fortificado pelo Espírito de Esmeralda, o mais forte dos Cavaleiros de bronze detona seus adversários.\r\n\r\nShiryu recebe em Rosan a visita de ohko, antigo discípulo do Mestre Ancião que voltou pra enfrentar o Dragão e provar que é o mais forte, mas acaba vencido. Na Fundação, a Máscara de Sagitário se une ao resto da armadura e afunda num lago.\r\n\r\nEnquanto isso, Seiya luta contra Aracne de Tarântula. Depois de derrotar o Cavaleiro de Prata, o Pésago vai atrás da Água da Vida a fim de levá-la para Shiryu.\r\nAres fala sobre os Cavaleiros de Ouro, guardiões das 12 Casas Zodiacais, e chama Milo de Escorpião para liquidar os Cavaleiros de Bronze.\r\n\r\nNo hospital, Seiya é atacado por Shina, mas quando Aiolia de Leão chega para matá-lo, a Amazona salva seu amado. Surgem Algethi de Hércules, Dios de Mosca e Siríus de Cão Maior, Cavaleiros de Prata que Seiya vence com a ajuda da Armadura de Ouro de Ságitario. Saori e o Espírito de Aiolos revelam que Ares tentou matar Atena.\r\n\r\nEnquanto isso, o Máscara da Morte tenta exterminar o Mestre Ancião (Dohko de Libra), mas Shiryu encara o Cavaleiro de Ouro. Quando o dragão está prestes a ser derrotado, Mu de Áries surge para ajudá-lo.\r\n\r\nAiolia tenta desmascarar Ares, mas Shaka de Virgem aparece e enfrenta o Leão.\r\n\r\nSaori é acertada no peito com uma flecha de ouro, pelo Cavaleiro de Prata, Tremy de Flecha. Para salvá-la, os Cavaleiros de Bronze têm que atravessar as 12 Casas Zodiacais em 12 horas","torrent":{"xt":"urn:btih:ac7b9f196c4216941996fe3af980766390f981af","amp;dn":"Os+Cavaleiros+do+Zodiaco+-+Cavaleiros+de+prata","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac7b9f196c4216941996fe3af980766390f981af","infoHashBuffer":{"type":"Buffer","data":[172,123,159,25,108,66,22,148,25,150,254,58,249,128,118,99,144,249,129,175]},"announce":[],"urlList":[]}}