{"title":"Nanotechnology for Cancer Therapy - Mansoor M. Amiji","uid":15533298,"size":22440273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b39ebfb9dda10ea066f45436a72cc960d9840c2e&amp;dn=Nanotechnology+for+Cancer+Therapy+-+Mansoor+M.+Amiji&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470855489,"description":"Nanotechnology for Cancer Therapy - Mansoor M. Amiji (CRC, 2007).pdf\r\n\r\nWhile simultaneous breakthroughs occurring in molecular biology and nanoscience/technology will ultimately revolutionize all of medicine, it is with our efforts to prevent, diagnose, and treat cancer that many of the most dramatic advances will occur. In support of this potential, the U.S. National Cancer Institute (NCI) established the Alliance for Nanotechnology in Cancer in 2004 and pledged $144.3 million in funding over the next five years. \r\n\r\nEdited by one of the most dynamic pioneers in the field, Nanotechnology for Cancer Therapy focuses on those nanoscientific and nanotechnological strategies that are evolving as the most promising for the imaging and treatment of cancer. Among the various approaches considered, nanotechnology offers great possibilities for the targeted delivery of drugs and genes to tumor sites and the ultimate replacement of those chemotherapeutic agents so compromised by side effects.\r\n\r\nWithin this volume, the expertise of world-renowned academic and industrial researchers is brought together to provide a comprehensive treatise. Composed of 38 chapters, the book is divided into 7 sections that cover -\r\nFundamentals of targeting strategies, nanotechnology characterization for cancer therapy, and USFDA guidelines on approval of nanotechnology products\r\nPolymeric conjugates used for tumor-targeted imaging and delivery, including imaging to evaluate therapeutic efficacy \r\nPolymeric nanoparticle systems that emphasize biodegradable, long-circulating nanoparticles for passive and active targeting\r\nPolymeric micellar assemblies, where sophisticated chemistry is leading to novel nanosystems that can provide efficient delivery to tumors \r\nDendritic nanostructures used for cancer imaging and therapy \r\nLiposome-based delivery systems -- the oldest nanotechnology method employed in cancer therapy \r\nOther lipid nanosystems used for targeted delivery, including those that can cross biological barriers, as well as mitochondria-specific delivery","torrent":{"xt":"urn:btih:b39ebfb9dda10ea066f45436a72cc960d9840c2e","amp;dn":"Nanotechnology+for+Cancer+Therapy+-+Mansoor+M.+Amiji","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39ebfb9dda10ea066f45436a72cc960d9840c2e","infoHashBuffer":{"type":"Buffer","data":[179,158,191,185,221,161,14,160,102,244,84,54,167,44,201,96,217,132,12,46]},"announce":[],"urlList":[]}}