{"title":"Morgan Page and Michael S - Against the World (DTS Headphone X)","uid":14855858,"size":64079122,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b46e9ffec3adf2a1b8c6d31d2fce6057b156d42d&amp;dn=Morgan+Page+and+Michael+S+-+Against+the+World+%28DTS+Headphone+X%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ADHDerby","files":4,"time":1465473982,"description":"Morgan Page and Michael S. &quot;Against the World&quot; mixed in DTS Headphone:X.\r\n\r\nWhen you combine DTS Headphone:X with one of the genre’s best vocal producers and one of its strongest vocal performers and songwriters, the results are guaranteed to be extraordinary. Morgan Page and Michael S. have pulled out all the stops to deliver an emotionally charged song – the first EDM release in Headphone:X\r\n\r\nDTS Headphone:X allows mobile devices to turn an ordinary pair of headphones into an impressive personal surround sound system.\r\n\r\nImagine an audio technology designed from the ground up to deliver the best end-2-end experience to a consumer. DTS Headphone:X accurately recreates the production soundstage, optimizes the audio for both the device and headphones, and finally allows the consumer to fine tune the sound, drastically improving the experience.\r\n\r\nDTS Headphone:X faithfully reproduces the home theater surround sound experience using any pair of headphones. By using the acoustic characteristic of the original mixing studio, or other professional audio labs as a reference, Headphone:X externalizes and accurately recreates the studio soundstage through any headphones. With benefits for content owners, device manufacturers, headphone manufactures and consumers, DTS Headphone:X presents a whole new way to hear mobile entertainment.\r\n\r\nMore info and videos: http://dts.com/headphonex\r\n\r\n\r\nCheers,\r\n\r\nADHDerby","torrent":{"xt":"urn:btih:b46e9ffec3adf2a1b8c6d31d2fce6057b156d42d","amp;dn":"Morgan+Page+and+Michael+S+-+Against+the+World+%28DTS+Headphone+X%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b46e9ffec3adf2a1b8c6d31d2fce6057b156d42d","infoHashBuffer":{"type":"Buffer","data":[180,110,159,254,195,173,242,161,184,198,211,29,47,206,96,87,177,86,212,45]},"announce":[],"urlList":[]}}