{"title":"Hollywood U with Bethany Mota v2.9.2 mod [apkpita]","uid":14747115,"size":78427767,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:b661bcb3b09fa2df5fa11d16657401ab0de80b87&amp;dn=Hollywood+U+with+Bethany+Mota+v2.9.2+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1464735075,"description":"THE HOTTEST NEW STAR IN HOLLYWOOD IS... YOU!\r\n\r\nCongratulations! Your acceptance letter to the prestigious HOLLYWOOD UNIVERSITY has arrived! Pack your bags and get ready for fame, fashion, and romance... at the school where celebrities are made!\r\n\r\n- CHOOSE YOUR MAJOR! \r\nStudy as a director, movie star, or fashionista! Pave your path to fame, your way!\r\n\r\n- BUILD YOUR CAREER! \r\nPlay new episodes each week to meet new celebrities and build your career!\r\n\r\n- FIND LOVE AT AMOUR! \r\nRomance a movie star boyfriend or the hottest fashionistas on the planet! Over a dozen bachelors and bachelorettes await!\r\n\r\n- PLAY MATCHMAKER! \r\nSet your friends up for romance by finding them the perfect date at Couples Corner!\r\n\r\n- HANG WITH YOUR SQUAD! \r\nBecome BFFs with Hollywood's sweetest fashionista and suavest talent agent... and more!\r\n\r\n- ENJOY IMMERSIVE STORIES! \r\nLive your Hollywood life in ongoing storylines! Build your fame, produce awesome movies, and even MARRY your boyfriend!\r\n\r\n- DRESS TO IMPRESS! \r\nUnleash your inner fashionista, and style yourself in dozens of high-fashion gowns and trendy outfits!\r\n\r\n- MAKE HIT BLOCKBUSTERS! \r\nWork with the hottest celebrities in the industry to smash box office records!\r\n\r\n- JOIN HOLLYWOOD'S ELITE! \r\nBuild your media empire to gain access to Hollywood's most exclusive social circles!\r\n\r\n- RECRUIT NEW FRIENDS! \r\nAdd everyone from movie stars to music moguls to celebrity athletes to your entourage through parties at Club VIP!\r\n\r\n- TRAVEL THE WORLD! \r\nJet to Vegas with your boyfriend, attend fashion shows in New York, and find romance in Europe... the planet is yours to explore!\r\n\r\n- DISCOVER NEW STORIES! \r\nPlay new episodes of your Hollywood adventure each week! Gain fame with each quest to join the A-list!\r\n\r\nHollywood U is brought to you by Pixelberry Studios, the same team that created the Top 10 game High School Story! Keep your eyes open... you may see some familiar faces from high school in your Hollywood adventures!\r\n\r\nPlease note that Hollywood U is completely free to play, but you can purchase some in-game items with real money. If you don't want to use this feature, you can disable in-app purchases in your device's settings.\r\n\r\n\r\nChat with us: FB .com/PlayHollywoodU\r\nFollow us: @PlayHollywoodU\r\n\r\n* FB and other certain links not allowed in the torrent description\r\n\r\n\r\nWhat’s new:\r\nThis very special update brings YouTube star and fashion designer Bethany Mota to Hollywood U… plus the all-new Vlogger types! This update includes:\r\nNEW A-LISTER: Add Bethany Mota to your entourage!\r\nSIX NEW OUTFITS based on Bethany Mota's fashion line!\r\nNEW CLASSMATES: Vlogger come to Hollywood U!\r\nMake sure to check back each week for new quests!\r\nAnd if you're enjoying Hollywood U, let us know with a FIVE-STAR REVIEW!\r\nKeyan\r\nLevel 100 Music Mogul\r\n\r\nMod Info:\r\n1. Infinite Cash\r\n2. Infinite Diamonds\r\n3. Infinite Tickets\r\n4. Max Level\r\n\r\nRequirements: Android OS 4.0 and up","torrent":{"xt":"urn:btih:b661bcb3b09fa2df5fa11d16657401ab0de80b87","amp;dn":"Hollywood+U+with+Bethany+Mota+v2.9.2+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b661bcb3b09fa2df5fa11d16657401ab0de80b87","infoHashBuffer":{"type":"Buffer","data":[182,97,188,179,176,159,162,223,95,161,29,22,101,116,1,171,13,232,11,135]},"announce":[],"urlList":[]}}