{"title":"Panama Papers and the Offshore Leaks investigations CSV File","uid":14742854,"size":41248473,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b9e22892031773af8ca29f462a4c5988749c60ca&amp;dn=Panama+Papers+and+the+Offshore+Leaks+investigations+CSV+File&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1464696755,"description":"This database contains information on almost 320,000 offshore entities that are part of the Panama Papers and the Offshore Leaks investigations. The data covers nearly 40 years – from 1977 through 2015 – and links to people and companies in more than 200 countries and territories.\n\nThe real value of the database is that it strips away the secrecy that cloaks companies and trusts incorporated in tax havens and exposes the people behind them. This includes, when available, the names of the real owners of those opaque structures. In all, the interactive application reveals more than 360,000 names of people and companies behind secret offshore structures. They come from leaked records and not a standardized corporate registry, so there may be duplicates. In some cases, companies are listed as shareholders for another company or a trust, arrangement that often helps obscure the flesh-and-blood people behind offshore entities.\n\nICIJ obtained the data through two massive leaks. The majority of the names in this database come from Panamanian law firm Mossack Fonseca, whose inner workings were exposed in the Panama Papers investigation published in April 2016 in conjunction with Süddetsche Zeitung and more than 100 other media partners. Around a third of the offshore entities were incorporated through Portcullis Trustnet (now Portcullis) and Commonwealth Trust Limited, two offshore service providers exposed as part of ICIJ’s 2013 Offshore Leaks exposé. This was the first information added to this database when it was released in June 2013, which was then produced in conjunction with Costa Rican newspaper La Nación.\n\nThe database does not disclose the totality of the leaked records. It doesn’t divulge raw documents or personal information en masse. It contains a great deal of information about company owners, proxies and intermediaries in secrecy jurisdictions, but it doesn’t disclose bank accounts, email exchanges and financial transactions contained in the documents.\n\nICIJ is publishing the information in the public interest. While many of the activities carried out through offshore entities are perfectly legal, extensive reporting by ICIJ and its media partners for more than four years has shown that the anonymity granted by the offshore economy facilitates money laundering, tax evasion, fraud and other crimes. Even when it’s legal, transparency advocates argue that the use of an alternative, parallel economy undermines democracy because it benefits a few at the expense of the majority.\n\nOfficial Link :- https://offshoreleaks.icij.org\n\nWindows Version :- https://thepiratebay.org/torrent/14742901/\n\nMac Version :- https://thepiratebay.org/torrent/14742935/","torrent":{"xt":"urn:btih:b9e22892031773af8ca29f462a4c5988749c60ca","amp;dn":"Panama+Papers+and+the+Offshore+Leaks+investigations+CSV+File","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e22892031773af8ca29f462a4c5988749c60ca","infoHashBuffer":{"type":"Buffer","data":[185,226,40,146,3,23,115,175,140,162,159,70,42,76,89,136,116,156,96,202]},"announce":[],"urlList":[]}}