{"title":"The Hyperion Cantos - All 4 Audiobooks (M4B)","uid":15386971,"size":2737299556,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bf71f5fd1c488aaba2078c5a133d81d71dd4de10&amp;dn=The+Hyperion+Cantos+-+All+4+Audiobooks+%28M4B%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":13,"uploader":"myles4833","files":104,"time":1469300388,"description":"The Hyperion Cantos is a series of science fiction novels by Dan Simmons. The title was originally used for the collection of the first pair of books in the series, Hyperion and The Fall of Hyperion, and later came to refer to the overall storyline, including Endymion, The Rise of Endymion, and a number of short stories. Within the fictional storyline, the Hyperion Cantos is an epic poem written by the character Martin Silenus.\r\n\r\nOf the four novels, Hyperion received the Hugo and Locus Awards in 1990; The Fall of Hyperion won the Locus and British Science Fiction Association Awards in 1991; and The Rise of Endymion received the Locus Award in 1998. All four novels were also nominated for various science fiction awards.\r\n\r\nHyperion\r\n\r\nFirst published in 1989, Hyperion has the structure of a frame story, similar to Geoffrey Chaucer's Canterbury Tales and Giovanni Boccaccio's Decameron. The story weaves the interlocking tales of a diverse group of travelers sent on a pilgrimage to the Time Tombs on Hyperion. The travelers have been sent by the Church of the Final Atonement, alternately known as the Shrike Church, and the Hegemony (the government of the human star systems) to make a request of the Shrike. As they progress in their journey, each of the pilgrims tells their tale.\r\n\r\nThe Fall of Hyperion\r\n\r\nThis book concludes the story begun in Hyperion. It abandons the storytelling frame structure of the first novel, and is instead presented primarily as a series of dreams by John Keats.\r\n\r\nEndymion\r\n\r\nThe story commences 272 years after the events in the previous novel. Few main characters from the first two books are present in the later two. The main character is Raul Endymion, an ex-soldier who receives a death sentence after an unfair trial. He is rescued by Martin Silenus and asked to perform a series of rather extraordinarily difficult tasks. The main task is to rescue and protect Aenea, a messiah coming from the distant past via time travel. The Catholic Church has become a dominant force in the human universe and views Aenea as a potential threat to their power. The group of Aenea, Endymion, and A. Bettik (an android) evades the Church's forces on several worlds, ending the story on Earth.\r\n\r\nThe Rise of Endymion\r\n\r\nThis final novel in the series finishes the story begun in Endymion, expanding on the themes in Endymion as Raul and Aenea battle the church and meet their respective destinies","torrent":{"xt":"urn:btih:bf71f5fd1c488aaba2078c5a133d81d71dd4de10","amp;dn":"The+Hyperion+Cantos+-+All+4+Audiobooks+%28M4B%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf71f5fd1c488aaba2078c5a133d81d71dd4de10","infoHashBuffer":{"type":"Buffer","data":[191,113,245,253,28,72,138,171,162,7,140,90,19,61,129,215,29,212,222,16]},"announce":[],"urlList":[]}}