{"title":"Face.Off.Max.3.7.8.6","uid":14781909,"size":23288658,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c026a204133145f014c8fed9d772f2b5dd5e9469&amp;dn=Face.Off.Max.3.7.8.6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"roflcopter2110","files":3,"time":1464993508,"description":"http://extraimago.com/images/2016/06/03/box_fom_250.jpg\r\n\r\nFace.Off.Max.3.7.8.6\r\n\r\nFace Off Max – is a cool application that allows you to add your face to another body by editing two different pictures. You can select your own photos or you can experiment with samples included within app’s templates.\r\n\r\nHaven’t you ever wondered how you would look if you had another body? Wouldn’t it be great to see your face in a celebrity group or on a magazine cover?\r\n\r\nNow Face Off Max enables you to embarrass your coworkers, make yourself look cool and make your friends look like dweebs all with a few clicks of the mouse.\r\n\r\nOur amazingly simple and easy interface, step-by-step instruction and hundreds of fantastic templates allow anyone to be a professional artist. Share your creations with your friends. It’s perfect withMySpace, email, blogs, spaces, e-cards, fakes, jokes and many more!\r\n\r\nFeatures\r\nCreate funniest photos with built-in and updated templates or your own photos:\r\n• Designed by professional artists, hundreds of fantastic templates are offered in Face Off Max. No matter for what use: creating a funny photo for yourself, ridiculing your friends or having a photo with your idol, you can easily find a template suitable. And if you want to create the photo with your own photos, it also works. No matter in what way, you just need to offer your photos and then have fun.\r\n\r\nShare with your friends: spread your fun:\r\n• By using Face Off Max, you can easily display your masterpiece in everywhere you want to keep in touch with your friends:MySpace, blog, email and etc. And it works even easier withJust with one click, you can have your photos uploaded directly to\n\r\nEasy interface and using guide: simple process leads to amazing results:\r\n• The intuitive interface lets you know at the first glance how to achieve what you want with Face Off Max. The considerate Face Off Max service supporters also provide detailed using instruction which will accompany with you till the end of your creating. You just need to follow the wizard and then everything is done. However, although the process is simple, the results can be fantastic. After several stages of photo editing, your photo will look as natural as it should be.\r\n\r\nText adding – speak the fun out:\r\n• After creating a great photo, sometimes you may still feel incomplete and want to write some funny words on it. Now with Face Off Max, your photo will be endowed with a slogan and speak the fun out by itself. You can even put your words in a balloon to enhance effects","torrent":{"xt":"urn:btih:c026a204133145f014c8fed9d772f2b5dd5e9469","amp;dn":"Face.Off.Max.3.7.8.6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c026a204133145f014c8fed9d772f2b5dd5e9469","infoHashBuffer":{"type":"Buffer","data":[192,38,162,4,19,49,69,240,20,200,254,217,215,114,242,181,221,94,148,105]},"announce":[],"urlList":[]}}