{"title":"John Batchelor Rating Russian Vs Nato 2015.mp3","uid":14834627,"size":5259703,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c0cd7bb7fb7c784851a80245a456b8d99c747c52&amp;dn=John+Batchelor+Rating+Russian+Vs+Nato+2015.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1465347223,"description":"Rating Russia vs NATO Weapon Systems, 2015. @pappalardojoe\r\n\r\n&quot;Every May Russia trots out its latest and greatest military upgrades. This year, armored vehicles took center stage. These are a point of pride for the Russians, who (rightfully) see their ability to make and field tanks as a reason they won World War II.\r\n\r\n&quot;So the gang at Jane's Defense took notice when the T-14 Armata main battle tank rolled in the parade (see top of page). This is the first new tank designed by Russia since the iconic T-72 rolled off the assembly line in the 1970s. It is built to protect the crew, using an unmanned turret and plenty of armor. The speculation, based on media reports and backup up by the design, is that the tank will receive a new 152mm main gun, making it a well-armed apex predator that is hard to kill.\r\n\r\n&quot;Meanwhile, the United States is busy trying to keep its aging tanks ready for action. Or, as the Army puts it, &quot;Our priority focus is to enhance capabilities of the current force through low risk and cost-effective fleet modernization.&quot; The effort has focused on keeping the M1A1 Abrams ready and deadly in the 21st century. The latest upgrade, under way now, incorporates better thermal sights, display panels, and remotely operated guns.\r\n\r\nEdge: Russia\r\n\r\n&quot;New does not always mean better, and Russian military industry is not what it used to be. But betting against Russian armor is a bad idea. Besides, their new tanks seem well-made, studded with sensors and advanced armor that will make them dangerous foes...&quot;","torrent":{"xt":"urn:btih:c0cd7bb7fb7c784851a80245a456b8d99c747c52","amp;dn":"John+Batchelor+Rating+Russian+Vs+Nato+2015.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0cd7bb7fb7c784851a80245a456b8d99c747c52","infoHashBuffer":{"type":"Buffer","data":[192,205,123,183,251,124,120,72,81,168,2,69,164,86,184,217,156,116,124,82]},"announce":[],"urlList":[]}}