{"title":"Computer Modelling of Microporous Materials","uid":15024896,"size":4454160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3f321e49f3aa2f5ec1537cf1b642f763e271b4f&amp;dn=Computer+Modelling+of+Microporous+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1466508841,"description":"Computer Modelling of Microporous Materials - C.R.A. Catlow et al. (AP, 2004).pdf\r\n\r\nISBN 0-12-164137-6\r\n\r\nMicroporous materials, including both zeolites and aluminophosphates are amongst the most fascinating classes of materials, with wide ranging important applications in catalysis, gas separation and ion exchange. The breadth of the field has, moreover, been extended in the last ten years by the discovery of the versatile and exciting ranges of mesoporous materials.\r\nComputational methods have a long and successful history of application in solid state and materials science, where they are indeed established tools in modelling structural and dynamic properties of the bulk and surfaces of solids; and where they are playing an increasingly important role in understanding reactivity. Their application to zeolite science developed strongly in the 1980's, with the initial successes in modelling structure and sorption, and with emerging capability in quantum mechanical methods. The field was reviewed over ten years, since then there have been major developments in techniques and of course the power of the available hardware, which have promoted a whole range of new applications to real complex problems in the science of microporous materials. This book aims to summarise and illustrate the current capabilities of atomistic computer modelling methods in this growing field.\r\n\r\n- Details advances in the rapidly expanding field of microporous materials.\r\n- Summarises key current techniques in this type of modelling.\r\n- Illustrates the current capabilities of atomistic computer modelling methods","torrent":{"xt":"urn:btih:c3f321e49f3aa2f5ec1537cf1b642f763e271b4f","amp;dn":"Computer+Modelling+of+Microporous+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3f321e49f3aa2f5ec1537cf1b642f763e271b4f","infoHashBuffer":{"type":"Buffer","data":[195,243,33,228,159,58,162,245,236,21,55,207,27,100,47,118,62,39,27,79]},"announce":[],"urlList":[]}}