{"title":"The Laura Ingraham Podcast May 18 2016","uid":14648925,"size":34010299,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c4b00e6e088abd1d1adf672edb3dee4397ab5ddb&amp;dn=The+Laura+Ingraham+Podcast+May+18+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1463613465,"description":"Laura Ingraham Podcast Mp3 Wednesday May 18,2016\r\n\r\nLI Podcast 051816\r\nPhil Robertson: Trump Needs to be 'Born Again' \r\n\r\nGuest Lineup\r\nPat Buchanan - Conservative political commentator, author, syndicated columnist, politician and broadcaster\r\nPhil Robertson - Patriarch of the Duck Dynasty family\r\nJohn Malcolm - Former DOJ lawyer; Director of the Edwin Meese III Center for Legal and Judicial Studies, Heritage Foundation\r\n\r\nDonald Trump, the presumptive Republican nominee for president, has released a list of 11 potential Supreme Court justices he plans to vet to fill the seat of late Justice Antonin Scalia if he's elected to the White House.\r\n\r\nRepublican Failure to Address Rigged Economy Led to Trump\r\n\r\nF.H. Buckley - The American Spectator\r\nRemember when conservatives used to talk about &quot;Peak Trump&quot;? He won Massachusetts but he wasn't going any further. He won New York, but he had peaked. And then he won Indiana and his opponents dropped out. So I suppose we're finally at Peak Trump.\r\n\r\nTrump-GOP Elite Entente Should Give Dems Pause\r\n\r\nRobert Kuttner - The American Prospect\r\nWe are starting to see the sorry spectacle of a Republican establishment that detests Donald Trump falling in line behind his candidacy. Before it's over, schisms will be papered over, the vast majority of Republican elected officials will endorse Trump, and he will pick up plenty of Republican donors as well.\r\n\r\nRepublicans Trust More Than Ryan\r\nWhile many Republicans inside Washington see House Speaker Paul Ryan as the leader of the Republican Party, voters see things differently.\r\nAddThis Sharing Buttons\r\n\r\n\r\n\rMeeting With Conservatives Is a Textbook Con Job\r\n\r\nLast week, several former &quot;news curators&quot; forrevealed that the social media company was systematically blacklisting conservative outlets and conservative topics. Workers tasked with managingTrending Topics product made sure that topics harmful to progressives never found their way into the Trending Topics list.\r\n\r\nIs Mitt on a Suicide Mission?\r\n\r\n&quot;It's a suicide mission,&quot; said the Republican Party Chairman. Reince Priebus was commenting on a Washington Post story about Mitt Romney and William Kristol's plot to recruit a third-party conservative candidate to sink Donald Trump.\r\n\r\nCould Trump win New Hampshire?\r\n\r\nIf the presidential election were held today between the apparent Republican nominee, Donald Trump, and the Democratic front-runner, Hillary Clinton, the outcome would be very close. That's according to a new WBUR poll (topline, crosstabs) of likely New Hampshire voters.\r\n\r\nJustice Clarence Thomas encourages Hillsdale graduates to lead by example\r\nClarence Thomas Speaks at Hillsdale College's Commencement Ceremony\r\n\r\n\r\nPoll: Dems want Sanders as Clinton's VP\r\nDemocratic voters want Hillary Clinton to make Bernie Sanders her running mate, according to a new poll. thirty-six percent say they'd like the Vermont senator to be Clinton's VP, a Rasmussen Reports survey released Tuesday found.\r\n\r\nFlashback: Bill Clinton talking like Trump on immigration\r\n\r\nNumbersUSA pulls quotes from Bill Clinton talking illegal immigration and the problem of border control and being a nation of laws from his 1996 State of the Union which shows a striking comparison to what presumptive Republican presidential candidate Donald Trump has been saying about the","torrent":{"xt":"urn:btih:c4b00e6e088abd1d1adf672edb3dee4397ab5ddb","amp;dn":"The+Laura+Ingraham+Podcast+May+18+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4b00e6e088abd1d1adf672edb3dee4397ab5ddb","infoHashBuffer":{"type":"Buffer","data":[196,176,14,110,8,138,189,29,26,223,103,46,219,61,238,67,151,171,93,219]},"announce":[],"urlList":[]}}