{"title":"World Of Undead","uid":15380752,"size":1378456502,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c5420d067ae127e75cbf0420f6275ea66d675569&amp;dn=World+Of+Undead&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dauphong","files":5,"time":1469227450,"description":"World of Undead is a new and exciting Genre Mix with elements of Character development, fast First Person Shooter gameplay and Tower Defense mechanics. Build and Upgrade Towers in realtime and use them to defend your Energy Core.\r\nPlay the campaign cooperative with your friends or take control over the AI Units and fight against the Defenders.\r\nGame Features\r\n\r\n    Combat - Encounter a wide variety of undead archetypes including Tanks, Mechs and flying enemies.\r\n    Survive - Experience real hardcore Gameplay mechanics. With more players in your Team the game gets more difficult and you have to develop better teamwork.\r\n    Customize - Unlock new skins and change your Characters appearance.\r\n    Advanced Warfare - Gain Experience Points and unlock a lot of Weapons and Gadgets.\r\n    Defense - Defend your Energy Core at all cost. Build a fortress with 8 different Towers.\r\n    Solo - Play the whole Campaign on your own with four levels of difficulty.\r\n    Co-Op - Play the campaign online with up to four Friends. Buckle up and be prepared for the incoming Horde.\r\n    Deathmatch - No more fooling around! Grab all your unlocked Gear and fight against your Friends on 10 different maps.\r\n    Attack &amp; Defend - Join the Defender Team, build up your Stronghold and defend your Core - or join the Attackers Team, gather Money an build a army of devastating destruction and storm the Defenders Base.\r\n    Control - Play with Mouse/Keyboard or your controller - XBOX 360 / One Support\r\n    Who's the best - Stats and Online Leaderboard\r\n    Connect - Fast, cloudbased Server backend with low latency all over the world","torrent":{"xt":"urn:btih:c5420d067ae127e75cbf0420f6275ea66d675569","amp;dn":"World+Of+Undead","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5420d067ae127e75cbf0420f6275ea66d675569","infoHashBuffer":{"type":"Buffer","data":[197,66,13,6,122,225,39,231,92,191,4,32,246,39,94,166,109,103,85,105]},"announce":[],"urlList":[]}}