{"title":"MARKETING DES SERVICES - GABRIEL et al. DUNOD","uid":14652445,"size":2652654,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5c0778c8dc3ee0e11f8eebe5011f890df8ca6d3&amp;dn=MARKETING+DES+SERVICES+-+GABRIEL+et+al.+DUNOD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chak666","files":1,"time":1463660565,"description":"Marketing des Services \r\n\r\nPatrick Gabriel, Ronan Divard, Marine Le Gall-Ely, Isabelle Prim-Allaz\r\nCollection: Management Sup, Dunod\r\n2014 - 288 pages - 170x240 mm\r\nEAN13 : 9782100715527\r\nIllustré de nombreux exemples (hôtellerie, tourisme, transport, banque...), cet ouvrage présente l'ensemble de la politique marketing associée aux services: de la conception d'une promesse de valeur, jusqu'à sa réalisation par l'usager.\r\n\r\nPourquoi développer une démarche marketing particulière lorsqu’il s’agit des services ? Quelles sont les caractéristiques d’un marketing appliqué aux services ?\r\nIntangibilité de l’offre, rôles du prestataire et du client, fonction d’usager, promesse de service… Parce qu’il engage le prestataire au-delà de la transaction avec son client, le marketing des services mobilise des outils spécifiques (blueprint, parcours client, script), adapte fortement des concepts traditionnels (produit, prix, distribution, communication, force de vente et fidélisation), et applique des notions managériales récentes (interactions, expériences gratifiantes, engagement et co-création). Avant tout centré sur la relation avec le client et la valorisation de son expérience du service, ce marketing intègre de plus en plus l’usager au processus de création du service.\r\nIllustré de nombreux cas (Abercrombie &amp; Fitch, Starbucks, La Poste, SNCF, Bouygues Telecom…), à jour des connaissances les plus récentes, ce livre propose une démarche marketing complète, de la conception de l’offre de services jusqu’à leur mise en oeuvre et leur promotion","torrent":{"xt":"urn:btih:c5c0778c8dc3ee0e11f8eebe5011f890df8ca6d3","amp;dn":"MARKETING+DES+SERVICES+-+GABRIEL+et+al.+DUNOD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c0778c8dc3ee0e11f8eebe5011f890df8ca6d3","infoHashBuffer":{"type":"Buffer","data":[197,192,119,140,141,195,238,14,17,248,238,190,80,17,248,144,223,140,166,211]},"announce":[],"urlList":[]}}