{"title":"[Pretty Dirty] Nina Elle (Mommy Got Caught)","uid":14660457,"size":290943079,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c6bd94d2c5e497fbe1d2de6368d2f06d4861a129&amp;dn=%5BPretty+Dirty%5D+Nina+Elle+%28Mommy+Got+Caught%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"distinc","files":5,"time":1463744709,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=3779652384\r\n \nhttp://imagedisco.net/?g=5153633472\r\n\r\n\r\nPlot:\r\n\r\nCheating housewife Nina Elle sneaks outside to talk to her secret lover on the phone and whispers quietly not to wake up her step son Tyler Nixon who is sleeping in the house. With the outside noise being too loud for her to hear, she takes the chance of going back in the house to continue her cell phone sex-capades. She sits on the couch and spreads her legs, touching her soft pussy in between her panties as she gets riled up sexually, anxious to fuck her lover's big cock this weekend. Nina's horniness gets the better of her and Tyler hears her moaning from afar and takes out his phone to record his step mother in the act. Finally he has enough proof to kick her to the curb once and for all.\r\n\r\nTyler jumps out of nowhere scaring the hell out of Nina and calls her out on her adulterous actions. She denies everything and claims Tyler has no proof that she did anything wrong. But Tyler is smart and backs up his evidence before Nina tries to erase the incriminating proof. She becomes helpless, knowing she's caught in a corner she can't get out of and in desperation, she tries to coax Tyler into fucking her for his silence. Tyler doesn't fall for her slutty tricks and refuses to engage in any sexual activity with his mom but she busts out her massive tits and begs Tyler to touch them making him completely vulnerable like a dog in heat. \r\n\r\nTyler drops on his knees motor boating Nina's huge tits and pinches her pink nipples as she demands that he calls her mommy and has him swear she won't say a peep to her husband. At this point Tyler is blinded by Nina's milfy sex drive with his stiff erection bursting out of his jeans. She takes a hold of his cock and strokes it with her hands and mouth, gagging on his shaft as he idolizes her soft, plump ass. They 69 as Tyler tongue fucks Nina's pussy while she continues to gag and worship his cock until she sits on his cock and rides his boner enthusiastically. Her inner thighs slam Tyler's cock as she reverses herself and rides his baloney pony until his groin cannot resist her tight pussy and explodes his hot jizz over her face!","torrent":{"xt":"urn:btih:c6bd94d2c5e497fbe1d2de6368d2f06d4861a129","amp;dn":"%5BPretty+Dirty%5D+Nina+Elle+%28Mommy+Got+Caught%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6bd94d2c5e497fbe1d2de6368d2f06d4861a129","infoHashBuffer":{"type":"Buffer","data":[198,189,148,210,197,228,151,251,225,210,222,99,104,210,240,109,72,97,161,41]},"announce":[],"urlList":[]}}