{"title":"Robert Kroese - The Big Sheep","uid":15391954,"size":224746617,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c6ca30ec708f77a4ffec958ee58cc0d08d38032d&amp;dn=Robert+Kroese+-+The+Big+Sheep&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":1,"time":1469354690,"description":"Los Angeles of 2039 is a baffling and bifurcated place. After the Collapse of 2028, a vast section of LA, the Disincorporated Zone, was disowned by the civil authorities, and became essentially a third world country within the borders of the city. Navigating the boundaries between DZ and LA proper is a tricky task, and there's no one better suited than eccentric private investigator Erasmus Keane. When a valuable genetically altered sheep mysteriously goes missing from Esper Corporation's labs, Keane is the one they call.\r\n\r\nBut while the erratic Keane and his more grounded partner, Blake Fowler, are on the trail of the lost sheep, they land an even bigger case. Beautiful television star Priya Mistry suspects that someone is trying to kill her - and she wants Keane to find out who. When Priya vanishes and then reappears with no memory of having hired them, Keane and Fowler realize something very strange is going on. As they unravel the threads of the mystery, it soon becomes clear that the two cases are connected - and both point to a sinister conspiracy involving the most powerful people in the city. Saving Priya and the sheep will take all of Keane's wits and Fowler's skills, but in the end, they may discover that some secrets are better left hidden.\r\n\r\n\r\n\r\n\r\nRead by Fred Berman\r\nFormat: M4B","torrent":{"xt":"urn:btih:c6ca30ec708f77a4ffec958ee58cc0d08d38032d","amp;dn":"Robert+Kroese+-+The+Big+Sheep","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ca30ec708f77a4ffec958ee58cc0d08d38032d","infoHashBuffer":{"type":"Buffer","data":[198,202,48,236,112,143,119,164,255,236,149,142,229,140,192,208,141,56,3,45]},"announce":[],"urlList":[]}}