{"title":"Vivre dans le coeur (Meditation.Zen) + CD Audio","uid":14644902,"size":50648473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c87a984f12e7822596b1ca33b236e49ba0262a74&amp;dn=Vivre+dans+le+coeur+%28Meditation.Zen%29+%2B+CD+Audio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"asperge","files":7,"time":1463577381,"description":"Drunvalo Melchizédek- Vivre dans le coeur\r\n\r\nDans cet ouvrage, Drunvalo vous fait part de ses connaissances sur le corps de lumière et la géométrie sacrée, et vous explique exactement comment entrer dans l'espace sacré du cœur afin que vous puissiez enfin manifester dans le quotidien ce dont vous rêvez.\r\n\r\n« Il y a très, très longtemps, nous, les humains, savions nous servir d'une forme de communication et de perception qui ne faisait en aucune façon appel au cerveau et renvoyait plutôt à un espace sacré du cœur. »\r\n« À quoi cela sert-il de trouver cet espace dans un monde où la plus grande religion est la science et sa logique? Est-ce que je ne sais pas pertinemment que nous vivons dans un monde où les émotions et les sentiments sont des citoyens de second ordre ? »\r\n« Si, je le sais. Mais mes maîtres m'ont demandé de vous rappeler qui vous êtes vraiment. Ils m'ont surtout demandé de vous rappeler que chacun de vous est bien plus qu'un être humain. Car, en votre cœur, il existe un lieu sacré où le monde peut littéralement être refait par la cocréation consciente. Si vous me le permettez, je vous montrerai ce que l'on m'a montré. »\r\n\r\nDrunvalo Melchizédek se penche sur la conscience pure et le potentiel humain depuis presque quarante ans. Il s'est concentré sur la redécouverte du corps de lumière, le Merkaba, et sur la géométrie sacrée propre à ce corps de lumière et à toute la création. Ce nouvel ouvrage, &quot;Vivre dans le cœur&quot;, qui propose des techniques conduisant à l'espace sacré du cœur, élargit encore plus les possibilités du potentiel humain et le processus de création lui-même. Dans ces pages, Drunvalo vous fait part de ses connaissances et vous explique exactement comment atteindre cet ancien état de conscience afin que vous puissiez enfin manifester dans le quotidien ce dont vous rêvez dans votre cœur. Et quand vous vivez dans votre cœur, l'abondance et l'élévation dans les mondes supérieurs viennent naturellement. Joignez-vous à Drunvalo et faites partie du grand groupe de gens qui ont découvert la joie de vivre dans le lieu où vous et Dieu ne faites qu'UN","torrent":{"xt":"urn:btih:c87a984f12e7822596b1ca33b236e49ba0262a74","amp;dn":"Vivre+dans+le+coeur+%28Meditation.Zen%29+%2B+CD+Audio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c87a984f12e7822596b1ca33b236e49ba0262a74","infoHashBuffer":{"type":"Buffer","data":[200,122,152,79,18,231,130,37,150,177,202,51,178,54,228,155,160,38,42,116]},"announce":[],"urlList":[]}}