{"title":"Asia - Secret Lives, Hidden Places","uid":15368653,"size":1222779999,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c90cf977f1f2996196e3dd017e91a57936f8bf28&amp;dn=Asia+-+Secret+Lives%2C+Hidden+Places&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"salsac","files":6,"time":1469119090,"description":"Experience Asia’s most stunning national parks\r\n\r\nBehind the veil of tourism in Asia’s most stunning National Parks people and animals share the same backyard. Unlike protected areas in North America and Europe, the diverse endangered habitats of Asia are almost always home to people as well as wildlife. This series explores how people and animals live and survive together. Meet gentle Shinto people who have learned how to live in the shadow of an active volcano, a tribal man who cares for orphan elephants by day while wild elephants threaten his village every night and see how the spirits of a tropical island off Borneo stopped a local Imam from cutting down the rainforest. One-horned rhinoceroses, Asiatic elephants, Guizhou golden monkeys and a cast of other wildlife characters fill the lands of Asia from the flood plains of India to the granite peaks of China’s holy mountains. The result is a fusion of great stories, engaging characters and rare and threatened wildlife against a backdrop of drama and beauty.\r\n\r\nList of Episodes:\r\n\r\n    Kaziranga National Park: India – Where Wild Things Roam\r\n    Khao Sok National Park: Thailand – Wild Lives of Khao Sok\r\n    Tun Sakaran Marine Park: Malaysia – Paradise Found\r\n    Aso-Kuju and Unzen-Amakusa National Parks: Japan – Under the Volcano\r\n    Mt Tianzhu and Mt Fanjing National Parks: China – Mountains of the Gods\r\n\r\n\r\n1. Where Wild Things Roam\r\n\r\nDocumentary 45:27\r\n\r\nThe rare one-horned rhinoceros is being poached in Kaziranga National Park. Herds of elephants are on the move and a new born baby elephant has lost its mother. People who live in Kaziranga risk their lives to make sure the wild animals stay safe, including the tigers that also roam the park.\r\n\r\n\r\n2. Mountains Of The Gods\r\n\r\nDocumentary 45:27\r\n\r\nThe man who saved the last colony of Guizhou golden monkeys is getting old. He must pass responsibility on to the next in line. But will his successor be able to keep the monkeys safe? And a Buddhist master needs to replenish her spirit on the peak of a sacred mountain but she is afraid of heights!\r\n\r\n\r\n3. Under The Volcano\r\n\r\nDocumentary 45:09\r\n\r\nNature has created rare beauty here on Kyushu, one of the islands of Japan. But within recent memory, in 1991, there was a devastating volcanic eruption. This is the story of how people live in the shadow of destruction, under the volcanoes of Japan.\r\n\r\n4. Paradise Found\r\n\r\nDocumentary 45:30\r\n\r\nOne of the world’s most diverse reef systems off the coast of Borneo has just become protected - Tun Sakaran Marine Park. It’s a magical paradise where an ancient volcano once erupted. Hundreds of species of corals and fish live here -- and so do many people who rely on the sea to survive.\r\n\r\n5. Wild Lives Of Khao Sok\r\n\r\nDocumentary 45:30\r\n\r\nKhao Sok National Park is framed by karst sandstone formations. Mighty ghost-like shaped rocks mark the shores of lake Khao Sok, a huge reservoir on which only a very few fishermen are permitted to live. Ancient caves are found in the watery depths and in the mountainous heights","torrent":{"xt":"urn:btih:c90cf977f1f2996196e3dd017e91a57936f8bf28","amp;dn":"Asia+-+Secret+Lives%2C+Hidden+Places","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90cf977f1f2996196e3dd017e91a57936f8bf28","infoHashBuffer":{"type":"Buffer","data":[201,12,249,119,241,242,153,97,150,227,221,1,126,145,165,121,54,248,191,40]},"announce":[],"urlList":[]}}