{"title":"EFSoftware EF Commander v11.51","uid":15168953,"size":18384655,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ccd6c3a43ab164d4e8dfb580835cf903d3beefa2&amp;dn=EFSoftware+EF+Commander+v11.51&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZarkBit","files":4,"time":1467375631,"description":"EFSoftware EF Commander v11.51\r\n\r\nEF Commander is a complex and multi-featured file manager that a wide range of users, from beginners to professionals, will find easy to use. It is the result of many requests received by the author. The first version was written in 1994, under the OS/2 operating system using Presentation Manager, as a personal replacement for the old DOS program Norton Commander™. In 1996 it was ported to the 32 bit Microsoft Windows™ operating system.\r\n\r\nHere are some key features of &quot;EF Commander&quot;:\r\n\r\nEasy to use\r\nThe modern interface helps you to have full control over your files and folders.\r\n\r\nTabbed interface\r\nDefine just the views you need in each pane for your folders and files.\r\n\r\nBuilt-in media player\r\nThe EF Commander have a full featured hi quality audio player with playlist and ID3 Tag support. Plays in background with less resources usage MP3, Ogg/Vorbis, FLAC, WMA and WAV. More formats can be play over Winamp Plugins.\r\n\r\nMultirename tool\r\nA versatile function for comfortable renaming of numerous files in a processing step. Use a flexible concept for the clear definition of renaming rules, include rules for MP3 files and EXIF informations.\r\n\r\nThumbnails\r\nQuickly and easily get an overview your photos or other image collections.\r\n\r\nParallel file operations\r\nAll long operations are run with multi-tasking. You can run any number of different operations at the same time, or several instances of the same operation -- for example, you can have several &quot;copy&quot; commands going simultaneously.\r\n\r\nDirect link to PDAs with Windows CE\r\nEF Commander was the first file manager worldwide with this feature. Handle your data in the same way as on your desktop or laptop computer.\r\n\r\nBurn CDs and DVDs direct from EF Commander\r\nNero Burning ROM (www.nero.com) is required.\r\n\r\n7-Zip\r\nInternal packers for more than 20 archive formats\r\nUse EF Commander to pack files or whole folders in any of the common archive formats. No external programs are required.\r\nSupported formats: 7-Zip, ACE, ARC, ARJ, BZIP2, CAB, CPIO, GZIP, IMG, ISO (ISO9660), LHA, RAR, RPM, SFX, SQX, TAR, TBZ (TAR.BZ), TGZ (TAR.GZ), TXZ (TAR.XZ), XZ, ZIP, Zip64, ZOO.\r\n\r\nInternal viewer for many file formats\r\nView picture files and movies, and play MP3, Ogg/Vorbis, FLAC, WMA and WAV audio files, without having to use any other software.\r\n\r\nUse XnView and IrfanView as add-ons\r\nEnlarge the number of available formats to 400 or more. EF Commander runs quietly in the background, but remains fully available to you. Files can also be managed in the internal viewer, in the quick view mode, or as thumbnails.\r\n\r\nFast FTP/FTPS client\r\nThe built-in FTP client features resume download and FxP (server to server transfers), FTPS secure (SSL/TLS) connection.\r\n\r\nInternal text and HEX editor\r\nEF Commander has full text and hex editors for files that are limited only by your system resources.\r\n\r\nFunctions to split/join large files\r\nSplit large files into smaller parts, and recombine the parts.\r\n\r\nCreate/Verify checksums\r\nCheck the integrity of your data. EF Commandersupports the SFV, MD5, SHA1, SHA256 and SHA512 formats.\r\n\r\nSynchronize function\r\nSynchronize your notebook or your LAN with your work station.\r\n\r\nExternal plug-in support for packers, viewers, file system and contents\r\nExtend the functionality of EF Commander with external plugins. Supported formats include WLX, WCX, WFX and Winamp decode plugins.\r\nand much more","torrent":{"xt":"urn:btih:ccd6c3a43ab164d4e8dfb580835cf903d3beefa2","amp;dn":"EFSoftware+EF+Commander+v11.51","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccd6c3a43ab164d4e8dfb580835cf903d3beefa2","infoHashBuffer":{"type":"Buffer","data":[204,214,195,164,58,177,100,212,232,223,181,128,131,92,249,3,211,190,239,162]},"announce":[],"urlList":[]}}