{"title":"Rush Limbaugh - June 30, 2016 Full Podcast.mp3","uid":15165544,"size":86952926,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cdbfd64863fe6f498a6aa715ec1416e28331def1&amp;dn=Rush+Limbaugh+-+June+30%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1467340726,"description":"Rush Limbaugh June 30, 2016 Podcast\r\nWhat I Think Bill Told Loretta\r\n   \r\n\r\n\r\nGet It Now: The NEVER HILLARY Bumper Sticker\r\nTapper: Trump Lives Rent Free in Obama's Head\r\nTaxpayers Will Be Paying for Sex Changes\r\nAmanpour vs. Hannan on CNN\r\nKerry Reveals Left's Plan to Undo Brexit\r\nThese Kind of Stories Used to Be Funny\r\nWhat I Think Bill Told Loretta\r\nNEVER HILLARY! NEVER HILLARY! NEVER HILLARY!\r\n\r\nWhat I Think Bill Told Loretta\r\nJune 30, 2016\r\n\r\nRUSH: We are supposed to believe here that Bill Clinton, a 70-year-old man with a history of heart trouble, played golf in Phoenix where it was 108, 110 degrees, maybe he played on Sunday when it was 108, I don't know.  And then he's on the way to the airport to leave, is told that Loretta Lynch, the attorney general, is soon due to arrive, delays his departure, goes to a vacant private jet on the tarmac where she happens to be.  He delays his departure to go have the meeting at which they discuss their grandchildren and their travels... That just doesn't work for me.  Let me propose an alternative... \r\n\r\n\r\nKerry Reveals Left's Plan to Undo Brexit (And They'll Do the Same If Trump Wins)\r\nJune 30, 2016\r\n\r\nRUSH: There's a strategy, and that is that the European Union does not take losing lying down, just like the Democrat Party and the left here don't.  In fact, I'm not gonna get into it in detail right now, but I want you to be thinking about something.  I want you to fast forward to November. Knowing everything you know now, using intelligence guided by experience, I want you to fast forward to November to Trump winning the presidency in November.  I want you to think, using your intelligence guided by experience, what's gonna happen that night?  What's gonna happen the next day?  What's going to happen every day thereafter?  What's gonna happen the day Trump gets inaugurated?  What is the left gonna do?  They're not gonna just sit idly by and accept this and say, &quot;Good fight.  We gave it everything we had, but we lost.&quot;  They're gonna do everything they can to undermine it. And I think we're gonna see levels of violence that we have not seen.\r\n\r\nHistory Is Made! Taxpayers Now Have the Privilege of Paying for Sex Changes\r\n\r\nHistory Is Made! Taxpayers Now Have the Privilege of Paying for Sex Changes\r\n\r\n\r\nAmanpour vs. Hannan on CNN -- Whatever It Was, It Wasn't an Interview\r\nJune 30, 2016\r\n\r\nRUSH: Christiane Amanpour was supposedly interviewing Daniel Hannan. He's the very conservative -- we love the guy -- member of the Parliament in Great Britain, and she was interviewing him about the Brexit vote and it was not an interview. It was an allegation. She was actually a prosecutor, he was a witness, and she was trying to put him in jail. It was the most incredible thing. \r\n\r\nThe Kind of Stories We Used to Find Funny But Now Have to Take Seriously\r\n\r\nRUSH: There are a couple of stories here that, in the old days we would do these and have a great yuk and a great laugh about them, thinking everybody else would also find them funny and laughable, not realizing that a decent size of the population would be identifying with the subject matter and angered by it or in support of it.  So we haven't stopped reporting this kind of stuff, but I have changed my attitude about it, realizing now that a decent number of people who hear it are going to not think it's funny, that they're either gonna agree with it or think it's very serious.\r\n\r\nRUSH: History is being made as we speak.  The Defense Secretary is lifting the ban on transgenders in the military.  You know why?  So that we, now as taxpayers, will have the privilege of paying for sex change procedures.  Oh, you don't think -- ask Chelsea Manning about that, if you doubt me.\r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:cdbfd64863fe6f498a6aa715ec1416e28331def1","amp;dn":"Rush+Limbaugh+-+June+30%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdbfd64863fe6f498a6aa715ec1416e28331def1","infoHashBuffer":{"type":"Buffer","data":[205,191,214,72,99,254,111,73,138,106,167,21,236,20,22,226,131,49,222,241]},"announce":[],"urlList":[]}}