{"title":"The Whole Woman ^ Germaine Greer ^ azw3","uid":14751542,"size":979296,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ce0af77d205f3484862a866db9187e7173e8481f&amp;dn=The+Whole+Woman+%5E+Germaine+Greer+%5E+azw3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":1,"time":1464768849,"description":"Thirty years after the publication of The Female Eunuch, Germaine Greer is back with the sequel she vowed never to write.\r\n\r\n&quot;A marvelous performance--. No feminist writer can match her for eloquence or energy; none makes [us] laugh the way she does.&quot;--The Washington Post\r\n\r\nIn this thoroughly engaging new book, the fervent, rollicking, straight-shooting Greer, is, as ever, &quot;the ultimate agent provocateur&quot; (Mirabella). With passionate rhetoric, outrageous humor, and the authority of a lifetime of thought and observation, she trains a sharp eye on the issues women face at the turn of the century.\r\n\r\nFrom the workplace to the kitchen, from the supermarket to the bedroom, Greer exposes the innumerable forms of insidious discrimination and exploitation that continue to plague women around the globe. She mordantly attacks &quot;lifestyle feminists&quot; who blithely believe they can have it all, and argues for a fuller, more organic idea of womanhood. Whether it's liposuction or abortion, Barbie or Lady Diana, housework or sex work, Greer always has an opinion, and as one of the most brilliant, glamorous, and dynamic feminists of all time, her opinions matter. For anyone interested in the future of womanhood, The Whole Woman is a must-read.\r\n\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy.\r\n\r\nheliiaruy heliiaruy heliiaruy","torrent":{"xt":"urn:btih:ce0af77d205f3484862a866db9187e7173e8481f","amp;dn":"The+Whole+Woman+%5E+Germaine+Greer+%5E+azw3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce0af77d205f3484862a866db9187e7173e8481f","infoHashBuffer":{"type":"Buffer","data":[206,10,247,125,32,95,52,132,134,42,134,109,185,24,126,113,115,232,72,31]},"announce":[],"urlList":[]}}