{"title":"Toriko [Manga Ita Cbr] vol. 38 [TNT Village]","uid":14755388,"size":88632918,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cec18de4195d63a7ad52b49abd1a597bfe31b453&amp;dn=Toriko+%5BManga+Ita+Cbr%5D+vol.+38+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"turchez90","files":1,"time":1464802735,"description":".:Locandina:.\r\n\r\n[img]http://i.imgur.com/XpZ2tMo.jpg[/img]\r\n\r\n.:Scheda:.\r\n\r\nAutore: Mitsutoshi Shimabukuro\r\nTitolo: Toriko\r\nTipologia: Manga\r\nPagine: 200 circa a volume\r\nVolumi: 38 - in corso\r\nAnno: 2012 - in corso\r\nNazionalità: Giappone\r\nGenere: Shonen - Demenziale - Azione\r\nLingua: Italiano\r\nDimensione del file: 84,5 MB\r\nFormato del file: CBR (JPG)\r\n\r\n.:Trama:.\r\n\r\nIn un'epoca passata imprecisata, moltissimi stati erano perennemente in guerra. A risolvere questa situazione giunse Acacia, il capostipite dei cosiddetti &quot;fornitori di alimenti di lusso&quot; (美食屋 Bishokuya?), conosciuti anche come Gourmet Hunter, che fece mangiare a tutti i capi di Stato il prodigioso alimento GOD; i leader allora rinsavirono dalla loro follia guerrafondaia e il mondo tornò alla pace.\r\n\r\nAnni dopo, il mondo vive nella cosiddetta &quot;Era dei buongustai&quot;: il gusto e la consistenza degli alimenti sono estremamente importanti ed esistono professionisti che sono specializzati nel reperire o catturare ingredienti e animali rari. Toriko, essendo uno dei quattro &quot;sovrani del cielo&quot;, è uno di questi procacciatori; seguendo una consuetudine deontologica della categoria, sogna di trovare i più preziosi prodotti alimentari del mondo e creare il menù definitivo, cioè comporre un pasto completo con gli ingredienti più preziosi che ha reperito di persona. Da cacciatore abilissimo qual è, egli è regolarmente assunto da ristoranti e persone facoltose per cercare nuovi ingredienti e animali rari e difficili da reperire (per ogni obiettivo è stabilito un livello per la difficoltà di cattura: per il 1° serve una squadra di 10 cacciatori). Uomo con capacità sovrannaturali, egli utilizza la sua incredibile forza e la conoscenza del regno animale per catturare bestie rare con l'obiettivo di realizzare il menù più delizioso mai preparato. Attualmente è accompagnato dal debole e timido chef Komatsu che, ispirato dall'ambizione di Toriko, viaggia con lui per migliorare le sue abilità culinarie e trovare gli ingredienti più rari.\r\n\r\nDurante le avventure emergerà e si accentuerà progressivamente la rivalità tra l'I.G.O. e la Mafia Alimentare prima, e la N.E.O. poi, organizzazioni interessate al cibo ma fondate e governate da persone con approccio e ideali assai diversi; lo scontro coinvolgerà inevitabilmente i campioni delle relative organizzazioni.\r\n\r\n\r\n.:Screenshots:.\r\n\r\n[img]http://i.imgur.com/gp0HIUT.png[/img]\r\n\r\n[img]http://i.imgur.com/7IF68gY.png[/img]","torrent":{"xt":"urn:btih:cec18de4195d63a7ad52b49abd1a597bfe31b453","amp;dn":"Toriko+%5BManga+Ita+Cbr%5D+vol.+38+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cec18de4195d63a7ad52b49abd1a597bfe31b453","infoHashBuffer":{"type":"Buffer","data":[206,193,141,228,25,93,99,167,173,82,180,154,189,26,89,123,254,49,180,83]},"announce":[],"urlList":[]}}