{"title":"Dance Moms (HD) Season 1 Complete","uid":15413983,"size":16764441198,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf16188fd2bea868eeee306b4a02e01d90d3d457&amp;dn=Dance+Moms+%28HD%29+Season+1+Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tblurr","files":25,"time":1469577526,"description":"http://www.imdb.com/title/tt1991410/?ref_=ttpl_pl_tt \r\n \nhttp://www.mylifetimetv.ca/Shows/Dance_Moms/\r\n\r\nSet in Pittsburgh's renowned Abby Lee Dance Company, owned and operated by notoriously demanding and passionate instructor Abby Lee Miller, the series follows children's early steps on the road to stardom, and their doting mothers who are there for every rehearsal, performance and bow...all under the discerning eye of Miller. Seeing the highs and lows surrounding competition season delivers an intriguing and dramatic look at the cast's frantic pursuit of the ultimate National Dance title.\r\n\r\nSeason 1\r\n\r\n The Competition Begins S1, Ep1\r\n13 Jul. 2011 The Competition Begins\r\nMeet dance instructor Abby Lee Miller, the Dance Moms and their daughters as the competition season begins and they travel from Pittsburgh to Phoenix. The Dance Moms will push their young daughters to great lengths to get them to Nationals and Abby reveals big news to her young dance girls.\r\n \r\n Wildly Inappropriate S1, Ep2\r\n20 Jul. 2011 Wildly Inappropriate\r\nThe moms allow their girls to wear revealing outfits in a competition and scandal ensues. Meanwhile, Abby's new racy routine raises eyebrows.\r\n \r\n Cheerleading Blues S1, Ep3\r\n27 Jul. 2011 Cheerleading Blues\r\nThe Dance Moms need to win this week's competition to stay in the game, but chaos ensues when Mom Kelly's daughter wants to drop out of dance as she's hurt her hip and she just wants to be a cheerleader. Kelly works hard to convince her daughter to stay in dance, pushing her so far that she risks permanent injuries.\r\n \r\n Stealing the Show S1, Ep4\r\n3 Aug. 2011 Stealing the Show\r\nAbby gives each girl one solo dance for the next competition. However, she gives two solos to her star dancer, Maddie, clearly providing her with an advantage over the others. Christi has seen this too many times and lashes out at Abby with uncontrolled fury.\r\n \r\n When Stars Collide S1, Ep5\r\nAug. 2011 When Stars Collide\r\nThe Abby Lee Dance Studio is on edge after learning a big Broadway casting director will attend their annual Dance Showcase, an exhibition in which she shows off her accomplished dancers. Abby's desire to push the girls to the max could have catastrophic effects if they don't show their best.\r\n \r\n Dying to Dance S1, Ep6\r\n17 Aug. 2011 Dying to Dance\r\nOn their way to a big competition, Christi finds out her grandmother has just been admitted to a hospital. She now must choose what's more important to her--go to the hospital to sit by her grandmother's side or go to the dance competition.\r\n \r\n She's a Fighter S1, Ep7\r\n24 Aug. 2011 She's a Fighter\r\nAbby's continuous typecasting of little Nia in ethnic stereotype roles sends her mother Holly over the edge. For the first time, Holly takes off the gloves and the fighter in her comes out.\r\n \r\n Love on the Dance Floor S1, Ep8\r\n31 Aug. 2011 Love on the Dance Floor\r\nAbby plays cupid with Brooke and her duet partner, hoping their off-stage romance will make on-stage drama.\r\n \r\n From Ballerinas to Showgirls S1, Ep9\r\n7 Sep. 2011 From Ballerinas to Showgirls\r\nChloe finds herself at the top of Abby's pyramid for the first time; but is she being set up? Meanwhile, Cathy is secretly readying her Candy Apple dancers to go against Abby's dancers.\r\n \r\n Cathy Brings It On! S1, Ep10\r\n14 Sep. 2011 Cathy Brings It On!\r\nIn Hollywood Kelly decides to secretly hire choreographers to give Brooke and Paige an edge. To everyone's shock, Cathy arrives with her Candy Apple dancers to go head to head against Abby's dancers.\r\n \r\n It All Ends Here S1, Ep11\r\n28 Sep. 2011 It All Ends Here\r\nAfter competing all season, it all boils down to this--the National Title Competition. Abby's dancers have been on a losing streak and this is their last chance to prove they can win. Meanwhile, Melissa leaves the competition early to go on vacation. Her ex-husband, Kurt, steps in as &quot;Dance Dad, sending Melissa into a panic.\r\n \r\n Only One Will Be a Star S1, Ep12\r\n5 Oct. 2011 Only One Will Be a Star\r\nAbby's dancers go from amateurs to professionals after being cast to perform in a Hollywood music video.\r\n \r\n Most Outrageous Moments S1, Ep13\r\n12 Oct. 2011 Most Outrageous Moments\r\nIn this hour long special, Abby will count down her favorite and most outrageous moments from Dance Moms Season 2","torrent":{"xt":"urn:btih:cf16188fd2bea868eeee306b4a02e01d90d3d457","amp;dn":"Dance+Moms+%28HD%29+Season+1+Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf16188fd2bea868eeee306b4a02e01d90d3d457","infoHashBuffer":{"type":"Buffer","data":[207,22,24,143,210,190,168,104,238,238,48,107,74,2,224,29,144,211,212,87]},"announce":[],"urlList":[]}}