{"title":"Zeitgeist Addendum (NTSC DVD5 ISO)","uid":15212432,"size":4136042496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4491843c678b9cff9c65c99212c151f6d10b289&amp;dn=Zeitgeist+Addendum+%28NTSC+DVD5+ISO%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1bsm17","files":1,"time":1467674935,"description":"NTSC DVD5 720 ISO\r\n\r\nReady to Burn\r\n\r\nwww.thezeitgeistmovement.com \nhttp://www.zeitgeistaddendum.com/\r\n\r\n\r\nZeitgeist: Addendum, 2008, was born out of public interest in possible solutions to the cultural issues presented in Peter Joseph's first work, Zeitgeist: The Movie. Building upon the topics of social distortion and corruption, Addendum moves to also present possible solutions.\r\n\r\nFeatured in the work is former &quot;Economic Hit-man&quot; and New York Times bestselling author, John Perkins, along with The Venus Project, an organization for social redesign created by Social Engeneer and Industrial Designer Jacque Fresco.\r\n\r\nZeitgeist: Addendum was premiered at the 5th Annual Artivist's Film Festival and given its highest award in 2008.\r\n\r\n&quot;Director Peter Joseph demonstrates the ability to take risky subject matter and turn it into a visually, emotionally, and intellectually compelling case for a greater point of view,&quot; states Diaky Diaz. &quot;Millions of people gravitated toward Peter's first film. We are excited that this year's Artivist Film Festival will provide a platform to once again, pique the curiosity of millions of viewers and continue the dialogue about topics concerning Americans and citizens worldwide.&quot;\r\n\r\nIt was released online for free on Oct. 3rd 2008 and since then it has been estimated to have been downloaded over 70 million times. As with the previous release - non-commercial, open distribution is allowed/encouraged. This work can be freely screened, shared, uploaded, downloaded in both compressed and DVD form ( via torrents ) without restriction - as long as no money is exchanged","torrent":{"xt":"urn:btih:d4491843c678b9cff9c65c99212c151f6d10b289","amp;dn":"Zeitgeist+Addendum+%28NTSC+DVD5+ISO%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4491843c678b9cff9c65c99212c151f6d10b289","infoHashBuffer":{"type":"Buffer","data":[212,73,24,67,198,120,185,207,249,198,92,153,33,44,21,31,109,16,178,137]},"announce":[],"urlList":[]}}