{"title":"Yu-Gi-Oh! Pyramid of Light (subbed)","uid":15487954,"size":462348437,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d5b6b8ce181ba8150169083bdd03a8a547d56726&amp;dn=Yu-Gi-Oh%21+Pyramid+of+Light+%28subbed%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ipodmonesta","files":1,"time":1470342620,"description":"Yu-Gi-Oh! Pyramid of Light (subbed)\r\n720p HD\r\nThe anime movie is in Japanese, but it has English subtitles so you can watch it\r\n\r\n\r\n\r\nDetails:The events of Battle City have just concluded, and Yugi now owns all three Egyptian God cards. Seto Kaiba longs to finally defeat him, and he has a plan. He suspects that since Maximillion Pegasus created the Egyptian God cards, he would have also created a way to beat them, just in case something ever went wrong.\r\n\r\nKaiba heads off to Pegasus's castle and challenges him to a duel. The stakes are the following: if Pegasus wins, he gets Kaiba's three &quot;Blue Eyes White Dragons&quot;; if Kaiba wins, Pegasus hands over the card that can beat the Egyptian Gods. Kaiba wins, and Pegasus must fulfill his wager: he picks up two cards from Pegasus's decks. However, Pegasus is confused; he only created one card to beat the Egyptian Gods, not two...\r\n\r\nMeanwhile, Yugi Muto and Téa Gardner, seeking refuge from a mob of duelists wanting to face Yugi for the Egyptian Gods, stumble into Domino Museum, where they discover a new attraction on display called the Pyramid of Light, which looks a little like the Millennium Puzzle. Yugi's grandpa, Solomon Muto (who also happens to be visiting the museum), reads an inscription on the side of a sarcophagus (The eye that sees what's yet to come, its vision shall be fulfilled, unless blinded by events predetermined, thus light &amp; shadows both be killed), triggering a strange vision in Yugi's mind concerning his Millennium Puzzle, the Pyramid of Light, Anubis, and Kaiba. After he wakes up, he finds the pyramid stolen, the sarcophagus now empty, and Mokuba standing outside. Mokuba says that Kaiba wants Yugi to bring his duel disk to the KaibaCorp Duel Dome immediately. \r\n\r\n\r\n\r\n\r\n\r\n.flv format. Can't play it? Use Vlc media player","torrent":{"xt":"urn:btih:d5b6b8ce181ba8150169083bdd03a8a547d56726","amp;dn":"Yu-Gi-Oh%21+Pyramid+of+Light+%28subbed%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5b6b8ce181ba8150169083bdd03a8a547d56726","infoHashBuffer":{"type":"Buffer","data":[213,182,184,206,24,27,168,21,1,105,8,59,221,3,168,165,71,213,103,38]},"announce":[],"urlList":[]}}