{"title":"It Takes A Thief","uid":15162155,"size":1024066456,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d6b05bf393de46cea5973b6f5bba7e21019647d9&amp;dn=It+Takes+A+Thief&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jedds","files":16,"time":1467327351,"description":"\n\r\n\r\n\r\n\r\n\r\n\r\nTrack List:\r\n\r\n01. Amerimacka\r\n02. Lebanese Blonde\r\n03. Facing East\r\n04. Holographic Universe\r\n05. Shadow Of Ourselves\r\n06. Sound The Alarm\r\n07. Until The Morning\r\n08. Sweet Tides\r\n09. Satyam Shivam Sundaram\r\n10. All That We Perceive\r\n11. Air Batucada\r\n12. Exilio (Rewound)\r\n13. Vampires\r\n14. Warning Shots\r\n15. The Richest Man In Babylon\r\n16. The Passing Stars\r\n\r\n©℗2010 ESL Music 1849 Calvert Street, NW Washington, DC 20009 \nhttps://www.eslmusic.com\r\n\r\nManufactured and Distributed by Fontana Distribution, LLC. WARNING: All rights reserved.\r\nUnauthorized duplication is a violation of applicable laws and subject to criminal punishment[You'll get the timeout chair]. Made in the United States of America.\r\n\r\n&quot;Steel Garage&quot; Image © Andrzej Liguz/moreimages.net (He did the garage shutters the Dj's are standing behind i guess...). All rights reserved.\r\n&quot;Studio Panoramic&quot; Image © db baxley, (He did the panoramic of the studio they use and it's a very awesome image and is actual &quot;artwork&quot; hah.(The panoramic is saved in the FLAC files m8ys.)) All rights reserved.\r\n\r\nESL164\r\n\r\n[on CD]: ©2010 ESL Music Calvert St., NW Washington, DC, 20009 Manufactured &amp; Distributed by Fontana Distribution, LLC. WARNING: All rights reserved. Unauthorized duplication is a violation and subject to criminalpunishment. Made in the USA. www.eslmusic.com ESL 164.\r\n\r\nPLEASE BUY A DIGITAL COPY OF THIS ARTIST ON AMAZON OR SOMETHING!Actually, DO NOT buy DIGITAL COPIES, they probably encode the songs in MP3 or something!!! MP3 CBR @320KBPS is the most DECENT lossy quality. SO support the artist and buy a hard copy (an actual CD and CD casing)so they can make a living too. MUSIC EQUIPMENT ISN'T THAT CHEAP NEITHER. I actually went to four or five of their live music shows too. One was in Sydney, Australia at some festival in 2007 that i forgot was called Lol. Another was at the 2nd,3rd,or 4th IDR Virgin FREE Festival. I managed to get 2 tickets using the Opera web browser. The site was flooded and good ol' Opera got me them tickets. The virgin free festival took place Merriweather Post Pavilion &amp; so did the other concerts i went to see them.\r\n\r\nSO PLEASE SUPPORT THIEVERY CORPORATION BY GOING TO THEIR SHOWS! THEIR SHOWS ARE FUCKING COOL AS FUCK TOO!!!\r\n\r\nONLY USE THESE FLAC FILES TO LISTEN TO ONLY. Please do burn these files and try and sell them or play the songs at a commercial place (such as if you work at Gamestop and want to play the song on the PA system in the store.) Shit like that is illegal.\r\nI HAVE NO CONTROL WHAT YOU DO WITH THESE FILES! \r\n\r\n\r\nEnjoy the Album It Takes A Thief, The Very Best Of:\r\nAlbum by: Thievery Corporation.\r\nRipped, Encoded, Tagged(better)Photography of CD album(in the file), Compression Level 8 Lossless FLAC &amp; Uploaded by: JEDDS\r\n\r\nENJOY GUYS AND PLEASE SEED SINCE ITS A BIG TORRENT. \r\n(1,024,066,456 bytes)","torrent":{"xt":"urn:btih:d6b05bf393de46cea5973b6f5bba7e21019647d9","amp;dn":"It+Takes+A+Thief","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6b05bf393de46cea5973b6f5bba7e21019647d9","infoHashBuffer":{"type":"Buffer","data":[214,176,91,243,147,222,70,206,165,151,59,111,91,186,126,33,1,150,71,217]},"announce":[],"urlList":[]}}