{"title":"BoundGods--BG-40253 Trenton Ducati and Max Cameron Hi HD","uid":14867030,"size":2258504467,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d7495dd33d73be3310ab463bc0efb264a272e0f5&amp;dn=BoundGods--BG-40253+Trenton+Ducati+and+Max+Cameron+Hi+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":2,"time":1465554753,"description":"Prison Bitch Takes a Cock in the Ass and Electricity in His Balls\r\n  \r\nJun 9, 2016 - Trenton Ducati  and  Max Cameron \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nIt is Max Cameron's last day in prison before going on parole, and Officer Trenton Ducati makes sure to give Max some much needed advice before he leaves. Officer Ducati bends Max over his knee and gives him a nice hard smack on the ass for everyday he's spent in prison. He then shoves Max's face down on his cock until Max feels Trenton's throbbing dick in his throat. Officer Ducati picks Max up and handcuffs him to an overhead ring before flogging him mercilessly. Max takes the beating like a good prison bitch, thinking that the punishment will over soon. Officer Ducati lets him know that he is only getting started and presses Max against the cell bars. Trenton binds him to the cell using a combination of belts and saran wrap. Officer Ducati covers Max's cock with different electric devices that are all hooked up to Trenton's black box of torment. Officer Ducati sends electricity through Max's most sensitive areas until Max is begging to cum. Officer Ducati then rips Max off the cell wall and throws him onto the prison bed, where he sticks his hard cock up Max's tight ass. Trenton makes sure Max knows that no matter where he is, he will always be a prison bitch to Officer Ducati, and his gaping hole will be indisputable proof. Trenton fucks Max's ass until he can't take it any longer and shoots his cum all over Max's wet tongue. Max spends his final moments before becoming a free man blowing his sticky load all over himself.\r\n\r\nScreens \nhttp://www.kinkondemand.com/kod/shoot/40253-Prison-Punk-Scared-Straight-by-Perverted-Officer-Ducati.html\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:d7495dd33d73be3310ab463bc0efb264a272e0f5","amp;dn":"BoundGods--BG-40253+Trenton+Ducati+and+Max+Cameron+Hi+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7495dd33d73be3310ab463bc0efb264a272e0f5","infoHashBuffer":{"type":"Buffer","data":[215,73,93,211,61,115,190,51,16,171,70,59,192,239,178,100,162,114,224,245]},"announce":[],"urlList":[]}}