{"title":"Zeitgeist: Moving Forward (NTSC DVD5)","uid":15212440,"size":4686041088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d93520525d6f4b4be8f673157f0e3dd04f5ce214&amp;dn=Zeitgeist%3A+Moving+Forward+%28NTSC+DVD5%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"1bsm17","files":13,"time":1467675029,"description":"NTSC DVD5\r\nReady to Burn\r\n\r\n\r\nZeitgeist: Moving Forward, by director Peter Joseph, is a feature length documentary work which presents a case for a transition out of the current socioeconomic monetary paradigm which governs the entire world society.\r\n\r\nThis subject matter transcends the issues of cultural relativism and traditional ideology and moves to relate the core, empirical &quot;life ground&quot; attributes of human and social survival, extrapolating those immutable natural laws into a new sustainable social paradigm called a &quot;Resource-Based Economy&quot;.\r\n\r\nHistory - Zeitgeist: Moving Forward was released in 60+ countries and in 25+ languages on January 15th 2011. This large scale release was not associated with any major distributor.\r\n\r\n\r\n\r\nA feature length documentary work which will present a case for a needed transition out of the current socioeconomic monetary paradigm which governs the entire world society.\r\n\r\nThis subject matter will transcend the issues of cultural relativism and traditional ideology and move to relate the core, empirical life ground attributes of human and social survival, extrapolating those immutable natural laws into a new sustainable social paradigm called a Resource-Based Economy.\r\n\r\nFollowing on from Zeitgeist: The Movie, Zeitgeist: Addendum, Zeitgeist Movement Activist and Orientation Guide, Moving Forward reinforces and clarifies the information presented in those films.\r\n\r\nIt is done so in a crystal clear fashion beginning with an examination of the conditioning that shapes our behavior, moving on to the failures of the monetary/market system, it's resultant socio-economic collapse and finally, the transition into a resource based economy for the betterment of humankind. (if we survive)\r\n\r\nQuestions that may have remained following addendum are addressed and i find it hard to believe that people could attempt to &quot;debunk&quot; the ideas presented in this film. That would be akin to attempting to debunk science itself.\r\n\r\n\r\n\r\n\r\nSynopsis\r\n\r\nThe film begins with an animated sequence narrated by Jacque Fresco. He describes his adolescent life and his discontinuation of public education at the age of 14 and describes his early life influences.\r\n\r\nPart I: Human Nature\r\n\r\nHuman behavior and the nature vs. nurture debate is discussed, which Robert Sapolsky refers to as a &quot;false dichotomy.&quot; Disease, criminal activity, and addictions are also discussed. The overall conclusion of Part I is that social environment and cultural conditioning play a large part in shaping human behavior.\r\n\r\nPart II: Social Pathology\r\n\r\nJohn Locke and Adam Smith are discussed in regard to modern economics. The film critically questions the economic need for private property, money, and the inherent inequality between agents in the system. Also seen critically is the need for cyclical consumption in order to maintain market share, resulting in wasted resources and planned obsolescence. According to the movie, the current monetary system will result in default or hyperinflation at some future time.\r\n\r\nPart III: Project Earth\r\n\r\nAs with Zeitgeist: Addendum, the film presents a &quot;resource-based economy&quot; as advocated by Jacque Fresco discussing how human civilization could start from a new beginning in relation to resource types, locations, quantities, to satisfy human demands; track the consumption and depletion of resources to regulate human demands and maintain the condition of the environment.\r\n\r\nPart IV: Rise\r\n\r\nThe current worldwide situation is described as disastrous. A case is presented that pollution, deforestation, climate change, overpopulation, and warfare are all created and perpetuated by the socioeconomic system. Various poverty statistics are shown that suggest a progressive worsening of world culture.\r\n\r\nThe final scene of the film shows a partial view of earth from space, followed by a sequence of superimposed statements; &quot;This is your world&quot;, &quot;This is our world&quot;, and &quot;The revolution is now&quot;.\r\n\r\nList of Interviewees\r\n\r\nDr. Adrian Bowyer\r\nDr. Colin J. Campbell\r\nJacque Fresco\r\nJeremy J. Gilbert\r\nDr. James Gilligan\r\nMax Keiser\r\nDr. Behrokh Khoshnevis\r\nDr. Gábor Máté\r\nDr. John McMurtry\r\nRoxanne Meadows\r\nMichael Ruppert\r\nDr. Robert Sapolsky\r\nRichard Wilkinson","torrent":{"xt":"urn:btih:d93520525d6f4b4be8f673157f0e3dd04f5ce214","amp;dn":"Zeitgeist%3A+Moving+Forward+%28NTSC+DVD5%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d93520525d6f4b4be8f673157f0e3dd04f5ce214","infoHashBuffer":{"type":"Buffer","data":[217,53,32,82,93,111,75,75,232,246,115,21,127,14,61,208,79,92,226,20]},"announce":[],"urlList":[]}}