{"title":"Nanotechnology for the Energy Challenge 2nd ed","uid":15506131,"size":11510641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db83ec69ed09b0bb501fd5dc0fa427bc9f19dbf6&amp;dn=Nanotechnology+for+the+Energy+Challenge+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470586689,"description":"Nanotechnology for the Energy Challenge 2nd ed - Javier García-Martínez (Wiley-VCH, 2013).pdf\r\n\r\nWith the daunting energy challenges faced by Mankind in the 21st century, revolutionary new technologies will be the key to a clean, secure and sustainable energy future. Nanostructures often have surprising and very useful capabilities and are thus paving the way for new methodologies in almost every kind of industry.\r\n\r\nThis exceptional monograph provides an overview of the subject, and presents the current state of the art with regard to different aspects of sustainable production, efficient storage and low-impact use of energy.\r\n\r\nComprised of eighteen chapters, the book is divided in three thematic parts:\r\n\r\nPart I Sustainable Energy Production covers the main developments of nanotechnology in clean energy production and conversion, including photovoltaics, hydrogen production, thermal-electrical energy conversion and fuel cells.\r\n\r\nPart II Efficient Energy Storage is concerned with the potential use of nanomaterials in more efficient energy storage systems such as advanced batteries, supercapacitors and hydrogen storage.\r\n\r\nPart III Energy Sustainability shows how nanotechnology helps to use energy more efficiently, and the mitigation of impacts to the environment, with special emphasis on energy savings through green nanofabrication, advanced catalysis, nanostructured light-emitting and eletrochromic devices and CO2 capture by nanoporous materials .\r\n\r\nAn essential addition to any bookshelf, it will be invaluable to a variety of research fields including materials science, chemical engineering, solid state, surface, industrial, and physical chemistry, as this is a subject that is very interdisciplinary","torrent":{"xt":"urn:btih:db83ec69ed09b0bb501fd5dc0fa427bc9f19dbf6","amp;dn":"Nanotechnology+for+the+Energy+Challenge+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db83ec69ed09b0bb501fd5dc0fa427bc9f19dbf6","infoHashBuffer":{"type":"Buffer","data":[219,131,236,105,237,9,176,187,80,31,213,220,15,164,39,188,159,25,219,246]},"announce":[],"urlList":[]}}