{"title":"Private Schulz","uid":15506153,"size":2517101432,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dbb4c2a47164ba1f95912ccfe846dfbe2a3f2a6a&amp;dn=Private+Schulz&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Psychodad149","files":14,"time":1470587397,"description":"Private Schulz\r\n\r\nStarring:\t\r\nMichael Elphick\r\nIan Richardson\r\nPrivate Gerhard Schulz - Michael Elphick\r\nMajor Neuheim - Ian Richardson\r\nBertha Freya - Billie Whitelaw\r\nGertrude Steiner - Rula Lenska\r\nIphraim &quot;Solly&quot; Solikoff - Cyril Shaps\r\nSchumacher - Terence Suffolk\r\nProfessor Bodelschwingh - David Swift\r\n\r\nProduced by the BBC\r\n1980\r\n\r\n&quot;Private Schultz&quot; is a comedy series (6 one-hour episodes) from the BBC chronicling the wartime misadventures of Gerhard Schulz. The story begins in the summer of 1939, in Germany, with Schulz being released from prison after serving a sentence (another one) for fraud. By accident, and virtue of the fact that he is fluent in five languages, including English, Schulz is recruited into SS Counter-Espionage, where his casual suggestions impress his commanding officer, who passes them along to his own superiors. At one point, BBC touches real history, and Schulz suggests that the SS counterfeit British currency in an attempt to bankrupt Great Britain. This plan was actually executed under the name of Operation Bernhard, and Private Schulz retells the story with a certain degree of historical accuracy, such as the fact that many of the counterfeiters were prisoners of concentration camps, and that the operation itself was conducted from a camp. (Another historical detail which appears substantially accurately involves a notorious, high-class brothel which is thoroughly bugged by the SS.)\r\n\r\nFrom this factual basis, a comedy of errors soon grows. Schulz himself is directed to parachute into England with a quantity of the bogus bills and start spending. His efforts fail -- spectacularly. Schulz spends a part of the war as a POW of his own side, who do not believe his assertions that he is with the SS. Eventually, he is re-united with his former commanding officer, and the counterfeiting resumes. Fiction again intersects with history, as the few high-ranking German officers involved in the plot begin using the funny money to buy up valuable artwork. Eventually, the pursuit of the banknotes takes on a flavor of &quot;It's A Mad Mad...World&quot;, as the war winds down and ends (spoiler alert -- Germany loses).\r\n\r\nThere are two similar and related Yiddish words which describe some unfortunate people: schlemiel and schlomossel. The difference has been characterized this way: the schlemiel is the waiter who always spills the soup. The schlomossel is who the soup always spills on.\r\n\r\nGerhard Schulz is the schlomossel. Despite his best efforts, everything just seems to go wrong somehow, and instead of a suitcase full of money, a beautiful girl, and fine schnapps, there he is with soup down his neck again.\r\n\r\nDespite this, Schulz does manage to find his happy ending -- although the series ends with a visual punch line worthy of &quot;Fawlty Towers&quot;.\r\n\r\nVery well done is the incorporation of historical film into the series. Each episode opens with period footage from Allied or Axis source, newsreel or propaganda release, and during the episode. These not only help the viewer put himself into the historical period, mentally, but also set the general time frame of the story arc. I can't vouch for the accuracy of the English-language dub which accompanies the German footage, but it seems appropriate.\r\n\r\nAs a technical note of sorts, a subtle touch helps portray the linguistics involved. Obviously, when Schulz is in Germany surrounded by Germans, he is &quot;really&quot; speaking German, and actor Michael Elphick speaks in (presumably) his own natural, Cockney voice. However, when Schulz is &quot;really&quot; speaking English, it is with the slight accent and deliberate hesitation one might expect. \r\n\r\nAll in all, a lost gem. I remember watching this when it aired in 1980, and I don't think it was ever shown again. Well worth watching, and well worth preserving","torrent":{"xt":"urn:btih:dbb4c2a47164ba1f95912ccfe846dfbe2a3f2a6a","amp;dn":"Private+Schulz","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbb4c2a47164ba1f95912ccfe846dfbe2a3f2a6a","infoHashBuffer":{"type":"Buffer","data":[219,180,194,164,113,100,186,31,149,145,44,207,232,70,223,190,42,63,42,106]},"announce":[],"urlList":[]}}