{"title":"Peter Joseph - Zeitgeist Film Series (Original Motion Picture So","uid":15212507,"size":72906835,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dbe4f679d127b1cb8e8f21f3650c5026bdf34f51&amp;dn=Peter+Joseph+-+Zeitgeist+Film+Series+%28Original+Motion+Picture+So&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"1bsm17","files":15,"time":1467675289,"description":"Peter Joseph - Zeitgeist Film Series (Original Motion Picture Soundtrack) 2014 MP3\r\n\r\n01 Overture\r\n02 Exposition A\r\n03 March\r\n04 Grave\r\n05 Pesante\r\n06 Theme\r\n07 Exposition B\r\n08 Minaccioso\r\n09 Grandioso\r\n10 Marcatto\r\n11 Exposition C\r\n12 Maestoso\r\n13 Dolace\r\n14 Coda\r\n15 Reprise\r\n \nhttps://itunes.apple.com/us/...-series-original/id947600400 \nhttp://peterjoseph.info/ \nhttp://www.thezeitgeistmovement.com/ \nhttp://www.gentlemachineproductions.com/\r\n\r\nJoseph began his professional career working in advertising and as a private equity trader on Wall Street. In 2007 he produced a live performance art piece that he entitled &quot;Zeitgeist.&quot; The production was never intended for distribution, but was released online and went viral with millions of views. It became the first in a trilogy of films produced by Joseph, the others being Zeitgeist:Addendum and Zeitgeist:Moving Forward, released in 2008 and 2011 respectively.\r\n\r\nIn 2009, Joseph founded The Zeitgeist Movement, a self-described &quot;sustainability advocacy organization.&quot; It was originally started as the &quot;activist arm&quot; of an organization called The Venus Project, launched by Jacque Fresco in 1994. In 2011 the two organizations separated. Joseph's work with the Movement and the Trilogy has been the subject of national media attention to include articles in the The New York Times, The Palm Beach Post, VC Reporter, and TheMarker.\r\n\r\nJoseph is the owner of Gentle Machine Productions LLC, a production company that has released many of his projects, including the Zeitgeist film trilogy. It also is responsible for the production of the Culture in Decline, a web series launched by Joseph in 2012, as well as Joseph's new feature film project: InterReflections.\r\n\r\nPeter Joseph directed a &quot;short-film&quot; music video for the heavy metal music group Black Sabbath, entitled &quot;God Is Dead?&quot; The film had its world-premiere screening at the band's June 6, 2013, album release in Hollywood's Harmony Gold Preview Center. The music video film is largely composed of symbolism extracted from Joseph's Zeitgeist trilogy, coupled with layers of imposed archival imagery of the band.\r\n\r\nJoseph has given many lectures and interviews, including two TEDx talks, a feature at the 2011 Cine Futuro film festival, a feature at the 2011 Leaders Causing Leaders conference and appeared on RT TV numerous times. Other coverage includes The Joe Rogan podcast in 2012, The Young Turks, the Marker TV in Israel, and a feature in the New York Times. A proponent of Occupy Wall St, he gave public speeches in both New York and Los Angeles. He was a judge in the 2015 USFUCA Worldwide Youth Contest supporting youth generated technological progress and has been featured by The Global Summit. Joseph is also on the steering committee of Project Peace on Earth","torrent":{"xt":"urn:btih:dbe4f679d127b1cb8e8f21f3650c5026bdf34f51","amp;dn":"Peter+Joseph+-+Zeitgeist+Film+Series+%28Original+Motion+Picture+So","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe4f679d127b1cb8e8f21f3650c5026bdf34f51","infoHashBuffer":{"type":"Buffer","data":[219,228,246,121,209,39,177,203,142,143,33,243,101,12,80,38,189,243,79,81]},"announce":[],"urlList":[]}}