{"title":"Wondership Q","uid":15379367,"size":642411391,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:de9ae2ed9101788a8444fec4b39064654c09eaab&amp;dn=Wondership+Q&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dauphong","files":1,"time":1469217181,"description":"Wondership Q, released as Airship Q for PS Vita, is a 2D action RPG with sandbox elements. You play as the protagonist of this story who’s suddenly been turned into a cat by a witch. Not only that, but now it’s your job to save your kidnapped brother. Fly through the air on your very own airship, solve mysteries, and craft until your heart’s content!\r\n\r\nDevelopment of Wondership Q started with just 3 people full of passion. Thanks to the support of many, this game gained successful crowd-funding at a service called Makuake in 2013, and from there it just kept growing and growing. Get ready to take yourself on an amazing adventure!\r\n\r\nFeatures\r\n\r\nCraft, Craft, Craft Away!\r\nCreativity is the key to exploring and surviving this vast world. You’ll need to get really inventive to work your way out of some sticky situations. Let your imagination run wild!\r\n\r\nUse the Natural World to Your Advantage\r\nRain falls, water flows, plants grow, and fire burns... Use your knowledge of the natural world as you run, jump, fly, dig, build, fight, and more! Your actions create a unique world you could never have imagined.\r\n\r\nEnjoy Nostalgic Pixel Art\r\nWondership Q is full of gorgeous pixel art, reminiscent of classic and beloved retro games, but with modern gameplay.\r\n\r\nCreate Your Own Worlds!\r\nNot only is there an RPG-like story mode, there is also a world creation mode where you can create your very own stages. Then, place start and goal flags in the world you’ve created in challenge mode! See if you can defeat your own imagination","torrent":{"xt":"urn:btih:de9ae2ed9101788a8444fec4b39064654c09eaab","amp;dn":"Wondership+Q","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de9ae2ed9101788a8444fec4b39064654c09eaab","infoHashBuffer":{"type":"Buffer","data":[222,154,226,237,145,1,120,138,132,68,254,196,179,144,100,101,76,9,234,171]},"announce":[],"urlList":[]}}