{"title":"Black Couples Dominate White Girls","uid":14880237,"size":2319747833,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e0ee1b59b57417ef4a817a3f243f9d2d0a3e3333&amp;dn=Black+Couples+Dominate+White+Girls&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"distinc","files":12,"time":1465662652,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4482568214\r\n \nhttp://imagedisco.net/?g=747063058\r\n\r\nBritney Young, Lola Hart, Janet Mason, Misty Stone, Marica Hase, Chanell Heart, Miley May, Monique Symone, Rachel Rose, Ana Foxxx.\r\n\r\nStudio:\r\n\r\nBlacks On Blondes\r\n\r\nTags:\r\n\r\nAll Sex, Interracial, Big Dicks\r\n\r\n\r\nDescription:\r\n\r\nBritney Young, Lola Hart\r\n\r\nIt's truly a sad day when a white guy lies to a black couple in the hopes of getting some action. Britney Young and her worthless boyfriend are swingers looking for some play on the dark side of the city. Unfortunately, the limp loser over exaggerated about the size of his dick and the black girl from the other couple is not too pleased about that. They now have two options: They can call it a night and leave without sowing their wild oats; or they can have the white guy sit out and get humiliated for lying. The now &quot;cuckold&quot; gets verbally cut down to size as Shane Diesel now gets Lola Hart and Britney Young all to himself. The white cuckold watches as both black cock sluts take turns stuffing as much of Shane down their throats as their gag reflexes will allow. The cuckold? Well, he's just a walking, talking ATM machine and Shane and the ladies raid his wallet. Shane takes it slow as he slides his black chimney inside Britney. Remember, Britney's only had limp white dicks rub against her clitoris; the transition to a cock ( a functioning one, at that) is new territory for this stacked blonde. Lola feels her black boyfriend's meat stretching her pussy lips while Britney lectures her boyfriend-that's now wearing a chastity device- about lying and his faults as a man. Britney jumps on Shane's big black cock as she munches on Lola's creamy black pussy. Shane Diesel lays the pipe down on both bitches as the cuckold can only watch, and , assumingly, curse the day he was born. The only thing left for Shane to do is drain his baby sauce on Britney's massive jugs. The cuckold's duty? Just watch for yourself","torrent":{"xt":"urn:btih:e0ee1b59b57417ef4a817a3f243f9d2d0a3e3333","amp;dn":"Black+Couples+Dominate+White+Girls","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ee1b59b57417ef4a817a3f243f9d2d0a3e3333","infoHashBuffer":{"type":"Buffer","data":[224,238,27,89,181,116,23,239,74,129,122,63,36,63,157,45,10,62,51,51]},"announce":[],"urlList":[]}}