{"title":"PE Manager v1.3.3 full + data [apkpita]","uid":14669454,"size":1048130630,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:e36cc86cc083998d5a72e1ee08f83eca2f5c7cb4&amp;dn=PE+Manager+v1.3.3+full+%2B+data+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1463853075,"description":"Create your dream team in PES CLUB MANAGER, the new football game from the popular Pro Evolution Soccer franchise featuring over 5,000 licensed players and stunning 3D matches! Select and train your players, build your own clubhouse and give tactical instructions to your team to become the best club manager in the world!\r\n\r\n・ 3D Matches Powered by the Pro Evolution Soccer Console Game Engine \r\nPES CLUB MANAGER uses an optimised version of the game engine from the well-known console video game, Pro Evolution Soccer 2015. Realistic 3D matches and real-time stats will help you lead your team to the top!\r\n\r\n・ In-depth Real-time Match Simulation \r\nChange your tactics and control your team in real time. Do you have what it takes to win the title? The realistic match simulation and real-time tactical instructions during matches will satsify even the most dedicated football fans!\r\n\r\n・ 5,000+ Officially Licensed Real Players From all Over the World \r\nPES CLUB MANAGER includes official licenses for real leagues and clubs from Europe and South America, with over 5,000 real players waiting to join your team! Test your skills against European Giants such as Bayern Munich, Juventus and Paris Saint-Germain.\r\n\r\n・ Progress at Your Own Pace \r\nYou are in full control of the season. Play as many matches as you want, anytime, anywhere!\r\n\r\nWhat's new:\r\nIntroducing a new element for the Hall of Fame, the Club Museum!\r\nBuild a team under the revamped Hall of Fame feature to prepare for the upcoming event!\r\n[Update Details]\r\n・A new facility, the Club Museum, will be added.\r\n・Bug fixes and modifications will be made.\r\n\r\nThis is an online only game \r\nRequires Android OS 4.2 and up \r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:e36cc86cc083998d5a72e1ee08f83eca2f5c7cb4","amp;dn":"PE+Manager+v1.3.3+full+%2B+data+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e36cc86cc083998d5a72e1ee08f83eca2f5c7cb4","infoHashBuffer":{"type":"Buffer","data":[227,108,200,108,192,131,153,141,90,114,225,238,8,248,62,202,47,92,124,180]},"announce":[],"urlList":[]}}