{"title":"NETGATE.Spy.Emergency.21.0.505.0","uid":14781704,"size":54413274,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e6183bca44693e3dcfc3fc577a1fd68171e9901a&amp;dn=NETGATE.Spy.Emergency.21.0.505.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roflcopter2110","files":4,"time":1464992236,"description":"http://extraimago.com/images/2016/06/03/oCyffhb.png\r\n\r\nNETGATE.Spy.Emergency.21.0.505.0\r\n\r\nSpy Emergency – is the anti spyware, anti malware, anti spam solution that fast and secure removes spyware, malware, spam and other internet threats from your computer. Spy Emergency protects you against thousands of various infections and potencially unwanted software, including spyware, adware, spam, virus, trojans, worms, homepage hijackers, remote administration tools, activex components, dialers, scumware, keyloggers, data mining software, toolbars, tracking cookies, browser, hijackers/BHO’s. Spy Emergency do not slow down your computer and still protects you while your are working not like others spyware removal software. Spy Emergency has more than 985,000 threat definitions in its signature database! Small and regular definition updates greatly reduce update downloading time.\r\n\r\nYou might be running free Anti-Spyware to save money but these products may not catch really bad stuff and in the wild malware and spyware including worms and trojan horses. So you need something more powerful antispyware weapon like Spy Emergency really is. With built in malware detection heuristics Spy Emergency detects new and unknown in the wild malware threats even before they are detected by other vendors virus scan and signatures update.\r\n\r\nSpy Emergency supports not only detection for adware malware and spyware but even detection for malware threats like trojans, worms and backdoors. It checks your e-mails not only for malware but for spam messages too with built-in spam filter. When trojan worm or computer virus is detected it is automatically blocked.\r\n\r\nJust simply three clicks to wash your problems away with Spy Emergency spyware adware removal software. By simply clicking the Start button your system scan starts immediately. Click on the Next button to review detected items, click on the Remove button to remove it.\r\n\r\nFeatures\r\n• Support for Internet Explorer, Mozilla Firefox and Opera browsers\r\n• Scan of your system memory\r\n• Scan of your registry\r\n• Scan of your storage\r\n• Built-in anti-spam\r\n• System directory storage scan\r\n• Tracking cookies scan\r\n• Host file scan\r\n• Hijackers scan\r\n• Heuristic malware detection\r\n• Polymorhic malware detection\r\n• Generic unpacker with support for UPX, Aspack\r\n• Command line interface\r\n• Automatic LSP stack repair\r\n• Real-time memory shields that blocks spyware before it executes\r\n• Prevention shields that blocks malware installation\r\n• Browser shields, including homepage shield\r\n• Tracking cookies shields\r\n• Automatic database updates\r\n• News updates\r\n• Individual spy restore functionality\r\n• Keeplist\r\n• Scheduling support\r\n• Simple configuration\r\n• Intuitive and clear user interface for spyware removal\r\n• Handy Shell Extension Scanning\r\n• Skin support\r\n• Language support\r\n• Premium Technical support\r\n• and much more…\r\n\r\nLanguages: English, German, Czech, Slovak, French, Dutch, Hungarian, Polish, Slovenian, Russian, Portuguese, Spanish, Italian","torrent":{"xt":"urn:btih:e6183bca44693e3dcfc3fc577a1fd68171e9901a","amp;dn":"NETGATE.Spy.Emergency.21.0.505.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6183bca44693e3dcfc3fc577a1fd68171e9901a","infoHashBuffer":{"type":"Buffer","data":[230,24,59,202,68,105,62,61,207,195,252,87,122,31,214,129,113,233,144,26]},"announce":[],"urlList":[]}}