{"title":"Arnell - Sym #4 - Yates, Royal Scottish Nat O (2007) [Philidor]","uid":15382182,"size":127806962,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e78c13c1a6f366b2c80280b665de6ea5422c3f40&amp;dn=Arnell+-+Sym+%234+-+Yates%2C+Royal+Scottish+Nat+O+%282007%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Philidor","files":6,"time":1469236976,"description":"&quot;Superbly crafted and convincingly modern, though imbued with an expressivity most modern composers would have abjured, the Fourth and Fifth symphonies of English composer Richard Arnell arguably deserve to be heard as often as the symphonies of his contemporaries Alwyn and Arnold. In this superlative coupling of his Fourth Symphony from 1948 and his Fifth Symphony from 1957, Arnell emerges as a cogent composer who sets out to achieve great things and accomplishes them with style and panache. With the Royal Scottish National Orchestra led by Martin Yates, the three-movement Fourth is big, brawny, and intensely dramatic without succumbing to histrionics, while the three-movement Fifth is even bigger and more dramatic, but with a warm tone and a sunny optimism in the finale that make it potentially Arnell's most popular symphony were it to be heard by a larger audience. In these brilliantly recorded performances, it stands its best chance of reaching that audience. Dutton's sound is exemplary in its presence and immediacy.&quot; - James Leonard, allmusic.com\r\n\r\nIt should be added that during the late 1940s and 1950s, Arnell developed a musical language melding Prokofiev, Copland, Hindemith, and his own dryly satirical manner into something very personal","torrent":{"xt":"urn:btih:e78c13c1a6f366b2c80280b665de6ea5422c3f40","amp;dn":"Arnell+-+Sym+%234+-+Yates%2C+Royal+Scottish+Nat+O+%282007%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e78c13c1a6f366b2c80280b665de6ea5422c3f40","infoHashBuffer":{"type":"Buffer","data":[231,140,19,193,166,243,102,178,200,2,128,182,101,222,110,165,66,44,63,64]},"announce":[],"urlList":[]}}