{"title":"Elton John - Live In Australia (1987) [EAC-FLAC]","uid":15146948,"size":509956205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea7de05b4ad0674233c69095ea38af708c612bad&amp;dn=Elton+John+-+Live+In+Australia+%281987%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pucholoco","files":25,"time":1467239290,"description":"Elton John - Live In Australia with The Melbourne Symphony Orchestra (1987)\r\n              EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 464 Mb\r\n                    Full Artwork @ 300 dpi (jpg) -&gt; 22 Mb\r\n\r\n\r\n\r\nThe late '80s were wrought with equal measures of tremendous professional popularity and personal crisis for Elton John. \r\n\r\nAs he would reveal later, this inspired double-LP live collection released in 1987 captures the artist at one of the best and worst times of his life. In fact, John cites the emotionally charged &quot;Don't Let the Sun Go Down on Me&quot; and &quot;Sorry Seems to Be the Hardest Word&quot; as triggering what would become a &quot;severe mental breakdown,&quot; the results of nearly a decade of substance-fueled decadence. On top of it all and perhaps most tellingly is John's tattered voice. \r\n\r\nSo dire was the situation that literally within weeks of the concert he would undergo a surgical procedure that could have easily ended his career had it failed. Perhaps the ultimate irony is that at this precise moment John was launching his re-association with MCA Records via this live career retrospective, which was simultaneously broadcast throughout the entire globe. \r\n\r\nKeeping all of that in mind, Elton John once again proved himself as a consummate showman, performing at the peak of his abilities. John's comparatively small combo is augmented on these tracks by the 88-piece Melbourne Symphony Orchestra under the direction of onetime bandmate James Newton Howard. \r\n\r\nThere are a few surprisingly strong readings of early sides such as &quot;60 Years On,&quot; &quot;I Need You to Turn To,&quot; &quot;The Greatest Discovery,&quot; and an edgy and soulful version of &quot;The King Must Die.&quot; Other unexpected detours into John's catalog include the intimate desperation of &quot;Tonight&quot; from Blue Moves (1976) and &quot;Have Mercy on the Criminal&quot; from Don't Shoot Me I'm Only the Piano Player (1973). \r\n\r\nThere are also the hits and enthusiast favorites &quot;Tiny Dancer,&quot; &quot;Your Song,&quot; &quot;Candle in the Wind&quot; (which was issued as a single and topped pop music charts worldwide), the previously mentioned &quot;Sorry Seems to Be the Hardest Word,&quot; and &quot;Don't Let the Sun Go Down on Me.&quot; The companion home video includes a few additional performances, such as the thoroughly inspiring &quot;One Horse Town.&quot; While not entirely essential, Live in Australia is at its core an adeptly executed concert package.\r\n\r\n\r\n-------------------------------------------------------------------------------\r\nTracklist:\r\n-------------------------------------------------------------------------------\r\n\r\n01. Sixty Years On \r\n02. I Need You To Turn To \r\n03. The Greatest Discovery \r\n04. Tonight \r\n05. Sorry Seems To Be The Hardest Word \r\n06. The King Must Die \r\n07. Take Me To The Pilot \r\n08. Tiny Dancer \r\n09. Have Mercy On The Criminal\r\n10. Madman Across The Water \r\n11. Candle In The Wind \r\n12. Burn Down The Mission \r\n13. Your Song \r\n14. Don't Let The Sun Go Down On Me\r\n\r\n*1987 MCA Records #MCAD-8022\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:ea7de05b4ad0674233c69095ea38af708c612bad","amp;dn":"Elton+John+-+Live+In+Australia+%281987%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea7de05b4ad0674233c69095ea38af708c612bad","infoHashBuffer":{"type":"Buffer","data":[234,125,224,91,74,208,103,66,51,198,144,149,234,56,175,112,140,97,43,173]},"announce":[],"urlList":[]}}