{"title":"Almanac of Fall 1984 DVDRip Sonata Premiere","uid":14661828,"size":1468208285,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f46e902a0b1a2f82d0fa7bbc8ac5b37c88de3c3b&amp;dn=Almanac+of+Fall+1984+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kleen2","files":3,"time":1463764248,"description":"Possibly inspired by the existential play No Exit by Jean-Paul Sartre, this story about five people living in close quarters in a small apartment conveys the same angst as Sartre's well-known story about the nature of hell. Like the 1962 movie version of the play, Oszi Almanach is also garishly lighted, with scenes red-tinted on one side and blue-tinted on the other. Close-ups show a dermatologist's interest in skin, an example of the kind of bizarre abstraction that underscores the alienation in this film. A single, older mother owns the apartment, where she is tended by a nurse who has brought along a presumed lover. The sick woman's son lives there too, constantly thinking about how to get his hands on his mother's money. The last member of this unhappy &quot;family&quot; is a former teacher now down on his luck and out of work. The three men and the nurse are dependent on the sick woman, on her money and her apartment, just as she is dependent on them. Yet these individuals are two-faced, scheming, and prone to anger. Unable to break away and leave, at the same time they find no solace in staying -- making a difficult two hours of misery for the average viewer to take on without a therapist.\r\n\r\n\r\nLanguage: Hungarian\r\n\r\n\r\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:f46e902a0b1a2f82d0fa7bbc8ac5b37c88de3c3b","amp;dn":"Almanac+of+Fall+1984+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46e902a0b1a2f82d0fa7bbc8ac5b37c88de3c3b","infoHashBuffer":{"type":"Buffer","data":[244,110,144,42,11,26,47,130,208,250,123,188,138,197,179,124,136,222,60,59]},"announce":[],"urlList":[]}}