{"title":"Rush Limbaugh - July 25, 2016 Full Podcast.mp3","uid":15406049,"size":260011500,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f4a530e0244f35e8e0f432e95925509e55382487&amp;dn=Rush+Limbaugh+-+July+25%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1469507268,"description":"Rush Limbaugh - July 25, 2016 Full Podcast\r\n\r\nDemocrats: Party of Doom and Gloom\r\n\r\nRUSH: The left has frightened young people to death.  One of the most successful campaigns to scare young people and to keep 'em in line has been this whole global warming thing.  It is uncanny how many young people -- and they've been watching Captain Planet since they were 5 years old, kindergarten, grade school, junior high, middle school, high school. They have been taught that humanity is destroying the planet, their parents and their grandparents.  And they believed it.  And they believe there's not gonna be a habitable planet by the time they are 60, 65 years old, maybe even before.  They really believe this.  And, if you take time to understand how they have just been smothered with this stuff, you would understand why the Democrats have made it possible.  And this is how using fear, using darkness, using a never-ending crisis rooted in chaos, they keep these people loyal to Big Government command-and-control Democrat-run institutions, all to save the planet.  \r\n\r\nTrump Poll Bounce Rattles Experts\r\n\r\nRUSH: Trump got a convention bounce and it's a big one, a six-point convention bounce...  Believe me. Don't doubt me on this. Despite the smiling and attempts at everything's okay and all is normal that you're seeing from Democrats this week, they're worried. They are panicked. Because Trump was supposed to be nowhere near Hillary. Trump was not supposed to be close, much less leading.\r\n\r\nDNC Emails Prove What We Knew\r\nRUSH: You know how I'm gonna get into this email stuff? I'm gonna go back, we got some See, I Told You So's, things that I have told you in recent months, in the past year and a half. Things I predicted. I knew these things were gonna happen. I knew the game was rigged against Crazy Bernie. I knew all this 'cause I know these people. I know the left. I know the Democrats. I know liberals. I know how they operate, and so you'll hear in the See, I Told You So's from weeks, months, and a little over a year-and-a-half ago how I foretold all of this that is in this WikiLeak email document. \r\n\r\nFlashback: When Tim Kaine Ran in Virginia, He Said He Was a Conservative\r\n\r\nRUSH: When he runs for office in Virginia, her vice presidential nominee? Why, you would not believe how conservative this guy sounds! Proving another of my many often-made points, that Democrats -- in order to win elections, national elections -- have to make people think that they are not who they are.  They cannot run as progressives, liberal extremists. \r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:f4a530e0244f35e8e0f432e95925509e55382487","amp;dn":"Rush+Limbaugh+-+July+25%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4a530e0244f35e8e0f432e95925509e55382487","infoHashBuffer":{"type":"Buffer","data":[244,165,48,224,36,79,53,232,224,244,50,233,89,37,80,158,85,56,36,135]},"announce":[],"urlList":[]}}