{"title":"Brazzers - Anal Fantasy","uid":14647004,"size":2391351937,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fa5959f36873f66c8c7c3e97ddd1dc053dccfb47&amp;dn=Brazzers+-+Anal+Fantasy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"reikockk","files":1,"time":1463600600,"description":"Title: Anal Fantasy\r\nProduction: Brazzers\r\nYear: 2016\r\nFile type: mp4\r\nFile size: 2.23 GB\r\nDuration: 3:08:48 min\r\nImage size: 720x404\r\nQuality: 5\r\n\r\nScreenshots:\r\n  \nhttp://gatehost.org/view-image/178ec2e92b7552f5a6ff887fe71d5cf1.jpg\r\n \nhttp://gatehost.org/view-image/c60317935de7fa36471c9aedc812e4a7.jpg\r\n\r\nDescription:\r\n  AJ's Fantasy Anal Sex\r\nToday's extra-special scene started with AJ ass-naked by the pool and shaking her big ol 'booty in the sun. After getting hosed down and TWERKING her thick booty, this blonde hottie Keiran invited over to give her a taste of the rough stuff, throat-fucking, gagging, and a hard anal pounding.\r\n\r\nWhat's Gotten Into You?\r\n\r\nTheir years into marriage, and Ashley Fires is not getting anything she needs from her dead-beat husband. No job, no attention and worst of all, no sex. But her constant nagging seemed to wake up a ferocious sex drive Ashley did not know Keiran still had. He took control and gave her exactly what she wanted: a good stiff fuck.\r\n\r\nBig Pervert Meets Big Ass\r\n\r\nAnikka Albrite is home from college, and her brother's friend Xander was in love from the moment he saw That big round booty of hers. When Anikka caught him sniffing her panties, she buried his face deep in her juicy butt until his big cock was nice and hard, and then she hopped on him for an incredible 69.\r\n\r\nSt-Valentine's Day Assacre Part Two\r\n\r\nValentine's day this year, Jynx has a special plan to giver her boyfriend Mick Blue the holiday of a lifetime! Before he heads to work, the little Latina slut gives Mick a blowjob, leaving him with blue balls to ensure code That he's thinking about her all day long. After a hard day's work, Mick comes home to find his real gift.\r\n\r\nPok-Her Asshole\r\n\r\nHow in the hell are the guys at Keiran's poker night supposed to focus on the cards when Buddy's wife is walking around dressed like a Vegas call girl? When Keiran's buddy ran out of money, Keiran waited for the right hand and went all in, winning the chance to do whatever he wanted to the best butt in town.\r\n\r\nCast:\r\n Ashley Fires, AJ Applegate, Anikka Albrite, Jada Stevens, Jynx Maze, London Keyes","torrent":{"xt":"urn:btih:fa5959f36873f66c8c7c3e97ddd1dc053dccfb47","amp;dn":"Brazzers+-+Anal+Fantasy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa5959f36873f66c8c7c3e97ddd1dc053dccfb47","infoHashBuffer":{"type":"Buffer","data":[250,89,89,243,104,115,246,108,140,124,62,151,221,209,220,5,61,204,251,71]},"announce":[],"urlList":[]}}